

{
  "0": {
    "title": "Federated Learning for 6G Communications: Challenges, Methods, and Future Directions",
    "description": "As the 5G communication networks are being widely deployed worldwide, both industry and academia have started to move beyond 5G and explore 6G communications. It is generally believed that 6G will be established on ubiquitous Artificial Intelligence (AI) to achieve data-driven Machine Learning (ML) solutions in heterogeneous and massive-scale networks. However, traditional ML techniques require centralized data collection and processing by a central server, which is becoming a bottleneck of large-scale implementation in daily life due to significantly increasing privacy concerns. Federated learning, as an emerging distributed AI approach with privacy preservation nature, is particularly attractive for various wireless applications, especially being treated as one of the vital solutions to achieve ubiquitous AI in 6G. In this article, we first introduce the integration of 6G and federated learning and provide potential federated learning applications for 6G. We then describe key technical challenges, the corresponding federated learning methods, and open problems for future research on federated learning in the context of 6G communications.",
    "entities": {
      "0": {
        "entity name": "Federated learning",
        "Type": "6G-related technique",
        "Functions": "distributed AI approach with privacy preservation nature",
        "Benefits": "privacy preservation, vital solution to achieve ubiquitous AI in 6G",
        "Application and deployment scenarios": "various wireless applications",
        "Associated technologies": "Artificial Intelligence (AI), Machine Learning (ML)"
      }
    }
  },

  "1": {
    "title": "Towards 6G Network Slicing",
    "description": "Networks should connect communicating peers, supporting vertical services requirements. The network evolution towards 6G requires native network slicing techniques. Some literature approaches claim network slice realization, but they do not convincingly address the deployment across multiple Autonomous Systems. This work investigates the current 6G network slicing landscape, presents some gaps, and introduces the concept of the recursive network slicing between multiple Autonomous Systems, supported by the NASOR approach. This innovative concept supports implementing new network services required by the 6G vision. This work also sheds light on the 6G requirements for network slicing.",
    "entities": {
      "0": {
        "entity name": "Network slicing",
        "Type": "6G-related technique",
        "Functions": "native network slicing techniques, recursive network slicing between multiple Autonomous Systems",
        "Benefits": "supports implementing new network services required by the 6G vision",
        "Components and sub-systems": "NASOR approach",
        "Application and deployment scenarios": "deployment across multiple Autonomous Systems"
      }
    }
  },

  "2": {
    "title": "Smart Buildings Enabled by 6G Communications",
    "description": "Smart building (SB), a promising solution to fast-paced and continuous urbanization around the world, includes the integration of a wide range of systems and services and involves the construction of multiple layers. SB is capable of sensing, acquiring, and processing a very large amount of data as well as performing appropriate actions and adaptation. Rapid increases in the number of connected nodes and thereby the data transmission demand of SB have led to conventional transmission and processing techniques becoming insufficient to provide satisfactory services. In order to enhance the intelligence of SBs and achieve efficient monitoring and control, sixth generation (6G) communication technologies, particularly indoor visible light communications (VLC) and machine learning (ML), are required to be incorporated in SBs. Herein, we envision a novel SB framework featuring a reliable data transmission network, powerful data processing, and reasoning abilities, all of which are enabled by 6G communications. Primary simulation results support the promising visions of the proposed SB framework.",
    "entities": {
      "0": {
        "entity name": "Smart building (SB)",
        "Type": "6G-related technique",
        "Functions": "sensing, acquiring, and processing a very large amount of data, performing appropriate actions and adaptation",
        "Benefits": "enhance the intelligence of SBs, achieve efficient monitoring and control",
        "Components and sub-systems": "indoor visible light communications (VLC), machine learning (ML)",
        "Application and deployment scenarios": "fast-paced and continuous urbanization"
      }
    }
  },

  "3": {
    "title": "6G Communication: Envisioning the Key Issues and Challenges",
    "description": "In 2030, we are going to evidence the 6G mobile communication technology, which will enable the Internet of Everything. Yet 5G has to be experienced by people worldwide and B5G has to be developed; the researchers have already started planning, visioning, and gathering requirements of the 6G. Moreover, many countries have already initiated the research on 6G. 6G promises connecting every smart device to the Internet from smartphone to intelligent vehicles. 6G will provide sophisticated and high QoS such as holographic communication, augmented reality/virtual reality and many more. Also, it will focus on Quality of Experience (QoE) to provide rich experiences from 6G technology. Notably, it is very important to vision the issues and challenges of 6G technology, otherwise, promises may not be delivered on time. The requirements of 6G poses new challenges to the research community. To achieve desired parameters of 6G, researchers are exploring various alternatives. Hence, there are diverse research challenges to envision, from devices to softwarization. Therefore, in this article, we discuss the future issues and challenges to be faced by the 6G technology. We have discussed issues and challenges from every aspect from hardware to the enabling technologies which will be utilized by 6G.",
    "entities": {
      "0": {
        "Entity name": "6G mobile communication technology",
        "Type": "6G-related technique",
        "Functions": "enable the Internet of Everything; provide sophisticated and high QoS such as holographic communication, augmented reality/virtual reality",
        "Benefits": "high QoS; focus on Quality of Experience (QoE) to provide rich experiences from 6G technology",
        "Components and sub-systems": "hardware; enabling technologies",
        "Key performance indicators": "QoS; QoE",
        "Application and deployment scenarios": "holographic communication; augmented reality/virtual reality; connecting every smart device to the Internet from smartphone to intelligent vehicles",
        "Associated technologies": "B5G (Beyond 5G)"
      }
    }
  },


"4": {
    "title": "Towards Decentralized Identity Management in Multi-stakeholder 6G Networks",
    "description": "Trust-building mechanisms among network entities of different administrative domains will gain significant importance in 6G because a future mobile network will be operated cooperatively by a variety of different stakeholders rather than by a single mobile network operator. The use of trusted third party issued certificates for initial trust establishment in multi-stakeholder 6G networks is only advisable to a limited extent, as trusted third parties not only represent single point of failures or attacks, but they also cannot guarantee global independence due to national legislation and regulatory or political influence. This article proposes to decentralize identity management in 6G networks to enable secure mutual authentication between network entities of different trust domains without relying on a trusted third party and to empower network entities with the ability to shape and strengthen cross-domain trust relationships by the exchange of verifiable credentials. A reference model for decentralized identity management in 6G is given as an initial guide for the fundamental design of a common identity management system whose operation and governance are distributed equally across multiple trust domains of interconnected and multi-stakeholder 6G ecosystems.",
    "entities": {
      "0": {
        "Entity name": "decentralized identity management in 6G networks",
        "Type": "6G-related technique",
        "Functions": "enable secure mutual authentication between network entities of different trust domains without relying on a trusted third party; empower network entities with the ability to shape and strengthen cross-domain trust relationships by the exchange of verifiable credentials",
        "Components and sub-systems": "reference model; verifiable credentials",
        "Control mechanisms": "distributed",
        "Application and deployment scenarios": "interconnected and multi-stakeholder 6G ecosystems"
      }
    }
  },


  "5": {
    "title": "6G Network Operation Support System",
    "description": "6G is the next-generation intelligent and integrated digital information infrastructure, characterized by ubiquitous interconnection, native intelligence, multi-dimensional perception, global coverage, green and low-carbon, native network security, etc. 6G will realize the transition from serving people and people-things communication to supporting the efficient connection of intelligent agents, and comprehensively leading the digital, intelligent and green transformation of the economy and the society. As the core support system for mobile communication network, 6G OSS needs to achieve high-level network automation, intelligence and digital twinning capabilities to achieve end-to-end autonomous network operation and maintenance, support the operation of typical 6G business scenarios and play a greater social responsibility in the fields of environment, society, and governance (ESG).This paper provides a detailed introduction to the overall vision, potential key technologies, and functional architecture of 6G OSS . It also presents an evolutionary roadmap and technological prospects for the OSS from 5G to 6G.",
    "entities": {
      "0": {
        "entity name": "6G OSS",
        "Type": "6G-related technique",
        "Functions": "achieve high-level network automation, intelligence and digital twinning capabilities",
        "Benefits": "end-to-end autonomous network operation and maintenance, support the operation of typical 6G business scenarios",
        "Application and deployment scenarios": "environment, society, and governance (ESG)"
      }
    }
  },

  "6": {
    "title": "6G Network Business Support System",
    "description": "6G is the next-generation intelligent and integrated digital information infrastructure, characterized by ubiquitous interconnection, native intelligence, multi-dimensional perception, global coverage, green and low-carbon, native network security, etc. 6G will realize the transition from serving people and people-things communication to supporting the efficient connection of intelligent agents, and comprehensively leading the digital, intelligent and green transformation of the economy and the society. As the core support system for mobile communication network, 6 6G BSS need to integrate with new business models brought about by the development of the next-generation Internet and IT, upgrade from \"network-centric\" to \"business and service centric\" and \"customer-centric\". 6G OSS and BSS systems need to strengthen their integration to improve the operational efficiency and benefits of customers by connecting the digital intelligence support capabilities on both sides of supply and demand. This paper provides a detailed introduction to the overall vision, potential key technologies, and functional architecture of 6G BSS systems. It also presents an evolutionary roadmap and technological prospects for the BSS systems from 5G to 6G.",
    "entities": {
      "0": {
        "entity name": "6G BSS",
        "Type": "6G-related technique",
        "Functions": "integrate with new business models, upgrade from \"network-centric\" to \"business and service centric\" and \"customer-centric\"",
        "Benefits": "improve the operational efficiency and benefits of customers",
        "Application and deployment scenarios": "digital, intelligent and green transformation of the economy and the society"
      }
    }
  },

"7": {
    "title": "Towards Environment-Aware 6G Communications via Channel Knowledge Map",
    "description": "This article proposes the concept of channel knowledge map (CKM) as an enabler towards environment-aware wireless communications. CKM is a site-specific database, tagged with the locations of the transmitters and/or receivers, that contains whatever channel-related information useful to enhance environmental-awareness and facilitate or even obviate sophisticated real-time channel state information (CSI) acquisition. Therefore, CKM is expected to play an important role for 6G networks targeting for super high capacity, extremely low latency, and ultra-massive connectivity, by offering potential solutions to practical challenges brought by the drastically increased channel dimensions and training overhead. In this article, the motivations of environmental-awareness enabled by CKM are firstly discussed, followed by the key techniques to build and utilize CKM. In particular, it is highlighted that CKM is especially appealing for four channel types: channels for yet-to-reach locations, channels for non-cooperative nodes, channels with large dimensions, and channels with severe hardware/processing limitations. Two case studies with extensive numerical results are presented to demonstrate the great potential of environment-aware communications enabled by CKM.",
    "entities": {
      "0": {
        "Entity name": "channel knowledge map (CKM)",
        "Type": "6G-related technique",
        "Functions": "enhance environmental-awareness; facilitate or even obviate sophisticated real-time channel state information (CSI) acquisition",
        "Benefits": "super high capacity, extremely low latency, ultra-massive connectivity; offering potential solutions to practical challenges brought by the drastically increased channel dimensions and training overhead",
        "Components and sub-systems": "site-specific database",
        "Key performance indicators": "capacity, latency, connectivity",
        "Application and deployment scenarios": "channels for yet-to-reach locations; channels for non-cooperative nodes; channels with large dimensions; channels with severe hardware/processing limitations",
        "Associated technologies": "channel state information (CSI) acquisition"
      }
    }
  },

"8": {
    "title": "Joint Semantic Communication and Target Sensing for 6G Communication System",
    "description": "This paper investigates the secure resource allocation for a downlink integrated sensing and communication system with multiple legal users and potential eavesdroppers. In the considered model, the base station (BS) simultaneously transmits sensing and communication signals through beamforming design, where the sensing signals can be viewed as artificial noise to enhance the security of communication signals. To further enhance the security in the semantic layer, the semantic information is extracted from the original information before transmission. The user side can only successfully recover the received information with the help of the knowledge base shared with the BS, which is stored in advance. Our aim is to maximize the sum semantic secrecy rate of all users while maintaining the minimum quality of service for each user and guaranteeing overall sensing performance. To solve this sum semantic secrecy rate maximization problem, an iterative algorithm is proposed using the alternating optimization method. The simulation results demonstrate the superiority of the proposed algorithm in terms of secure semantic communication and reliable detection.",
    "entities": {
      "0": {
        "Entity name": "semantic communication",
        "Type": "6G-related technique",
        "Functions": "extract semantic information from the original information before transmission",
        "Benefits": "enhance the security in the semantic layer",
        "Components and sub-systems": "knowledge base shared with the BS",
        "Associated algorithms": "alternating optimization method",
        "Application and deployment scenarios": "user side can only successfully recover the received information with the help of the knowledge base",
        "Associated technologies": "integrated sensing and communication system"
      },
      "1": {
        "Entity name": "integrated sensing and communication system",
        "Type": "6G-related technique",
        "Functions": "simultaneously transmits sensing and communication signals through beamforming design",
        "Benefits": "enhance the security of communication signals; guarantee overall sensing performance",
        "Components and sub-systems": "base station (BS)",
        "Key performance indicators": "sum semantic secrecy rate; quality of service",
        "Application and deployment scenarios": "downlink system with multiple legal users and potential eavesdroppers",
        "Associated technologies": "beamforming design; artificial noise"
      }
    }
  },

"9": {
    "title": "Toward Mixture-of-Experts Enabled Trustworthy Semantic Communication for 6G Networks",
    "description": "Semantic Communication (SemCom) plays a pivotal role in 6G networks, offering a viable solution for future efficient communication. Deep Learning (DL)-based semantic codecs further enhance this efficiency. However, the vulnerability of DL models to security threats, such as adversarial attacks, poses significant challenges for practical applications of SemCom systems. These vulnerabilities enable attackers to tamper with messages and eavesdrop on private information, especially in wireless communication scenarios. Although existing defenses attempt to address specific threats, they often fail to simultaneously handle multiple heterogeneous attacks. To overcome this limitation, we introduce a novel Mixture-of-Experts (MoE)-based SemCom system. This system comprises a gating network and multiple experts, each specializing in different security challenges. The gating network adaptively selects suitable experts to counter heterogeneous attacks based on user-defined security requirements. Multiple experts collaborate to accomplish semantic communication tasks while meeting the security requirements of users. A case study in vehicular networks demonstrates the efficacy of the MoE-based SemCom system. Simulation results show that the proposed MoE-based SemCom system effectively mitigates concurrent heterogeneous attacks, with minimal impact on downstream task accuracy.",
    "entities": {
      "0": {
        "Entity name": "Semantic Communication (SemCom)",
        "Type": "6G-related technique",
        "Functions": "offering a viable solution for future efficient communication",
        "Associated technologies": "Deep Learning (DL)-based semantic codecs, Mixture-of-Experts (MoE)-based SemCom system"
      },
      "1": {
        "Entity name": "Mixture-of-Experts (MoE)-based SemCom system",
        "Type": "6G-related technique",
        "Functions": "adaptively selects suitable experts to counter heterogeneous attacks based on user-defined security requirements; multiple experts collaborate to accomplish semantic communication tasks while meeting the security requirements of users",
        "Benefits": "effectively mitigates concurrent heterogeneous attacks, with minimal impact on downstream task accuracy",
        "Components and sub-systems": "gating network, multiple experts",
        "Key performance indicators": "downstream task accuracy",
        "Control mechanisms": "adaptively selects suitable experts to counter heterogeneous attacks based on user-defined security requirements",
        "Application and deployment scenarios": "vehicular networks",
        "Associated technologies": "Semantic Communication (SemCom), Deep Learning (DL)-based semantic codecs"
      }
    }
  },

  "10": {
    "title": "Blockchain-enabled Resource Management and Sharing for 6G Communications",
    "description": "The sixth generation (6G) network must provide performance superior to previous generations in order to meet the requirements of emerging services and applications, such as multi-gigabit transmission rate, even higher reliability, sub 1 millisecond latency and ubiquitous connection for Internet of Everything. However, with the scarcity of spectrum resources, efficient resource management and sharing is crucial to achieve all these ambitious requirements. One possible technology to enable all of this is blockchain, which has recently gained significance and will be of paramount importance to 6G networks and beyond due to its inherent properties. In particular, the integration of blockchain in 6G will enable the network to monitor and manage resource utilization and sharing efficiently. Hence, in this article, we discuss the potentials of blockchain for resource management and sharing in 6G using multiple application scenarios namely, Internet of things, device-to-device communications, network slicing, and inter-domain blockchain ecosystems.",
    "entities": {
      "0": {
        "entity name": "Blockchain",
        "Type": "6G-related technique",
        "Functions": "monitor and manage resource utilization and sharing efficiently",
        "Benefits": "efficient resource management and sharing, meet the requirements of emerging services and applications",
        "Application and deployment scenarios": "Internet of things, device-to-device communications, network slicing, inter-domain blockchain ecosystems"
      }
    }
  },


"11": {
    "title": "Artificial Intelligence-Enabled Intelligent 6G Networks",
    "description": "With the rapid development of smart terminals and infrastructures, as well as diversified applications (e.g., virtual and augmented reality, remote surgery and holographic projection) with colorful requirements, current networks (e.g., 4G and upcoming 5G networks) may not be able to completely meet quickly rising traffic demands. Accordingly, efforts from both industry and academia have already been put to the research on 6G networks. Recently, artificial intelligence (AI) has been utilized as a new paradigm for the design and optimization of 6G networks with a high level of intelligence. Therefore, this article proposes an AI-enabled intelligent architecture for 6G networks to realize knowledge discovery, smart resource management, automatic network adjustment and intelligent service provisioning, where the architecture is divided into four layers: intelligent sensing layer, data mining and analytics layer, intelligent control layer and smart application layer. We then review and discuss the applications of AI techniques for 6G networks and elaborate how to employ the AI techniques to efficiently and effectively optimize the network performance, including AI-empowered mobile edge computing, intelligent mobility and handover management, and smart spectrum management. Moreover, we highlight important future research directions and potential solutions for AI-enabled intelligent 6G networks, including computation efficiency, algorithms robustness, hardware development and energy management.",
    "entities": {
      "0": {
        "entity name": "AI-enabled intelligent architecture for 6G networks",
        "Type": "6G-related technique",
        "Functions": "knowledge discovery, smart resource management, automatic network adjustment, intelligent service provisioning",
        "Components and sub-systems": "intelligent sensing layer, data mining and analytics layer, intelligent control layer, smart application layer",
        "Application and deployment scenarios": "AI-empowered mobile edge computing, intelligent mobility and handover management, smart spectrum management",
        "Associated technologies": "artificial intelligence (AI)"
      }
    }
  },

"12": {
    "title": "Cloud Fog Architectures in 6G Networks",
    "description": "Prior to the advent of the cloud, storage and processing services were accommodated by specialized hardware, however, this approach introduced a number of challenges in terms of scalability, energy efficiency, and cost. Then came the concept of cloud computing, where to some extent, the issue of massive storage and computation was dealt with by centralized data centers that are accessed via the core network. The cloud has remained with us thus far, however, this has introduced further challenges among which, latency and energy efficiency are of the pinnacle. With the increase in embedded devices intelligence came the concept of the Fog. The availability of massive numbers of storage and computational devices at the edge of the network, where some are owned and deployed by the end-users themselves but most by service operators. This means that cloud services are pushed further out from the core towards the edge of the network, hence reduced latency is achieved. Fog nodes are massively distributed in the network, some benefit from wired connections, and others are connected via wireless links. The question of where to allocate services remains an important task and requires extensive attention. This chapter introduces and evaluates cloud fog architectures in 6G networks paying special attention to latency, energy efficiency, scalability, and the trade-offs between distributed and centralized processing resources.",
    "entities": {
      "0": {
        "Entity name": "Cloud Computing",
        "Type": "6G-related technique",
        "Functions": "massive storage and computation",
        "Components and sub-systems": "centralized data centers",
        "Key performance indicators": "latency, energy efficiency",
        "Control mechanisms": "centralized",
        "Application and deployment scenarios": "core network data centers",
        "Associated technologies": "Fog Computing"
      },
      "1": {
        "Entity name": "Fog Computing",
        "Type": "6G-related technique",
        "Functions": "pushing cloud services further out from the core towards the edge of the network",
        "Benefits": "reduced latency",
        "Components and sub-systems": "massively distributed fog nodes, wired connections, wireless links",
        "Key performance indicators": "latency, energy efficiency, scalability",
        "Control mechanisms": "distributed",
        "Application and deployment scenarios": "edge of the network",
        "Associated technologies": "Cloud Computing"
      }
    }
  },


"13": {
    "title": "Joint Source-Channel Coding System for 6G Communication: Design, Prototype and Future Directions",
    "description": "The goal of semantic communication is to surpass optimal Shannon's criterion regarding a notable problem for future communication which lies in the integration of collaborative efforts between the intelligence of the transmission source and the joint design of source coding and channel coding. The convergence of scholarly investigation and applicable products in the field of semantic communication is facilitated by the utilization of flexible structural hardware design, which is constrained by the computational capabilities of edge devices. This characteristic represents a significant benefit of joint source-channel coding (JSCC), as it enables the generation of source alphabets with diverse lengths and achieves a code rate of unity. Moreover, JSCC exhibits near-capacity performance while maintaining low complexity. Therefore, we leverage not only quasi-cyclic (QC) characteristics to propose a QC-LDPC code-based JSCC scheme but also Unequal Error Protection (UEP) to ensure the recovery of semantic importance. In this study, the feasibility for using a semantic encoder/decoder that is aware of UEP can be explored based on the existing JSCC system. This approach is aimed at protecting the significance of semantic task-oriented information. Additionally, the deployment of a JSCC system can be facilitated by employing Low-Density Parity-Check (LDPC) codes on a reconfigurable device. This is achieved by reconstructing the LDPC codes as QC-LDPC codes. The QC-LDPC layered decoding technique, which has been specifically optimized for hardware parallelism and tailored for channel decoding applications, can be suitably adapted to accommodate the JSCC system. The performance of the proposed system is evaluated by conducting BER measurements using both floating-point and 6-bit quantization.",
    "entities": {
      "0": {
        "Entity name": "Joint source-channel coding (JSCC)",
        "Type": "6G-related technique",
        "Functions": "enables the generation of source alphabets with diverse lengths and achieves a code rate of unity, exhibits near-capacity performance while maintaining low complexity",
        "Benefits": "near-capacity performance, low complexity",
        "Components and sub-systems": "QC-LDPC code-based JSCC scheme, Unequal Error Protection (UEP)",
        "Key performance indicators": "BER measurements",
        "Associated algorithms": "QC-LDPC layered decoding technique, Unequal Error Protection (UEP)",
        "Application and deployment scenarios": "deployment of a JSCC system can be facilitated by employing LDPC codes on a reconfigurable device",
        "Associated technologies": "LDPC codes, reconfigurable device, semantic encoder/decoder aware of UEP"
      },
      "1": {
        "Entity name": "QC-LDPC codes",
        "Type": "6G-related technique",
        "Functions": "reconstructing the LDPC codes as QC-LDPC codes",
        "Components and sub-systems": "LDPC codes",
        "Control mechanisms": "QC-LDPC layered decoding technique",
        "Associated algorithms": "QC-LDPC layered decoding technique",
        "Application and deployment scenarios": "tailored for channel decoding applications, adapted to accommodate the JSCC system"
      },
      "2": {
        "Entity name": "Unequal Error Protection (UEP)",
        "Type": "6G-related technique",
        "Functions": "ensure the recovery of semantic importance, protecting the significance of semantic task-oriented information",
        "Benefits": "protects the significance of semantic task-oriented information",
        "Associated technologies": "semantic encoder/decoder aware of UEP"
      }
    }
  },


"14": {
    "title": "Towards Energy- and Cost-Efficient 6G Networks",
    "description": "As the world enters the journey toward the 6th generation (6G) of wireless technology, the promises of ultra-high data rates, unprecedented low latency, and a massive surge in connected devices require crucial exploration of network energy saving (NES) solutions to minimize the carbon footprint and overall energy usage of future cellular networks. On the other hand, network-controlled repeaters (NCRs) have been introduced by 3rd generation partnership project (3GPP) as a cost-effective solution to improve network coverage. However, their impact on network power consumption and energy efficiency has not been thoroughly investigated. This paper studies NES schemes for next-generation 6G networks aided by NCRs and proposes optimal NES strategies aiming at maximizing the overall energy efficiency of the network. Repeaters are shown to allow for power savings at next-generation nodeB (gNB), and offer higher overall energy efficiency (EE) and spectral efficiency (SE), thus providing an energy-efficient and cost-efficient alternative to increase the performance of future 6G networks",
    "entities": {
      "0": {
        "Entity name": "network energy saving (NES)",
        "Type": "6G-related technique",
        "Functions": "minimize the carbon footprint and overall energy usage of future cellular networks",
        "Benefits": "energy- and cost-efficiency",
        "Key performance indicators": "energy efficiency (EE), spectral efficiency (SE)",
        "Associated technologies": "network-controlled repeaters (NCRs)"
      },
      "1": {
        "Entity name": "network-controlled repeaters (NCRs)",
        "Type": "6G-related technique",
        "Functions": "improve network coverage",
        "Benefits": "cost-effective solution, power savings at next-generation nodeB (gNB), higher overall energy efficiency (EE) and spectral efficiency (SE)",
        "Components and sub-systems": "next-generation nodeB (gNB)",
        "Key performance indicators": "energy efficiency (EE), spectral efficiency (SE)",
        "Associated technologies": "network energy saving (NES)"
      }
    }
  },






  "15": {
    "title": "CAVIAR: Co-simulation of 6G Communications, 3D Scenarios and AI for Digital Twins",
    "description": "Digital twins are an important technology for advancing mobile communications, specially in use cases that require simultaneously simulating the wireless channel, 3D scenes and machine learning. Aiming at providing a solution to this demand, this work describes a modular co-simulation methodology called CAVIAR. Here, CAVIAR is upgraded to support a message passing library and enable the virtual counterpart of a digital twin system using different 6G-related simulators. The main contributions of this work are the detailed description of different CAVIAR architectures, the implementation of this methodology to assess a 6G use case of UAV-based search and rescue mission (SAR), and the generation of benchmarking data about the computational resource usage. For executing the SAR co-simulation we adopt five open-source solutions: the physical and link level network simulator Sionna, the simulator for autonomous vehicles AirSim, scikit-learn for training a decision tree for MIMO beam selection, Yolov8 for the detection of rescue targets and NATS for message passing. Results for the implemented SAR use case suggest that the methodology can run in a single machine, with the main demanded resources being the CPU processing and the GPU memory.",
    "entities": {
      "0": {
        "entity name": "CAVIAR co-simulation methodology",
        "Type": "6G-related technique",
        "Functions": "simulating the wireless channel, 3D scenes, machine learning",
        "Components and sub-systems": "message passing library, digital twin system",
        "Application and deployment scenarios": "UAV-based search and rescue mission (SAR)",
        "Associated technologies": "Sionna, AirSim, scikit-learn, Yolov8, NATS"
      }
    }
  },


  "16": {
    "title": "Goal-Oriented Semantic Communications for 6G Networks",
    "description": "Upon the arrival of emerging devices, including Extended Reality (XR) and Unmanned Aerial Vehicles (UAVs), the traditional communication framework is approaching Shannon's physical capacity limit and fails to guarantee the massive amount of transmission within latency requirements. By jointly exploiting the context of data and its importance to the task, an emerging communication paradigm shift to semantic level and effectiveness level is envisioned to be a key revolution in Sixth Generation (6G) networks. However, an explicit and systematic communication framework incorporating both semantic level and effectiveness level has not been proposed yet. In this article, we propose a generic goal-oriented semantic communication framework for various tasks with diverse data types, which incorporates both semantic level information and effectiveness-aware performance metrics. We first analyze the unique characteristics of all data types, and summarise the semantic information, along with corresponding extraction methods. We then propose a detailed goal-oriented semantic communication framework for different time-critical and non-critical tasks. In the goal-oriented semantic communication framework, we present the goal-oriented semantic information, extraction methods, recovery methods, and effectiveness-aware performance metrics. Last but not least, we present a goal-oriented semantic communication framework tailored for Unmanned Aerial Vehicle (UAV) control task to validate the effectiveness of the proposed goal-oriented semantic communication framework.",
    "entities": {
      "0": {
        "entity name": "goal-oriented semantic communication framework",
        "Type": "6G-related technique",
        "Functions": "incorporates semantic level information, effectiveness-aware performance metrics",
        "Components and sub-systems": "extraction methods, recovery methods",
        "Application and deployment scenarios": "Unmanned Aerial Vehicle (UAV) control task"
      }
    }
  },



  "17": {
    "title": "6G Communications: A Vision on the Potential Applications",
    "description": "6G communication technology is a revolutionary technology that will revolutionize many technologies and applications. Furthermore, it will be truly AI-driven and will carry on intelligent space. Hence, it will enable Internet of Everything (IoE) which will also impact many technologies and applications. 6G communication technology promises high Quality of Services (QoS) and high Quality of Experiences (QoE). With the combination of IoE and 6G communication technology, number of applications will be exploded in the coming future, particularly, vehicles, drones, homes, cities, hospitals, and so on, and there will be no untouched area. Thence, it is expected that many existing technologies will fully depend on 6G communication technology and enhance their performances. 6G communication technology will prove as game changer communication technology in many fields and will be capable to influence many applications. Therefore, we envision the potential applications of 6G communication technology in the near future.",
    "entities": {
      "0": {
        "entity name": "6G communication technology",
        "Type": "6G-related technique",
        "Functions": "enable Internet of Everything (IoE), high Quality of Services (QoS), high Quality of Experiences (QoE)",
        "Application and deployment scenarios": "vehicles, drones, homes, cities, hospitals"
      },
     "1": {
        "Entity name": "Internet of Everything (IoE)",
        "Type": "6G-related technique",
        "Benefits": "high Quality of Services (QoS) and high Quality of Experiences (QoE)",
        "Application and deployment scenarios": "vehicles, drones, homes, cities, hospitals",
        "Associated technologies": "AI-driven systems"
      }
    }
  },

  "18": {
    "title": "AI-Native Network Slicing for 6G Networks",
    "description": "With the global roll-out of the fifth generation (5G) networks, it is necessary to look beyond 5G and envision the 6G networks. The 6G networks are expected to have space-air-ground integrated networks, advanced network virtualization, and ubiquitous intelligence. This article presents an artificial intelligence (AI)-native network slicing architecture for 6G networks to enable the synergy of AI and network slicing, thereby facilitating intelligent network management and supporting emerging AI services. AI-based solutions are first discussed across network slicing lifecycle to intelligently manage network slices, i.e., AI for slicing. Then, network slicing solutions are studied to support emerging AI services by constructing AI instances and performing efficient resource management, i.e., slicing for AI. Finally, a case study is presented, followed by a discussion of open research issues that are essential for AI-native network slicing in 6G networks.",
    "entities": {
      "0": {
        "Entity name": "AI-native network slicing",
        "Type": "6G-related technique",
        "Functions": "synergy of AI and network slicing for intelligent network management and supporting AI services",
        "Components and sub-systems": "network slices",
        "Application and deployment scenarios": "emerging AI services",
        "Associated technologies": "AI, network slicing"
      }
    }
  },



  "19": {
    "title": "The Shift to 6G Communications: Vision and Requirements",
    "description": "The sixth-generation (6G) wireless communication network is expected to integrate the terrestrial, aerial, and maritime communications into a robust network which would be more reliable, fast, and can support a massive number of devices with ultra-low latency requirements. The researchers around the globe are proposing cutting edge technologies such as artificial intelligence (AI)/machine learning (ML), quantum communication/quantum machine learning (QML), blockchain, tera-Hertz and millimeter waves communication, tactile Internet, non-orthogonal multiple access (NOMA), small cells communication, fog/edge computing, etc., as the key technologies in the realization of beyond 5G (B5G) and 6G communications. In this article, we provide a detailed overview of the 6G network dimensions with air interface and associated potential technologies. More specifically, we highlight the use cases and applications of the proposed 6G networks in various dimensions. Furthermore, we also discuss the key performance indicators (KPI) for the B5G/6G network, challenges, and future research opportunities in this domain.",
    "entities": {
      "0": {
        "entity name": "6G wireless communication network",
        "Type": "6G-related technique",
        "Functions": "integrate terrestrial, aerial, and maritime communications",
        "Benefits": "more reliable, fast, and can support a massive number of devices with ultra-low latency requirements",
        "Associated technologies": "artificial intelligence (AI)/machine learning (ML), quantum communication/quantum machine learning (QML), blockchain, tera-Hertz and millimeter waves communication, tactile Internet, non-orthogonal multiple access (NOMA), small cells communication, fog/edge computing",
        "Key performance indicators": "ultra-low latency"
      }
    }
  },

  "20": {
    "title": "Meta-material Sensors based Internet of Things for 6G Communications",
    "description": "In the coming 6G communications, the internet of things (IoT) serves as a key enabler to collect environmental information and is expected to achieve ubiquitous deployment. However, it is challenging for traditional IoT sensors to meet this expectation because of their requirements of power supplies and frequent maintenance, which are due to their power-demanding sense and transmit modules. To address this challenge, we propose a meta-IoT sensing system, where the IoT sensors are based on specially designed meta-materials. The meta-IoT sensors achieve simultaneous sensing and transmission by physical reflection and require no power supplies. In order to design a meta-IoT sensing system with optimal sensing accuracy, we jointly consider the sensing and transmission of meta-IoT sensors and propose efficient algorithms to optimize the meta-IoT structure and the sensing function at the receiver. As an example, we apply the meta-IoT system to sensing environmental temperature and humidity levels. Simulation results show that by using the proposed algorithm, the sensing accuracy can be largely increased.",
    "entities": {
      "0": {
        "entity name": "meta-IoT sensing system",
        "Type": "6G-related technique",
        "Functions": "simultaneous sensing and transmission by physical reflection",
        "Benefits": "require no power supplies, increased sensing accuracy",
        "Components and sub-systems": "meta-materials",
        "Associated algorithms": "efficient algorithms to optimize the meta-IoT structure and the sensing function",
        "Application and deployment scenarios": "sensing environmental temperature and humidity levels",
"Associated technologies": "meta-materials"
      }
    }
  },


  "21": {
    "title": "TEDGE-Caching: Transformer-based Edge Caching Towards 6G Networks",
    "description": "As a consequence of the COVID-19 pandemic, the demand for telecommunication for remote learning/working and telemedicine has significantly increased. Mobile Edge Caching (MEC) in the 6G networks has been evolved as an efficient solution to meet the phenomenal growth of the global mobile data traffic by bringing multimedia content closer to the users. Although massive connectivity enabled by MEC networks will significantly increase the quality of communications, there are several key challenges ahead. The limited storage of edge nodes, the large size of multimedia content, and the time-variant users' preferences make it critical to efficiently and dynamically predict the popularity of content to store the most upcoming requested ones before being requested. Recent advancements in Deep Neural Networks (DNNs) have drawn much research attention to predict the content popularity in proactive caching schemes. Existing DNN models in this context, however, suffer from longterm dependencies, computational complexity, and unsuitability for parallel computing. To tackle these challenges, we propose an edge caching framework incorporated with the attention-based Vision Transformer (ViT) neural network, referred to as the Transformer-based Edge (TEDGE) caching, which to the best of our knowledge, is being studied for the first time. Moreover, the TEDGE caching framework requires no data pre-processing and additional contextual information. Simulation results corroborate the effectiveness of the proposed TEDGE caching framework in comparison to its counterparts.",
    "entities": {
      "0": {
        "Entity name": "Mobile Edge Caching (MEC)",
        "Type": "6G-related technique",
        "Functions": "bringing multimedia content closer to the users",
        "Benefits": "meet the phenomenal growth of the global mobile data traffic",
        "Components and sub-systems": "edge nodes",
        "Associated algorithms": "attention-based Vision Transformer (ViT) neural network",
        "Application and deployment scenarios": "proactive caching schemes"
      },
      "1": {
        "Entity name": "TEDGE caching framework",
        "Type": "6G-related technique",
        "Functions": "predict the popularity of content to store the most upcoming requested ones",
        "Benefits": "requires no data pre-processing and additional contextual information",
        "Associated algorithms": "Vision Transformer (ViT)",
        "Application and deployment scenarios": "edge caching"
      }
}
},


  "22": {
    "title": "6G Communication Technology: A Vision on Intelligent Healthcare",
    "description": "6G is a promising communication technology that will dominate the entire health market from 2030 onward. It will dominate not only health sector but also diverse sectors. It is expected that 6G will revolutionize many sectors including healthcare. Healthcare will be fully AI-driven and dependent on 6G communication technology, which will change our perception of lifestyle. Currently, time and space are the key barriers to health care and 6G will be able to overcome these barriers. Also, 6G will be proven as a game changing technology for healthcare. Therefore, in this perspective, we envision healthcare system for the era of 6G communication technology. Also, various new methodologies have to be introduced to enhance our lifestyle, which is addressed in this perspective, including Quality of Life (QoL), Intelligent Wearable Devices (IWD), Intelligent Internet of Medical Things (IIoMT), Hospital-to-Home (H2H) services, and new business model. In addition, we expose the role of 6G communication technology in telesurgery, Epidemic and Pandemic.",
    "entities": {
      "0": {
        "entity name": "6G communication technology",
        "Type": "6G-related technique",
        "Functions": "revolutionize healthcare, overcome time and space barriers",
        "Benefits": "game changing technology for healthcare, fully AI-driven healthcare",
        "Application and deployment scenarios": "telesurgery, Epidemic and Pandemic, Intelligent Wearable Devices (IWD), Intelligent Internet of Medical Things (IIoMT), Hospital-to-Home (H2H) services"
      }
    }
  },

  "23": {
    "title": "Joint secure communication and sensing in 6G networks",
    "description": "Joint communication and sensing is expected to be one of the features introduced by the sixth-generation (6G) wireless systems. This will enable a huge variety of new applications, hence, it is important to find suitable approaches to secure the exchanged information. Conventional security mechanisms may not be able to meet the stringent delay, power, and complexity requirements which opens the challenge of finding new lightweight security solutions. A promising approach coming from the physical layer is the secret key generation (SKG) from channel fading. While SKG has been investigated for several decades, practical implementations of its full protocol are still scarce. The aim of this chapter is to evaluate the SKG rates in real-life setups under a set of different scenarios. We consider a typical radar waveform and present a full implementation of the SKG protocol. Each step is evaluated to demonstrate that generating keys from the physical layer can be a viable solution for future networks. However, we show that there is not a single solution that can be generalized for all cases, instead, parameters should be chosen according to the context.",
    "entities": {
      "0": {
        "entity name": "Joint communication and sensing",
        "Type": "6G-related technique",
        "Functions": "secure the exchanged information, enable new applications",
        "Benefits": "lightweight security solutions, viable solution for future networks",
        "Control mechanisms": "secret key generation (SKG) from channel fading",
        "Application and deployment scenarios": "real-life setups under a set of different scenarios"
      }
    }
  },

  "24": {
    "title": "Multi-Tier Computing-Enabled Digital Twin in 6G Networks",
    "description": "Digital twin (DT) is the recurrent and common feature in discussions about future technologies, bringing together advanced communication, computation, and artificial intelligence, to name a few. In the context of Industry 4.0, industries such as manufacturing, automotive, and healthcare are rapidly adopting DT-based development. The main challenges to date have been the high demands on communication and computing resources, as well as privacy and security concerns, arising from the large volumes of data exchanges. To achieve low latency and high security services in the emerging DT, multi-tier computing has been proposed by combining edge/fog computing and cloud computing. Specifically, low latency data transmission, efficient resource allocation, and validated security strategies of multi-tier computing systems are used to solve the operational problems of the DT system. In this paper, we introduce the architecture and applications of DT using examples from manufacturing, the Internet-of-Vehicles and healthcare. At the same time, the architecture and technology of multi-tier computing systems are studied to support DT. This paper will provide valuable reference and guidance for the theory, algorithms, and applications in collaborative multi-tier computing and DT.",
    "entities": {
      "0": {
        "entity name": "Digital twin (DT)",
        "Type": "6G-related technique",
        "Functions": "bring together advanced communication, computation, and artificial intelligence",
        "Benefits": "low latency and high security services",
        "Components and sub-systems": "multi-tier computing systems combining edge/fog computing and cloud computing",
        "Application and deployment scenarios": "manufacturing, Internet-of-Vehicles, healthcare"
      },
"1": {
        "Entity name": "multi-tier computing",
        "Type": "6G-related technique",
        "Functions": "combining edge/fog computing and cloud computing",
        "Benefits": "low latency and high security services",
        "Components and sub-systems": "edge/fog computing, cloud computing",
        "Application and deployment scenarios": "Digital twin"
}
    }
  },

  "25": {
    "title": "Large Language Model Enhanced Multi-Agent Systems for 6G Communications",
    "description": "The rapid development of the Large Language Model (LLM) presents huge opportunities for 6G communications, e.g., network optimization and management by allowing users to input task requirements to LLMs by nature language. However, directly applying native LLMs in 6G encounters various challenges, such as a lack of private communication data and knowledge, limited logical reasoning, evaluation, and refinement abilities. Integrating LLMs with the capabilities of retrieval, planning, memory, evaluation and reflection in agents can greatly enhance the potential of LLMs for 6G communications. To this end, we propose a multi-agent system with customized communication knowledge and tools for solving communication related tasks using natural language, comprising three components: (1) Multi-agent Data Retrieval (MDR), which employs the condensate and inference agents to refine and summarize communication knowledge from the knowledge base, expanding the knowledge boundaries of LLMs in 6G communications; (2) Multi-agent Collaborative Planning (MCP), which utilizes multiple planning agents to generate feasible solutions for the communication related task from different perspectives based on the retrieved knowledge; (3) Multi-agent Evaluation and Reflecxion (MER), which utilizes the evaluation agent to assess the solutions, and applies the reflexion agent and refinement agent to provide improvement suggestions for current solutions. Finally, we validate the effectiveness of the proposed multi-agent system by designing a semantic communication system, as a case study of 6G communications.",
    "entities": {
      "0": {
        "entity name": "Large Language Model (LLM) enhanced multi-agent systems",
        "Type": "6G-related technique",
        "Functions": "network optimization and management, solving communication related tasks using natural language",
        "Benefits": "expanding the knowledge boundaries of LLMs in 6G communications",
        "Components and sub-systems": "Multi-agent Data Retrieval (MDR), Multi-agent Collaborative Planning (MCP), Multi-agent Evaluation and Reflecxion (MER)",
        "Application and deployment scenarios": "semantic communication system",
        "Associated algorithms": "retrieval, planning, evaluation and reflection",
"Associated technologies": "Large Language Model"
      }
    }
  },


  "26": {
    "title": "Transmissive RIS for 6G Communications: Design, Prototyping, and Experimental Demonstrations",
    "description": "Reconfigurable intelligent surface (RIS) has been widely considered as a key technique to improve spectral efficiency for 6G communications. Compared with most existing research that only focuses on the reflective RIS, the design and prototyping of a novel transmissive RIS are presented in this paper, and its enhancement to the RIS-aided communication system is experimentally demonstrated. The 2-bit transmissive RIS element utilizes the penetration structure, which combines a 1-bit current reversible dipole and a 90{\\deg} digital phase shifter based on a quadrature hybrid coupler. A transmissive RIS prototype with 16$\\times$16 elements is designed, fabricated, and measured to verify the proposed design. The measured phase shift and insertion loss of the RIS element validate the 2-bit phase modulation capability. Being illuminated by a horn feed, the prototype achieves a maximum broadside gain of 22.0 dBi at 27 GHz, and the two-dimensional beamforming capability with scan angles up to $\\pm$60{\\deg} is validated. The experimental results of the RIS-aided communication system verify that by introducing the extra gain and beam steering capability, the transmissive RIS is able to achieve a higher data rate, reduce the transmit power, improve the transmission capability through obstacles, and dynamically adapt to the signal propagation direction.",
    "entities": {
      "0": {
        "entity name": "Transmissive RIS",
        "Type": "6G-related technique",
        "Functions": "improve spectral efficiency, enhance RIS-aided communication system",
        "Benefits": "achieve a higher data rate, reduce the transmit power, improve the transmission capability through obstacles, dynamically adapt to the signal propagation direction",
        "Components and sub-systems": "2-bit transmissive RIS element, 1-bit current reversible dipole, 90{\\deg} digital phase shifter based on a quadrature hybrid coupler",
        "Operating frequency": "27 GHz",
        "Application and deployment scenarios": "RIS-aided communication system"
      }
    }
  },


  "27": {
    "title": "GLDPC-PC Codes: Channel Coding Towards 6G Communications",
    "description": "The sixth generation (6G) wireless communication system will improve the key technical indicators by one to two orders of magnitude, and come with some new features. As a crucial technique to enhance the reliability and efficiency of data transmission, the next generation channel coding is not only required to satisfy the stringent requirements of 6G, but also expected to be backward compatible to avoid imposing additional burden on the crowded baseband chip. This article provides an overview of the potential channel codes for 6G communications. In addition, we explore to develop next-generation channel codes based on low-density parity-check (LDPC) and polar frameworks, introducing a novel concept called generalized LDPC with polar-like component (GLDPC-PC) codes. The codes have exhibited promising error correction performance and manageable complexity, which can be further optimized by specific code design. The opportunities and challenges of GLDPC-PC codes are also discussed, considering the practical applications to 6G communication systems.",
    "entities": {
      "0": {
        "entity name": "GLDPC-PC codes",
        "Type": "6G-related technique",
        "Functions": "enhance the reliability and efficiency of data transmission",
        "Benefits": "promising error correction performance and manageable complexity",
        "Associated technologies": "low-density parity-check (LDPC) and polar frameworks",
        "Application and deployment scenarios": "6G communication systems"
      }
    }
  },


  "28": {
    "title": "FPGA Implementation of OTFS Modulation for 6G Communication Systems",
    "description": "Sixth-generation (6G) communication systems are poised to accommodate high data-rate wireless communication services in highly dynamic channels, with applications including high-speed trains, unmanned aerial vehicles, and intelligent transportation systems. Orthogonal frequency-division multiplexing (OFDM) modulation suffers from performance degradation in such high-mobility applications due to high Doppler spread in the channel. The recently proposed Orthogonal Time Frequency Space (OTFS) modulation scheme outperforms OFDM in terms of supporting a higher transmitter (Tx) and receiver (Rx) user velocity. Additionally, the highly-dynamic time-frequency (TF) channel has little effect on OTFS modulated signals, which enables the realization of low-complexity pre-processing architectures for implementing massive-multiple input multiple outputs (MIMO) based OTFS systems. However, while OTFS has received attention in the literature from a theory and simulation perspective, there has been comparatively little work on real-time FPGA implementation of OTFS waveforms. Thus, in this paper, we first present a mathematical overview of OTFS modulation and then describe an FPGA implementation of OTFS implementation on hardware. Power, area, and timing analysis of the implemented design on a Zynq UltraScale+ RFSoC FPGA are provided for benchmarking purposes.",
    "entities": {
      "0": {
        "entity name": "Orthogonal Time Frequency Space (OTFS) modulation",
        "Type": "6G-related technique",
        "Functions": "supporting a higher transmitter (Tx) and receiver (Rx) user velocity, enabling low-complexity pre-processing architectures for massive-MIMO systems",
        "Benefits": "outperforms OFDM in high-mobility applications, resilient to highly-dynamic time-frequency (TF) channels",
        "Components and sub-systems": "FPGA implementation, Zynq UltraScale+ RFSoC FPGA",
        "Key performance indicators": "power, area, and timing analysis",
        "Application and deployment scenarios": "high-speed trains, unmanned aerial vehicles, intelligent transportation systems"
      }
    }
  },

  "29": {
    "title": "6G Networks: Beyond Shannon Towards Semantic and Goal-Oriented Communications",
    "description": "The goal of this paper is to promote the idea that including semantic and goal-oriented aspects in future 6G networks can produce a significant leap forward in terms of system effectiveness and sustainability. Semantic communication goes beyond the common Shannon paradigm of guaranteeing the correct reception of each single transmitted packet, irrespective of the meaning conveyed by the packet. The idea is that, whenever communication occurs to convey meaning or to accomplish a goal, what really matters is the impact that the correct reception/interpretation of a packet is going to have on the goal accomplishment. Focusing on semantic and goal-oriented aspects, and possibly combining them, helps to identify the relevant information, i.e. the information strictly necessary to recover the meaning intended by the transmitter or to accomplish a goal. Combining knowledge representation and reasoning tools with machine learning algorithms paves the way to build semantic learning strategies enabling current machine learning algorithms to achieve better interpretation capabilities and contrast adversarial attacks. 6G semantic networks can bring semantic learning mechanisms at the edge of the network and, at the same time, semantic learning can help 6G networks to improve their efficiency and sustainability.",
    "entities": {
      "0": {
        "entity name": "semantic and goal-oriented communication",
        "Type": "6G-related technique",
        "Functions": "identifying relevant information, recovering the meaning intended by the transmitter, accomplishing a goal",
        "Benefits": "improving system effectiveness and sustainability, enhancing interpretation capabilities, contrasting adversarial attacks",
        "Associated algorithms": "machine learning algorithms, knowledge representation and reasoning tools",
        "Application and deployment scenarios": "6G semantic networks, edge of the network"
      }
    }
  },


  "30": {
    "title": "Intelligent Reflecting Surfaces Positioning in 6G Networks",
    "description": "The work analyzed the positioning of IRS over the coverage region of micro cell to derive optimal placement location to support cell-edge Internet of Things (IoT) devices with a favorable signal-to-interference plus noise ratio (SINR). Moreover, the work derived that the implementation of IRS significantly enhances energy efficiency notably reducing the transmit power of the micro cell base station.",
    "entities": {
      "0": {
        "entity name": "Intelligent Reflecting Surfaces (IRS)",
        "Type": "6G-related technique",
        "Functions": "supporting cell-edge Internet of Things (IoT) devices, enhancing energy efficiency",
        "Benefits": "reducing the transmit power of the micro cell base station, improving signal-to-interference plus noise ratio (SINR)",
        "Application and deployment scenarios": "micro cell coverage region, cell-edge IoT devices"
      }
    }
  },

  "31": {
    "title": "Communication-Assisted Sensing in 6G Networks",
    "description": "Exploring the mutual benefit and reciprocity of sensing and communication (S\\&C) functions is fundamental to realizing deeper integration for integrated sensing and communication (ISAC) systems. This paper investigates a novel communication-assisted sensing (CAS) system within 6G perceptive networks, where the base station actively senses the targets through device-free wireless sensing and simultaneously transmits the estimated information to end-users. In such a CAS system, we first establish an optimal waveform design framework based on the rate-distortion (RD) and source-channel separation (SCT) theorems. After analyzing the relationships between the sensing distortion, coding rate, and communication channel capacity, we propose two distinct waveform design strategies in the scenario of target impulse response estimation. In the separated S\\&C waveforms scheme, we equivalently transform the original problem into a power allocation problem and develop a low-complexity one-dimensional search algorithm, shedding light on a notable power allocation tradeoff between the S\\&C waveform. In the dual-functional waveform scheme, we conceive a heuristic mutual information optimization algorithm for the general case, alongside a modified gradient projection algorithm tailored for the scenarios with independent sensing sub-channels. Additionally, we identify the presence of both subspace tradeoff and water-filling tradeoff in this scheme. Finally, we validate the effectiveness of the proposed algorithms through numerical simulations.",
    "entities": {
    "0": {
      "Entity name": "communication-assisted sensing (CAS)",
      "Type": "6G-related technique",
      "Functions": "integrate sensing and communication functions, optimal waveform design",
      "Benefits": "optimal waveform design, mutual benefit and reciprocity of S&C functions",
      "Components and sub-systems": "separated S&C waveforms scheme, dual-functional waveform scheme",
      "Associated algorithms": "low-complexity one-dimensional search algorithm, heuristic mutual information optimization algorithm, modified gradient projection algorithm",
      "Key performance indicators": "sensing distortion, coding rate, communication channel capacity",
      "Application and deployment scenarios": "target impulse response estimation scenarios"
    }
  }
},


  "32": {
    "title": "Towards Neural Architecture Search for Transfer Learning in 6G Networks",
    "description": "The future 6G network is envisioned to be AI-native, and as such, ML models will be pervasive in support of optimizing performance, reducing energy consumption, and in coping with increasing complexity and heterogeneity. A key challenge is automating the process of finding optimal model architectures satisfying stringent requirements stemming from varying tasks, dynamicity and available resources in the infrastructure and deployment positions. In this paper, we describe and review the state-of-the-art in Neural Architecture Search and Transfer Learning and their applicability in networking. Further, we identify open research challenges and set directions with a specific focus on three main requirements with elements unique to the future network, namely combining NAS and TL, multi-objective search, and tabular data. Finally, we outline and discuss both near-term and long-term work ahead.",
    "entities": {
      "0": {
        "Entity name": "Neural Architecture Search (NAS)",
        "Type": "6G-related technique",
        "Functions": "automate finding optimal model architectures",
        "Benefits": "address dynamicity and resource constraints",
        "Components and sub-systems": "combination of NAS and Transfer Learning",
        "Associated technologies": "Transfer Learning (TL), multi-objective search, and tabular data"
      }
}
},


  "33": {
    "title": "A Survey on Technological Trends to Enhance Spectrum Efficiency in 6G Communications",
    "description": "The research community has already identified that, by 2030, 5G networks will reach the capacity limits, and hence, will be inadequate to support next generation bandwidth-hungry, ubiquitous, intelligent services, and applications. Therefore, in view of sustaining the competitive edge of wireless technology and stratifying the next decade's communication requirements both, industry and research community have already begun conceptualizing the 6G technology. This article presents a detailed survey on the recent technological trends which address the capacity issues and enhance the spectrum-efficiency in 6G Communications. We present these trends in detail and then identify the challenges that need solutions before the practical deployment to realize 6G communications. Our survey article attempts to significantly contribute to initiating future research directions in the area of spectrum-efficiency in 6G communications.",
    "entities": {
      "0": {
        "entity name": "spectrum-efficiency enhancement",
        "Type": "6G-related technique",
        "Functions": "addressing capacity issues, enhancing spectrum-efficiency",
        "Benefits": "sustaining the competitive edge of wireless technology, supporting next generation bandwidth-hungry, ubiquitous, intelligent services and applications",
        "Application and deployment scenarios": "6G communications"
      }
    }
  },


  "34": {
    "title": "6G Communication New Paradigm: The Integration of Unmanned Aerial Vehicles and Intelligent Reflecting Surfaces",
    "description": "With the continuous development of Intelligent Reflecting Surfaces (IRSs) and Unmanned Aerial Vehicles (UAVs), their combination has become foundational technologies to complement the terrestrial network by providing communication enhancement services for large-scale users. This article provides a comprehensive overview of IRS-assisted UAV communications for 6th-Generation (6G) networks. First, the applications supported by IRS-assisted UAV communications for 6G networks are introduced, and key issues originated from applications supported by IRSs and UAVs for 6G networks are summarized and analyzed. Then, prototypes and main technologies related to the integration of IRSs and UAVs are introduced. Driven by applications and technologies of IRS-assisted UAV communications, existing solutions in the realms of energy-constrained communications, secure communications, and enhanced communications are summarized, and corresponding empirical lessons are provided. Finally, we discuss some research challenges and open issues in IRS-assisted UAV communications, offering directions for the future development.",
     "entities": {
    "0": {
      "Entity name": "Intelligent Reflecting Surfaces (IRSs)",
      "Type": "6G-related technique",
      "Functions": "provide communication enhancement services",
      "Benefits": "complement the terrestrial network",
      "Components and sub-systems": "prototypes",
      "Associated technologies": "Unmanned Aerial Vehicles (UAVs)"
    },
    "1": {
      "Entity name": "Unmanned Aerial Vehicles (UAVs)",
      "Type": "6G-related technique",
      "Functions": "provide communication enhancement services",
      "Benefits": "broad coverage and service continuity",
      "Components and sub-systems": "prototypes"
    }
  }
},


  "35": {
    "title": "Disaggregation for Energy Efficient Fog in Future 6G Networks",
    "description": "We study the benefits of adopting server disaggregation in the fog computing tier by evaluating energy efficient placement of interactive apps in a future fog 6G network. Using a mixed integer linear programming (MILP) model, we compare the adoption of traditional server (TS) and disaggregated server (DS) architectures in a fog network comprising of selected fog computing sites in the metro and access networks. Relative to the use of TSs, our results show that the adoption of DS improves the energy efficiency of the fog network and enables up to 18% reduction in total fog computing power consumption. More instances of interactive fog apps are provisioned in a fog network that is implemented over a network topology with high delay penalty. This ensures that minimal delay is experienced by distributed users. Our result also shows that the proximity of fog computing sites such as metro-central offices and radio cell sites to geo-distributed users of interactive fog applications make them important edge locations for provisioning moderately delay sensitive fog apps. However, fog applications with more stringent delay thresholds require in situ processing at directly connected radio cell sites or at the location of the requesting users. Finally, we propose a heuristic for energy efficient and delay aware placement of interactive fog apps in a fog network which replicates the trends observed during comprehensive analysis of the exact results obtained by solving the MILP model formulated in this paper. Our results and proposed MILP and heuristic provide a good reference and tool for fog network design and deployment.",
    "entities": {
      "0": {
        "entity name": "server disaggregation in fog computing",
        "Type": "6G-related technique",
        "Functions": "energy efficient placement of interactive apps, reducing total fog computing power consumption",
        "Benefits": "improves energy efficiency, enables up to 18% reduction in power consumption",
        "Components and sub-systems": "traditional server (TS), disaggregated server (DS)",
        "Application and deployment scenarios": "fog 6G network, metro and access networks"
      }
    }
  },



  "36": {
    "title": "SliceOps: Explainable MLOps for Streamlined Automation-Native 6G Networks",
    "description": "Sixth-generation (6G) network slicing is the backbone of future communications systems. It inaugurates the era of extreme ultra-reliable and low-latency communication (xURLLC) and pervades the digitalization of the various vertical immersive use cases. Since 6G inherently underpins artificial intelligence (AI), we propose a systematic and standalone slice termed SliceOps that is natively embedded in the 6G architecture, which gathers and manages the whole AI lifecycle through monitoring, re-training, and deploying the machine learning (ML) models as a service for the 6G slices. By leveraging machine learning operations (MLOps) in conjunction with eXplainable AI (XAI), SliceOps strives to cope with the opaqueness of black-box AI using explanation-guided reinforcement learning (XRL) to fulfill transparency, trustworthiness, and interpretability in the network slicing ecosystem. This article starts by elaborating on the architectural and algorithmic aspects of SliceOps. Then, the deployed cloud-native SliceOps working is exemplified via a latency-aware resource allocation problem. The deep RL (DRL)-based SliceOps agents within slices provide AI services aiming to allocate optimal radio resources and impede service quality degradation. Simulation results demonstrate the effectiveness of SliceOps-driven slicing. The article discusses afterward the SliceOps challenges and limitations. Finally, the key open research directions corresponding to the proposed approach are identified.",
    "entities": {
    "0": {
      "Entity name": "SliceOps",
      "Type": "6G-related technique",
      "Functions": "manage the whole AI lifecycle through monitoring, re-training, deploying ML models",
      "Benefits": "achieve transparency and trustworthiness in network slicing",
      "Components and sub-systems": "explanation-guided reinforcement learning (XRL)",
      "Associated algorithms": "deep RL (DRL)",
      "Associated technologies": "xURLLC, MLOps, eXplainable AI (XAI)"
    }
  }
  },


  "37": {
    "title": "Integrated Communication, Sensing, and Computation Framework for 6G Networks",
    "description": "In the sixth generation (6G) era, intelligent machine network (IMN) applications, such as intelligent transportation, require collaborative machines with communication, sensing, and computation (CSC) capabilities. This article proposes an integrated communication, sensing, and computation (ICSAC) framework for 6G to achieve the reciprocity among CSC functions to enhance the reliability and latency of communication, accuracy and timeliness of sensing information acquisition, and privacy and security of computing to realize the IMN applications. Specifically, the sensing and communication functions can merge into unified platforms using the same transmit signals, and the acquired real-time sensing information can be exploited as prior information for intelligent algorithms to enhance the performance of communication networks. This is called the computing-empowered integrated sensing and communications (ISAC) reciprocity. Such reciprocity can further improve the performance of distributed computation with the assistance of networked sensing capability, which is named the sensing-empowered integrated communications and computation (ICAC) reciprocity. The above ISAC and ICAC reciprocities can enhance each other iteratively and finally lead to the ICSAC reciprocity. To achieve these reciprocities, we explore the potential enabling technologies for the ICSAC framework. Finally, we present the evaluation results of crucial enabling technologies to show the feasibility of the ICSAC framework.",
    "entities": {
      "0": {
        "entity name": "integrated communication, sensing, and computation (ICSAC) framework",
        "Type": "6G-related technique",
        "Functions": "achieve reciprocity among communication, sensing, and computation (CSC) functions, enhance reliability and latency of communication, accuracy and timeliness of sensing information acquisition, privacy and security of computing",
        "Benefits": "enhanced communication performance, improved distributed computation, networked sensing capability",
        "Application and deployment scenarios": "intelligent machine network (IMN) applications, intelligent transportation"
      }
    }
  },

  "38": {
    "title": "Data Service Maximization in Space-Air-Ground Integrated 6G Networks",
    "description": "Integrating terrestrial and non-terrestrial networks has emerged as a promising paradigm to fulfill the constantly growing demand for connectivity, low transmission delay, and quality of services (QoS). This integration brings together the strengths of the reliability of terrestrial networks, broad coverage and service continuity of non-terrestrial networks like low earth orbit satellites (LEOSats), etc. In this work, we study a data service maximization problem in space-air-ground integrated network (SAGIN) where the ground base stations (GBSs) and LEOSats cooperatively serve the coexisting aerial users (AUs) and ground users (GUs). Then, by considering the spectrum scarcity, interference, and QoS requirements of the users, we jointly optimize the user association, AU's trajectory, and power allocation. To tackle the formulated mixed-integer non-convex problem, we disintegrate it into two subproblems: 1) user association problem and 2) trajectory and power allocation problem. We formulate the user association problem as a binary integer programming problem and solve it by using the Gurobi optimizer. Meanwhile, the trajectory and power allocation problem is solved by the deep deterministic policy gradient (DDPG) method to cope with the problem's non-convexity and dynamic network environments. Then, the two subproblems are alternately solved by the proposed block coordinate descent algorithm. By comparing with the baselines in the existing literature, extensive simulations are conducted to evaluate the performance of the proposed framework.",
    "entities": {
      "0": {
        "entity name": "space-air-ground integrated network (SAGIN)",
        "Type": "6G-related technique",
        "Functions": "fulfill the demand for connectivity, low transmission delay, and quality of services (QoS), optimize user association, AU's trajectory, and power allocation",
        "Benefits": "reliability, broad coverage, service continuity",
        "Components and sub-systems": "ground base stations (GBSs), low earth orbit satellites (LEOSats)",
        "Associated algorithms": "binary integer programming problem, Gurobi optimizer, deep deterministic policy gradient (DDPG), block coordinate descent algorithm",
        "Application and deployment scenarios": "aerial users (AUs), ground users (GUs)"
      }
    }
  },


  "39": {
    "title": "Toward Scalable and Efficient Visual Data Transmission in 6G Networks",
    "description": "6G network technology will emerge in a landscape where visual data transmissions dominate global mobile traffic and are expected to grow continuously, driven by the increasing demand for AI-based computer vision applications. This will make already challenging task of visual data transmission even more difficult. In this work, we review effective techniques for visual data transmission, such as content compression and adaptive video streaming, highlighting their advantages and limitations. Further, considering the scalability and cost issues of cloud-based and on-device AI services, we explore distributed in-network computing architecture like fog-computing as a direction of 6G networks, and investigate the necessary technical properties for the timely delivery of visual data.",
    "entities": {
      "0": {
        "entity name": "visual data transmission",
        "Type": "6G-related technique",
        "Functions": "content compression, adaptive video streaming, distributed in-network computing architecture",
        "Benefits": "scalability, cost efficiency, timely delivery of visual data",
        "Application and deployment scenarios": "AI-based computer vision applications, fog-computing"
      }
    }
  },

  "40": {
    "title": "Towards Event-Triggered NMPC for Efficient 6G Communications: Experimental Results and Open Problems",
    "description": "Networked control systems enable real-time control and coordination of distributed systems, leveraging the low latency, high reliability, and massive connectivity offered by 5G and future 6G networks. Applications include autonomous vehicles, robotics, industrial automation, and smart grids. Despite networked control algorithms admitting nominal stability guarantees even in the presence of delays and packet dropouts, their practical performance still heavily depends on the specific characteristics and conditions of the underlying network. To achieve the desired performance while efficiently using communication resources, co-design of control and communication is pivotal. Although periodic schemes, where communication instances are fixed, can provide reliable control performance, unnecessary transmissions, when updates are not needed, result in inefficient usage of network resources. In this paper, we investigate the potential for co-design of model predictive control and network communication. To this end, we design and implement an event-triggered nonlinear model predictive controller for stabilizing a Furuta pendulum communicating over a tailored open radio access network 6G research platform. We analyze the control performance as well as network utilization under varying channel conditions and event-triggering criteria. Our results show that the event-triggered control scheme achieves similar performance to periodic control with reduced communication demand.",
    "entities": {
      "0": {
        "entity name": "event-triggered nonlinear model predictive controller",
        "Type": "6G-related technique",
        "Functions": "real-time control and coordination of distributed systems, stabilize a Furuta pendulum",
        "Benefits": "reduced communication demand, efficient usage of network resources",
        "Application and deployment scenarios": "autonomous vehicles, robotics, industrial automation, smart grids",
        "Associated technologies": "open radio access network"
      }
    }
  },


  "41": {
    "title": "Performance Analysis and Comparison of Non-ideal Wireless PBFT and RAFT Consensus Networks in 6G Communications",
    "description": "Due to advantages in security and privacy, blockchain is considered a key enabling technology to support 6G communications. Practical Byzantine Fault Tolerance (PBFT) and RAFT are seen as the most applicable consensus mechanisms (CMs) in blockchain-enabled wireless networks. However, previous studies on PBFT and RAFT rarely consider the channel performance of the physical layer, such as path loss and channel fading, resulting in research results that are far from real networks. Additionally, 6G communications will widely deploy high-frequency signals such as terahertz (THz) and millimeter wave (mmWave), while performances of PBFT and RAFT are still unknown when these signals are transmitted in wireless PBFT or RAFT networks. Therefore, it is urgent to study the performance of non-ideal wireless PBFT and RAFT networks with THz and mmWave signals, to better make PBFT and RAFT play a role in the 6G era. In this paper, we study and compare the performance of THz and mmWave signals in non-ideal wireless PBFT and RAFT networks, considering Rayleigh Fading (RF) and close-in Free Space (FS) reference distance path loss. Performance is evaluated by five metrics: consensus success rate, latency, throughput, reliability gain, and energy consumption. Meanwhile, we find and derive that there is a maximum distance between two nodes that can make CMs inevitably successful, and it is named the active distance of CMs. The research results analyze the performance of non-ideal wireless PBFT and RAFT networks, and provide important references for the future transmission of THz and mmWave signals in PBFT and RAFT networks.",
    "entities": {
    "0": {
      "Entity name": "PBFT consensus",
      "Type": "6G-related technique",
      "Functions": "achieve security and privacy in blockchain networks",
      "Key performance indicators": "consensus success rate, latency, throughput",
      "Operating frequency": "THz, mmWave",
      "Associated technologies": "blockchain, 6G"
    },
    "1": {
      "Entity name": "RAFT consensus",
      "Type": "6G-related technique",
      "Functions": "achieve security and privacy in blockchain networks",
      "Key performance indicators": "consensus success rate, latency, throughput",
      "Operating frequency": "THz, mmWave",
      "Associated technologies": "blockchain, 6G"
    }
  }
},



  "42": {
    "title": "Trustworthy Semantic-Enabled 6G Communication: A Task-oriented and Privacy-preserving Perspective",
    "description": "Trustworthy task-oriented semantic communication (ToSC) emerges as an innovative approach in the 6G landscape, characterized by the transmission of only vital information that is directly pertinent to a specific task. While ToSC offers an efficient mode of communication, it concurrently raises concerns regarding privacy, as sophisticated adversaries might possess the capability to reconstruct the original data from the transmitted features. This article provides an in-depth analysis of privacy-preserving strategies specifically designed for ToSC relying on deep neural network-based joint source and channel coding (DeepJSCC). The study encompasses a detailed comparative assessment of trustworthy feature perturbation methods such as differential privacy and encryption, alongside intrinsic security incorporation approaches like adversarial learning to train the JSCC and learning-based vector quantization (LBVQ). This comparative analysis underscores the integration of advanced explainable learning algorithms into communication systems, positing a new benchmark for privacy standards in the forthcoming 6G era.",
    "entities": {
      "0": {
        "entity name": "task-oriented semantic communication (ToSC)",
        "Type": "6G-related technique",
        "Functions": "transmission of only vital information pertinent to a specific task, privacy-preserving strategies",
        "Benefits": "efficient communication, enhanced privacy",
        "Associated algorithms": "deep neural network-based joint source and channel coding (DeepJSCC), adversarial learning, learning-based vector quantization (LBVQ)",
        "Application and deployment scenarios": "6G communication systems"
      }
    }
  },


  "43": {
    "title": "Enabling Communication and Control Co-Design in 6G Networks",
    "description": "Networked control systems (NCSs), which are feedback control loops closed over a communication network, have been a popular research topic over the past decades. Numerous works in the literature propose novel algorithms and protocols with joint consideration of communication and control. However, the vast majority of the recent research results, which have shown remarkable performance improvements if a cross-layer methodology is followed, have not been widely adopted by the industry. In this work, we review the shortcomings of today's mobile networks that render cross-layer solutions, such as semantic and goal-oriented communications, very challenging in practice. To tackle this, we propose a new framework for 6G user plane design that simplifies the adoption of recent research results in networked control, thereby facilitating the joint communication and control design in next-generation mobile networks.",
    "entities": {
      "0": {
        "entity name": "networked control systems",
        "Type": "6G-related technique",
        "Functions": "feedback control loops closed over a communication network",
        "Benefits": "remarkable performance improvements if a cross-layer methodology is followed",
        "Associated algorithms": "novel algorithms and protocols with joint consideration of communication and control",
        "Application and deployment scenarios": "next-generation mobile networks"
      },
      "1": {
        "entity name": "semantic and goal-oriented communications",
        "Type": "6G-related technique",
        "Functions": "cross-layer solutions",
        "Benefits": "simplifies the adoption of recent research results in networked control"
      }
    }
  },

  "44": {
    "title": "Near and Far Field Model Mismatch: Implications on 6G Communications, Localization, and Sensing",
    "description": "The upcoming 6G technology is expected to operate in near-field (NF) radiating conditions thanks to high-frequency and electrically large antenna arrays. Although several studies have already addressed this possibility, it is worth noting that NF models introduce higher complexity, the justification for which is not always evident in terms of performance improvements. This article investigates the implications of the mismatch between NF and far-field (FF) models concerning communication, localization, and sensing systems. Such disparity can lead to a degradation of performance metrics such as sensing and localization accuracy and communication efficiency. By exploring the effects of mismatches between NF and FF models, this study seeks to revolve around the challenges faced by system designers, offering insights about the balance between model accuracy and achievable performance. Finally, we conduct a numerical performance analysis to verify the impact of the mismatch between NF and FF models.",
    "entities": {
      "0": {
        "entity name": "near-field (NF) radiating conditions",
        "Type": "6G-related technique",
        "Functions": "operate in near-field radiating conditions",
        "Benefits": "improved communication, localization, and sensing systems",
        "Key performance indicators": "sensing and localization accuracy, communication efficiency",
        "Operating frequency": "high-frequency",
        "Application and deployment scenarios": "6G communications, localization, and sensing"
      },
      "1": {
        "entity name": "far-field (FF) models",
        "Type": "6G-related technique",
        "Functions": "communication, localization, and sensing systems",
        "Key performance indicators": "sensing and localization accuracy, communication efficiency"
      }
    }
  },

  "45": {
    "title": "User-Centric Cell-Free Wireless Networks for 6G: Communication Theoretic Models and Research Challenges",
    "description": "This paper presents a comprehensive communication theoretic model for the physical layer of a cell-free user-centric network, formed by user equipments (UEs), radio units (RUs), and decentralized units (DUs), uniformly spatially distributed over a given coverage area. We consider RUs equipped with multiple antennas, and focus on the regime where the UE, RU, and DU densities are constant and therefore the number of such nodes grows with the coverage area. A system is said scalable if the computing load and information rate at any node in the network converges to a constant as the network size (coverage area) grows to infinity. This imposes that each UE must be processed by a (user-centric) finite-size cluster of RUs, and that such cluster processors are dynamically allocated to the DUs (e.g., as software defined virtual network functions) in order to achieve a balanced computation load. We also assume that the RUs are connected to the DUs through a packet switching network, in order to achieve adaptive routing and load balance. For this model, we define in details the dynamic cluster formation and uplink pilot allocation. As a consequence of the pilot allocation and the scalability constraint, each cluster processor has a partial view of the network channel state information. We define the condition of ``ideal partial CSI'' when the channel vectors that can be estimated are perfectly known (while the ones that cannot be estimated are not know at all). We develop two attractive cluster-based linear receiver schemes for the uplink, and an uplink-downlink duality that allows to reuse such vectors as precoders for the downlink.",
    "entities": {
      "0": {
        "entity name": "cell-free user-centric network",
        "Type": "6G-related technique",
        "Functions": "communication theoretic model for the physical layer",
        "Components and sub-systems": "user equipments (UEs), radio units (RUs), decentralized units (DUs)",
        "Control mechanisms": "dynamic cluster formation and uplink pilot allocation",
        "Associated algorithms": "cluster-based linear receiver schemes, uplink-downlink duality"
      }
    }
  },



  "46": {
    "title": "Cooperative Multi-Monostatic Sensing for Object Localization in 6G Networks",
    "description": "Enabling passive sensing of the environment using cellular base stations (BSs) will be one of the disruptive features of the sixth-generation (6G) networks. However, accurate localization and positioning of objects are challenging to achieve as multipath significantly degrades the reflected echos. Existing localization techniques perform well under the assumption of large bandwidth available but perform poorly in bandwidth-limited scenarios. To alleviate this problem, in this work, we introduce a 5G New Radio (NR)-based cooperative multi-monostatic sensing framework for passive target localization that operates in the Frequency Range 1 (FR1) band. We propose a novel fusion-based estimation process that can mitigate the effect of multipath by assigning appropriate weight to the range estimation of each BS. Extensive simulation results using ray-tracing demonstrate the efficacy of the proposed multi-sensing framework in bandwidth-limited scenarios.",
    "entities": {
      "0": {
        "entity name": "cooperative multi-monostatic sensing framework",
        "Type": "6G-related technique",
        "Functions": "passive target localization",
        "Benefits": "mitigate the effect of multipath",
        "Key performance indicators": "localization and positioning accuracy",
        "Operating frequency": "Frequency Range 1 (FR1) band",
        "Associated algorithms": "fusion-based estimation process"
      }
    }
  },

  "47": {
    "title": "Topology Optimization for 6G Networks: A Network Information-Theoretic Approach",
    "description": "The classical approach of avoiding or ignoring interference in wireless networks cannot accommodate the ambitious quality-of-service demands of ultra-dense cellular networks (CNs). However, recent ground-breaking information-theoretic advances changed our perception of interference from a foe to a friend. This paper aims to shed light on harnessing the benefits of integrating modern interference management (IM) schemes into future CNs. To this end, we envision a hybrid multiple access (HMA) scheme that decomposes the network into sub-topologies of potential IM schemes for more efficient utilization of network resources. Preliminary results show that HMA can multiply non-orthogonal multiple access performance, especially under dense user deployment.",
    "entities": {
      "0": {
        "entity name": "hybrid multiple access (HMA)",
        "Type": "6G-related technique",
        "Functions": "decomposes the network into sub-topologies of potential IM schemes",
        "Benefits": "more efficient utilization of network resources",
        "Application and deployment scenarios": "ultra-dense cellular networks"
      }
    }
  },


  "48": {
    "title": "The Deployment of IRS in UAV-Empowered 6G Networks",
    "description": "Intelligent reflecting surfaces (IRSs) with the ability to reconfigure inherent electromagnetic reflection and absorption characteristics in real-time provide unparalleled prospects to improve wireless connectivity in adverse circumstances. Unmanned aerial vehicles (UAV)-assisted wireless networks are evolved as a reliable solution to combat non-line of sight (NLoS) scenarios. Thereby, the IRS-empowered UAV-assisted cellular networks will be a significant role-player to improve the coverage and user experiences. The paper aimed to minimize the path loss and maximize the achievable data rate in IRS-UAV-assisted networks. In this context, the work analyzed path loss and achievable rate utilizing millimeter wave (mmWave) carrier considering the conventional UAV model and IRS-empowered UAV communication model. The research obtained that the IRSempowered UAV communications model can significantly minimize path loss and maximize the achievable data rate compared to the conventional UAV-assisted model.",
    "entities": {
      "0": {
        "Entity name": "Intelligent reflecting surfaces (IRSs)",
        "Type": "6G-related technique",
        "Functions": "reconfigure inherent electromagnetic reflection and absorption characteristics in real-time",
        "Benefits": "improve wireless connectivity in adverse circumstances, improve coverage and user experiences, minimize path loss and maximize achievable data rate",
        "Components and sub-systems": "UAV-assisted wireless networks",
        "Key performance indicators": "path loss, achievable data rate",
        "Operating frequency": "millimeter wave (mmWave)",
        "Application and deployment scenarios": "IRS-UAV-assisted cellular networks",
        "Associated technologies": "UAV"
      },
      "1": {
        "entity name": "UAV-assisted wireless networks",
        "Type": "6G-related technique",
        "Functions": "combat non-line of sight (NLoS) scenarios",
        "Benefits": "improve coverage and user experiences"
      }
    }
  },

  "49": {
    "title": "IRS for Multi-Access Edge Computing in 6G Networks",
    "description": "Computation offloading in multi-access edge computing (MEC) is an effective paradigm for enabling resource-intensive smart applications. However, when the wireless channel utilized for offloading computing activities is hostile, the proper advantages of MEC may not be completely realized. Intelligent reflecting surface (IRS) is a new technology that has recently attracted significant interest can optimize the wireless transmission environment in a programmable way and improving the connectivity between user equipment (UE) and base station (BS). In this paper, the performance of MEC architecture is analyzed considering both IRS-assisted and without IRS communication scenarios in the context of the urban micro cellular scenarios. The research obtained that the deployment of IRS can reduce the spectrum and energy consumption significantly.",
    "entities": {
      "0": {
        "Entity name": "Intelligent reflecting surface (IRS)",
        "Type": "6G-related technique",
        "Functions": "optimize wireless transmission environment in programmable way, improve connectivity between UE and BS",
        "Benefits": "reduce spectrum and energy consumption",
        "Application and deployment scenarios": "urban micro cellular scenarios",
        "Associated technologies": "multi-access edge computing (MEC)"
      }
    }
 },

  "50": {
    "title": "Capacity Maximization of the 6G Networks Deploying IRS",
    "description": "The objective of the work is to improve the capacity of the micro cell, i.e., enabling the micro cell base station of a two-tier network to serve an increased number of devices. Therefore, the work deployed an IRS in a micro cell and achieved significant improvements in the performance with a reduced transmit power of the micro base station.",
    "entities": {
      "0": {
        "entity name": "intelligent reflecting surface (IRS)",
        "Type": "6G-related technique",
        "Functions": "improve the capacity of the micro cell",
        "Benefits": "significant improvements in the performance with a reduced transmit power"
      }
    }
  },


  "51": {
    "title": "Deep Learning for Ultra-Reliable and Low-Latency Communications in 6G Networks",
    "description": "In the future 6th generation networks, ultra-reliable and low-latency communications (URLLC) will lay the foundation for emerging mission-critical applications that have stringent requirements on end-to-end delay and reliability. Existing works on URLLC are mainly based on theoretical models and assumptions. The model-based solutions provide useful insights, but cannot be directly implemented in practice. In this article, we first summarize how to apply data-driven supervised deep learning and deep reinforcement learning in URLLC, and discuss some open problems of these methods. To address these open problems, we develop a multi-level architecture that enables device intelligence, edge intelligence, and cloud intelligence for URLLC. The basic idea is to merge theoretical models and real-world data in analyzing the latency and reliability and training deep neural networks (DNNs). Deep transfer learning is adopted in the architecture to fine-tune the pre-trained DNNs in non-stationary networks. Further considering that the computing capacity at each user and each mobile edge computing server is limited, federated learning is applied to improve the learning efficiency. Finally, we provide some experimental and simulation results and discuss some future directions.",
    "entities": {
      "0": {
        "entity name": "ultra-reliable and low-latency communications (URLLC)",
        "Type": "6G-related technique",
        "Functions": "lay the foundation for emerging mission-critical applications",
        "Benefits": "stringent requirements on end-to-end delay and reliability",
        "Components and sub-systems": "device intelligence, edge intelligence, and cloud intelligence",
        "Associated algorithms": "supervised deep learning, deep reinforcement learning, deep transfer learning, federated learning"
      }
    }
  },

  "52": {
    "title": "Semantic Edge Computing and Semantic Communications in 6G Networks: A Unifying Survey and Research Challenges",
    "description": "Semantic Edge Computing (SEC) and Semantic Communications (SemComs) have been proposed as viable approaches to achieve real-time edge-enabled intelligence in sixth-generation (6G) wireless networks. On one hand, SemCom leverages the strength of Deep Neural Networks (DNNs) to encode and communicate the semantic information only, while making it robust to channel distortions by compensating for wireless effects. Ultimately, this leads to an improvement in the communication efficiency. On the other hand, SEC has leveraged distributed DNNs to divide the computation of a DNN across different devices based on their computational and networking constraints. Although significant progress has been made in both fields, the literature lacks a systematic view to connect both fields. In this work, we fulfill the current gap by unifying the SEC and SemCom fields. We summarize the research problems in these two fields and provide a comprehensive review of the state of the art with a focus on their technical strengths and challenges.",
    "entities": {
      "0": {
        "Entity name": "Semantic Edge Computing (SEC)",
        "Type": "6G-related technique",
        "Functions": "divide computation of DNN across different devices",
        "Benefits": "achieve real-time edge-enabled intelligence",
        "Components and sub-systems": "distributed DNNs",
        "Associated technologies": "Semantic Communications"
      },
      "1": {
        "Entity name": "Semantic Communications (SemComs)",
        "Type": "6G-related technique",
        "Functions": "encode and communicate semantic information only, compensate for wireless effects",
        "Benefits": "improve communication efficiency",
        "Components and sub-systems": "Deep Neural Networks (DNNs)"
      }
    }
  },


  "53": {
    "title": "Leveraging NFTs for Spectrum Securitization in 6G Networks",
    "description": "Dynamic Spectrum Sharing can enhance spectrum resource utilization by promoting the dynamic distribution of spectrum resources. However, to effectively implement dynamic spectrum resource allocation, certain mechanisms are needed to incentivize primary users to proactively share their spectrum resources. This paper, based on the ERC404 standard and integrating Non-Fungible Token and Fungible Token technologies, proposes a spectrum securitization model to incentivize spectrum resource sharing and implements it on the Ethereum test net.",
    "entities": {
      "0": {
        "entity name": "Dynamic Spectrum Sharing",
        "Type": "6G-related technique",
        "Functions": "enhance spectrum resource utilization",
        "Benefits": "promoting the dynamic distribution of spectrum resources",
        "Associated technologies": "Non-Fungible Token, Fungible Token, ERC404 standard"
      }
    }
  },

  "54": {
    "title": "Collaborative Authentication for 6G Networks: An Edge Intelligence based Autonomous Approach",
    "description": "The conventional device authentication of wireless networks usually relies on a security server and centralized process, leading to long latency and risk of single-point of failure. While these challenges might be mitigated by collaborative authentication schemes, their performance remains limited by the rigidity of data collection and aggregated result. They also tend to ignore attacker localization in the collaborative authentication process. To overcome these challenges, a novel collaborative authentication scheme is proposed, where multiple edge devices act as cooperative peers to assist the service provider in distributively authenticating its users by estimating their received signal strength indicator (RSSI) and mobility trajectory (TRA). More explicitly, a distributed learning-based collaborative authentication algorithm is conceived, where the cooperative peers update their authentication models locally, thus the network congestion and response time remain low. Moreover, a situation-aware secure group update algorithm is proposed for autonomously refreshing the set of cooperative peers in the dynamic environment. We also develop an algorithm for localizing a malicious user by the cooperative peers once it is identified. The simulation results demonstrate that the proposed scheme is eminently suitable for both indoor and outdoor communication scenarios, and outperforms some existing benchmark schemes.",
    "entities": {
      "0": {
        "Entity name": "collaborative authentication scheme",
        "Type": "6G-related technique",
        "Functions": "distributively authenticating users using RSSI and TRA",
        "Benefits": "reduce network congestion and response time, mitigate single-point failure",
        "Control mechanisms": "distributed",
        "Associated algorithms": "distributed learning-based collaborative authentication algorithm",
        "Application and deployment scenarios": "indoor and outdoor communication scenarios"
      }
}
},

  "55": {
    "title": "Adversarial Security and Differential Privacy in mmWave Beam Prediction in 6G networks",
    "description": "In the forthcoming era of 6G, the mmWave communication is envisioned to be used in dense user scenarios with high bandwidth requirements, that necessitate efficient and accurate beam prediction. Machine learning (ML) based approaches are ushering as a critical solution for achieving such efficient beam prediction for 6G mmWave communications. However, most contemporary ML classifiers are quite susceptible to adversarial inputs. Attackers can easily perturb the methodology through noise addition in the model itself. To mitigate this, the current work presents a defensive mechanism for attenuating the adversarial attacks against projected ML-based models for mmWave beam anticipation by incorporating adversarial training. Furthermore, as training 6G mmWave beam prediction model necessitates the use of large and comprehensive datasets that could include sensitive information regarding the user's location, differential privacy (DP) has been introduced as a technique to preserve the confidentiality of the information by purposefully adding a low sensitivity controlled noise in the datasets. It ensures that even if the information about a user location could be retrieved, the attacker would have no means to determine whether the information is significant or meaningless. With ray-tracing simulations for various outdoor and indoor scenarios, we illustrate the advantage of our proposed novel framework in terms of beam prediction accuracy and effective achievable rate while ensuring the security and privacy in communications.",
    "entities": {
      "0": {
        "entity name": "mmWave communication",
        "Type": "6G-related technique",
        "Functions": "efficient and accurate beam prediction",
        "Benefits": "high bandwidth requirements in dense user scenarios",
        "Operating frequency": "mmWave",
        "Associated algorithms": "adversarial training, differential privacy (DP)"
      },
     "1": {
        "Entity name": "adversarial training",
        "Type": "6G-related technique",
        "Functions": "attenuate adversarial attacks against ML-based models",
        "Benefits": "ensure security and privacy in communications",
        "Operating frequency": "mmWave",
        "Associated algorithms": "differential privacy (DP)"
      }
    }
  },



  "56": {
    "title": "Secure, Robust, and Energy-Efficient Authenticated Data Sharing in UAV-Assisted 6G Networks",
    "description": "This paper confronts the pressing challenges of sixth-generation (6G) wireless communication networks by harnessing the unique capabilities of Unmanned Aerial Vehicles (UAVs). With the ambitious promises of 6G, including ultra-reliable 1 Tbps data delivery and ultra-low latency, the demand for innovative solutions becomes imperative. Traditional terrestrial base stations, though effective, exhibit limitations in scenarios requiring ubiquitous connectivity, prompting the integration of UAVs. In response to these challenges, we introduce a comprehensive solution. This involves UAVs collaboratively downloading desired content from service providers, and subsequently establishing secure connections with users for efficient content exchange. Accordingly, we introduce two new protocols: a collaborative group data downloading scheme among UAVs called SeGDS, and SeDDS for secure direct data sharing through out-of-band autonomous Device-to-Device (D2D) communication. Leveraging certificateless signcryption and certificateless multi-receiver encryption, these protocols offer lightweight, certificate-free solutions with features such as user revocation, non-repudiation, and mutual authentication. Prioritizing high availability, the proposed protocols effectively detect Denial of Service (DoS) and free riding attacks. A thorough evaluation underscores the superiority of the proposed protocols in both security and efficiency over existing models; SeDDS reduces overall computation by 3x, imposing a lighter communication load on UAVs, while SeGDS meets swarm UAV security requirements, reducing communication costs by 4x with low computation cost.",
    "entities": {
      "0": {
        "entity name": "Unmanned Aerial Vehicles (UAVs)",
        "Type": "6G-related technique",
        "Functions": "collaboratively downloading desired content from service providers, establishing secure connections with users for efficient content exchange",
        "Benefits": "ultra-reliable 1 Tbps data delivery, ultra-low latency",
        "Components and sub-systems": "SeGDS, SeDDS",
        "Associated technologies": "certificateless signcryption, certificateless multi-receiver encryption, Device-to-Device (D2D) communication"
      },
"1": {
        "Entity name": "SeGDS and SeDDS protocols",
        "Type": "6G-related technique",
        "Functions": "secure group data downloading and direct data sharing",
        "Benefits": "detect DoS and free riding attacks, reduce computation and communication costs",
        "Components and sub-systems": "certificateless signcryption, certificateless multi-receiver encryption",
        "Associated technologies": "UAVs, Device-to-Device (D2D) communication"
      }
    }
  },


  "57": {
    "title": "Towards Energy Efficient Distributed Federated Learning for 6G Networks",
    "description": "The provision of communication services via portable and mobile devices, such as aerial base stations, is a crucial concept to be realized in 5G/6G networks. Conventionally, IoT/edge devices need to transmit the data directly to the base station for training the model using machine learning techniques. The data transmission introduces privacy issues that might lead to security concerns and monetary losses. Recently, Federated learning was proposed to partially solve privacy issues via model-sharing with base station. However, the centralized nature of federated learning only allow the devices within the vicinity of base stations to share the trained models. Furthermore, the long-range communication compels the devices to increase transmission power, which raises the energy efficiency concerns. In this work, we propose distributed federated learning (DBFL) framework that overcomes the connectivity and energy efficiency issues for distant devices. The DBFL framework is compatible with mobile edge computing architecture that connects the devices in a distributed manner using clustering protocols. Experimental results show that the framework increases the classification performance by 7.4\\% in comparison to conventional federated learning while reducing the energy consumption.",
   "entities": {
      "0": {
        "Entity name": "distributed federated learning (DBFL) framework",
        "Type": "6G-related technique",
        "Functions": "connects devices in a distributed manner using clustering protocols",
        "Benefits": "overcomes connectivity and energy efficiency issues, increases classification performance by 7.4%, reduces energy consumption",
        "Components and sub-systems": "mobile edge computing architecture",
        "Application and deployment scenarios": "distant devices in 5G/6G networks",
        "Associated technologies": "federated learning"
      }
    }
  },

  "58": {
    "title": "Beamforming in LEO Constellations for NB-IoT Services in 6G Communications",
    "description": "With the first commercializations of 5G networks, Beyond 5G (B5G), or 6G, systems are starting to be defined. In this context, Internet of Things (IoT) services will be even more impactful with respect to 5G systems. In order to cope with the huge amount of IoT devices, and the potentially large capacity requirements for the most advanced of them (e.g., live camera feeds from first responders in emergency scenarios), non-terrestrial systems will be pivotal to assist and complement the terrestrial networks. In this paper, we propose a multi-layer non-terrestrial architecture for NarrowBand-IoT (NB-IoT) services based on Geosynchronous Orbit (GSO) and Non GSO (NGSO) nodes. To cope with both the number of devices and the potentially large capacities, we propose to implement Minimum Mean Square Error (MMSE) beamforming in an aggressive full frequency reuse scenario. The performance assessment shows the significant benefits of the proposed solution.",
     "entities": {
      "0": {
        "Entity name": "multi-layer non-terrestrial architecture",
        "Type": "6G-related technique",
        "Functions": "implement Minimum Mean Square Error (MMSE) beamforming in full frequency reuse",
        "Benefits": "copes with number of devices and large capacities",
        "Components and sub-systems": "Geosynchronous Orbit (GSO) and Non GSO (NGSO) nodes",
        "Associated algorithms": "Minimum Mean Square Error (MMSE) beamforming",
        "Application and deployment scenarios": "NarrowBand-IoT (NB-IoT) services",
        "Associated technologies": "non-terrestrial systems"
      }
    }
  },

  "59": {
    "title": "From Hype to Reality: The Road Ahead of Deploying DRL in 6G Networks",
    "description": "The industrial landscape is rapidly evolving with the advent of 6G applications, which demand massive connectivity, high computational capacity, and ultra-low latency. These requirements present new challenges, which can no longer be efficiently addressed by conventional strategies. In response, this article underscores the transformative potential of Deep Reinforcement Learning (DRL) for 6G, highlighting its advantages over classic machine learning solutions in meeting the demands of 6G. The necessity of DRL is further validated through three DRL applications in an end-to-end communication procedure, including wireless access control, baseband function placement, and network slicing coordination. However, DRL-based network management initiatives are far from mature. We extend the discussion to identify the challenges of applying DRL in practical networks and explore potential solutions along with their respective limitations. In the end, these insights are validated through a practical DRL deployment in managing network slices on the testbed.",
    "entities": {
      "0": {
        "entity name": "Deep Reinforcement Learning (DRL)",
        "Type": "6G-related technique",
        "Functions": "wireless access control, baseband function placement, network slicing coordination",
        "Benefits": "transformative potential for 6G applications",
"Associated technologies": "network slicing",
        "Application and deployment scenarios": "managing network slices on the testbed"
      }
    }
  },

  "60": {
    "title": "Metasurface-Coated Devices: A New Paradigm for Energy-Efficient and Secure 6G Communications",
    "description": "The sixth-generation (6G) era comes with the challenge of offering highly energy-efficient and autonomous communications securely. In this direction, we report energy efficiency (EE), energy harvesting (EH), and secure performance by employing power-collecting metasurface-coated devices capable of supporting ultra-low-power (ULP) transmissions. Contrary to reconfigurable intelligent surfaces (RIS), where the reflected signal can be combined at the receiver by being treated as transmitted from a relay, the proposed metasurface claddings can be deployed at either or both the transmitter and receiver. The passive metasurface-coated devices can achieve ultra-high EE and EH besides the signal detection, combined with an enhanced secrecy rate at the legitimate user and/or improved spying capabilities of the eavesdroppers under ULP transmission. To quantify their efficiency, we provide a holistic model for the utilization of the metasurface shells. Building upon the aforementioned model, preliminary results are presented that reveal the unprecedented superiority of the proposed concept compared to the RIS paradigm. Additionally, we enumerate the main advantages of the new concept and define its role in the 6G era. Finally, possible research directions are discussed.",
    "entities": {
      "0": {
        "entity name": "metasurface-coated devices",
        "Type": "6G-related technique",
        "Functions": "support ultra-low-power (ULP) transmissions",
        "Benefits": "ultra-high energy efficiency (EE), energy harvesting (EH), enhanced secrecy rate",
        "Components and sub-systems": "metasurface shells",
        "Associated technologies": "reconfigurable intelligent surfaces (RIS)"
      }
    }
},


  "61": {
    "title": "An Analysis on Rate-Splitting Multiple Access for IRS Aided 6G Communication",
    "description": "Integrating intelligent reflecting surface (IRS) and Rate-Splitting Multiple Access (RSMA) is an effective solution to improve the spectral/energy efficiency in next-generation (beyond 5G (B5G) and 6G) wireless networks. In this paper, we investigate a rate-splitting (RS)-based transmission technique for an IRS-aided communication network involving both near and cell-edge users. In particular, we derive a new architecture called IRS-RS that leverages the interplay between RS and IRS, with an aim to maximize the weighted sum-rate (WSR) of users by selecting the reflecting coefficients at the IRS and designing beamformers at the BS under the constraints of power at the base station (BS), quality of service (QoS) at each user and finite resolution at the IRS. To solve the non-convex WSR maximization problem, we propose an alternating algorithm and compare its performance with baseline non-orthogonal multiple access (NOMA) based transmission for an IRS-aided communication network for both perfect and imperfect CSIT cases. Through numerical results, it is shown that the proposed IRS-RS architecture yields better QoS with respect to the cell-edge users when compared to IRS-NOMA transmission scheme.",
    "entities": {
      "0": {
        "entity name": "intelligent reflecting surface (IRS)",
        "Type": "6G-related technique",
        "Functions": "improve the spectral/energy efficiency",
        "Benefits": "maximize the weighted sum-rate (WSR) of users",
        "Components and sub-systems": "reflecting coefficients, beamformers",
        "Key performance indicators": "weighted sum-rate (WSR)",
        "Control mechanisms": "alternating algorithm",
        "Application and deployment scenarios": "IRS-aided communication network involving both near and cell-edge users",
        "Associated technologies": "Rate-Splitting Multiple Access (RSMA), non-orthogonal multiple access (NOMA)"
      },
      "1": {
        "entity name": "Rate-Splitting Multiple Access (RSMA)",
        "Type": "6G-related technique",
        "Functions": "improve the spectral/energy efficiency",
        "Benefits": "maximize the weighted sum-rate (WSR) of users",
        "Components and sub-systems": "beamformers",
        "Key performance indicators": "weighted sum-rate (WSR)",
        "Control mechanisms": "alternating algorithm",
        "Application and deployment scenarios": "IRS-aided communication network involving both near and cell-edge users",
        "Associated technologies": "intelligent reflecting surface (IRS), non-orthogonal multiple access (NOMA)"
      }
    }
  },


  "62": {
    "title": "A General 3D Non-Stationary Massive MIMO GBSM for 6G Communication Systems",
    "description": "A general three-dimensional (3D) non-stationary massive multiple-input multiple-output (MIMO) geometry-based stochastic model (GBSM) for the sixth generation (6G) communication systems is proposed in the paper. The novelty of the model is that the model is designed to cover a variety of channel characteristics, including space-time-frequency (STF) non-stationarity, spherical wavefront, spatial consistency, channel hardening, etc. Firstly, the introduction of the twin-cluster channel model is given in detail. Secondly, the key statistical properties such as space-time-frequency correlation function (STFCF), space cross-correlation function (CCF), temporal autocorrelation function (ACF), frequency correlation function (FCF), and performance indicators, e.g., singular value spread (SVS), and channel capacity are derived. Finally, the simulation results are given and consistent with some measurements in relevant literatures, which validate that the proposed channel model has a certain value as a reference to model massive MIMO channel characteristics.",
    "entities": {
      "0": {
        "Entity name": "3D non-stationary massive MIMO geometry-based stochastic model (GBSM)",
        "Type": "6G-related technique",
        "Functions": "cover space-time-frequency (STF) non-stationarity, spherical wavefront, spatial consistency",
        "Components and sub-systems": "twin-cluster channel model",
        "Key performance indicators": "singular value spread (SVS), channel capacity",
        "Application and deployment scenarios": "6G communication systems"
      }
    }
  },



  "63": {
    "title": "Pixel-Level GPS Localization and Denoising using Computer Vision and 6G Communication Beams",
    "description": "Accurate localization is crucial for various applications, including autonomous vehicles and next-generation wireless networks. However, the reliability and precision of Global Navigation Satellite Systems (GNSS), such as the Global Positioning System (GPS), are compromised by multi-path errors and non-line-of-sight scenarios. This paper presents a novel approach to enhance GPS accuracy by combining visual data from RGB cameras with wireless signals captured at millimeter-wave (mmWave) and sub-terahertz (sub-THz) basestations. We propose a sensing-aided framework for (i) site-specific GPS data characterization and (ii) GPS position de-noising that utilizes multi-modal visual and wireless information. Our approach is validated in a realistic Vehicle-to-Infrastructure (V2I) scenario using a comprehensive real-world dataset, demonstrating a substantial reduction in localization error to sub-meter levels. This method represents a significant advancement in achieving precise localization, particularly beneficial for high-mobility applications in 5G and beyond networks.",
    "entities": {
      "0": {
        "entity name": "Global Positioning System (GPS)",
        "Type": "6G-related technique",
        "Functions": "enhance GPS accuracy",
        "Benefits": "substantial reduction in localization error to sub-meter levels",
        "Components and sub-systems": "RGB cameras, millimeter-wave (mmWave) and sub-terahertz (sub-THz) basestations",
        "Application and deployment scenarios": "autonomous vehicles, next-generation wireless networks, Vehicle-to-Infrastructure (V2I) scenario",
        "Associated technologies": "Global Navigation Satellite Systems (GNSS)"
      }
    }
  },


  "64": {
    "title": "Boosted Neural Decoders: Achieving Extreme Reliability of LDPC Codes for 6G Networks",
    "description": "Ensuring extremely high reliability in channel coding is essential for 6G networks. The next-generation of ultra-reliable and low-latency communications (xURLLC) scenario within 6G networks requires frame error rate (FER) below $10^{-9}$. However, low-density parity-check (LDPC) codes, the standard in 5G new radio (NR), encounter a challenge known as the error floor phenomenon, which hinders to achieve such low rates. To tackle this problem, we introduce an innovative solution: boosted neural min-sum (NMS) decoder. This decoder operates identically to conventional NMS decoders, but is trained by novel training methods including: i) boosting learning with uncorrected vectors, ii) block-wise training schedule to address the vanishing gradient issue, iii) dynamic weight sharing to minimize the number of trainable weights, iv) transfer learning to reduce the required sample count, and v) data augmentation to expedite the sampling process. Leveraging these training strategies, the boosted NMS decoder achieves the state-of-the art performance in reducing the error floor as well as superior waterfall performance. Remarkably, we fulfill the 6G xURLLC requirement for 5G LDPC codes without a severe error floor. Additionally, the boosted NMS decoder, once its weights are trained, can perform decoding without additional modules, making it highly practical for immediate application. The source code is available at https://github.com/ghy1228/LDPC_Error_Floor.",
     "entities": {
      "0": {
        "Entity name": "boosted neural min-sum (NMS) decoder",
        "Type": "6G-related technique",
        "Functions": "achieve frame error rate (FER) below 10^-9 through novel training methods",
        "Benefits": "eliminates error floor phenomenon in LDPC codes",
        "Key performance indicators": "frame error rate (FER)",
        "Associated algorithms": "transfer learning, boosting learning, block-wise training, dynamic weight sharing, data augmentation",
        "Associated technologies": "low-density parity-check (LDPC) codes"
      }
    }
  },

  "65": {
    "title": "Intermodulation Interference Detection in 6G Networks: A Machine Learning Approach",
    "description": "This paper demonstrates the use of machine learning to detect the presence of intermodulation interference across several wireless carriers. We show a salient characteristic of intermodulation interference and propose a machine learning based algorithm that detects the presence of intermodulation interference through the use of supervised learning. This algorithm can use the radio access network intelligent controller or the sixth generation of wireless communication (6G) edge node as a means of computation. Our proposed algorithm runs in linear time in the number of resource blocks, making it a suitable radio resource management application in 6G.",
    "entities": {
      "0": {
        "Entity name": "intermodulation interference Detection",
        "Type": "6G-related technique",
        "Functions": "detect the presence of intermodulation interference through supervised learning",
        "Components and sub-systems": "radio access network intelligent controller; 6G edge node",
        "Application and deployment scenarios": "radio resource management application in 6G",
        "Associated algorithms": "supervised learning"
      }
    }
  },



  "66": {
    "title": "Enabling Mobility-Oriented JCAS in 6G Networks: An Architecture Proposal",
    "description": "Sensing plays a crucial role in autonomous and assisted vehicular driving, as well as in the operation of autonomous drones. The traditional segregation of communication and onboard sensing systems in mobility applications is due to be merged using Joint Communication and Sensing (JCAS) in the development of the 6G mobile radio standard. The integration of JCAS functions into the future road traffic landscape introduces novel challenges for the design of the 6G system architecture. Special emphasis will be placed on facilitating direct communication between road users and aerial drones. In various mobility scenarios, diverse levels of integration will be explored, ranging from leveraging communication capabilities to coordinate different radars to achieving deep integration through a unified waveform. In this paper, we have identified use cases and derive five higher-level Tech Cases (TCs). Technical and functional requirements for the 6G system architecture for a device-oriented JCAS approach will be extracted from the TCs and used to conceptualize the architectural views.",
    "entities": {
      "0": {
        "entity name": "Joint Communication and Sensing (JCAS)",
        "Type": "6G-related technique",
        "Functions": "merging communication and onboard sensing systems",
        "Benefits": "facilitating direct communication between road users and aerial drones",
        "Components and sub-systems": "unified waveform, ",
        "Application and deployment scenarios": "autonomous and assisted vehicular driving, operation of autonomous drones"
      }
    }
  },



  "67": {
    "title": "Human-Centric Decision-Making in Cell-Less 6G Networks",
    "description": "In next-generation networks, cells will be replaced by a collection of points-of-access (PoAs), with overlapping coverage areas and/or different technologies. Along with a promise for greater performance and flexibility, this creates further pressure on network management algorithms, which must make joint decisions on (i) PoA-to-user association and (ii) PoA management. We solve this challenging problem through an efficient and effective solution concept called Cluster-then-Match (CtM). Importantly, CtM makes human-centric decisions, where pure network performance is balanced against metrics like energy consumption and electromagnetic field exposure, which concern all humans in the network area -- including those who are not network users. Through our performance evaluation, which leverages detailed models for EMF exposure estimation and standard-specified signal propagation models, we show that CtM outperforms state-of-the-art network management schemes, including those utilizing machine learning, reducing energy consumption by over 80%.",
    "entities": {
      "0": {
        "entity name": "Cluster-then-Match (CtM)",
        "Type": "6G-related technique",
        "Functions": "making human-centric decisions on PoA-to-user association and PoA management",
        "Benefits": "reducing energy consumption by over 80%",
        "Key performance indicators": "energy consumption, electromagnetic field exposure",
        "Control mechanisms": "human-centric decision-making"
      }
    }
  },




  "68": {
    "title": "Designing the Network Intelligence Stratum for 6G Networks",
    "description": "As network complexity escalates, there is an increasing need for more sophisticated methods to manage and operate these networks, focusing on enhancing efficiency, reliability, and security. A wide range of Artificial Intelligence (AI)/Machine Learning (ML) models are being developed in response. These models are pivotal in automating decision-making, conducting predictive analyses, managing networks proactively, enhancing security, and optimizing network performance. They are foundational in shaping the future of networks, collectively forming what is known as Network Intelligence (NI). Prominent Standard-Defining Organizations (SDOs) are integrating NI into future network architectures, particularly emphasizing the closed-loop approach. However, existing methods for seamlessly integrating NI into network architectures are not yet fully effective. This paper introduces an in-depth architectural design for a Network Intelligence Stratum (NI Stratum). This stratum is supported by a novel end-to-end NI orchestrator that supports closed-loop NI operations across various network domains. The primary goal of this design is to streamline the deployment and coordination of NI throughout the entire network infrastructure, tackling issues related to scalability, conflict resolution, and effective data management. We detail exhaustive workflows for managing the NI lifecycle and demonstrate a reference implementation of the NI Stratum, focusing on its compatibility and integration with current network systems and open-source platforms such as Kubernetes and Kubeflow, as well as on its validation on real-world environments. The paper also outlines major challenges and open issues in deploying and managing NI.",
    "entities": {
      "0": {
        "entity name": "Network Intelligence (NI)",
        "Type": "6G-related technique",
        "Functions": "automating decision-making, conducting predictive analyses, managing networks proactively, enhancing security, and optimizing network performance",
        "Benefits": "streamlining the deployment and coordination of NI throughout the entire network infrastructure",
        "Components and sub-systems": "end-to-end NI orchestrator",
        "Application and deployment scenarios": "integration with current network systems and open-source platforms such as Kubernetes and Kubeflow"
      }
    }
  },


  "69": {
    "title": "Dynamic Spectrum Management for 6G Network-in-Network Concepts",
    "description": "Flexible, self-organizing communication networks will be a key feature in the next mobile communication standard. Network-in-Network (NiN) is one important concept in 6G research, introducing sub-networks tailored to specific application requirements. These sub-networks may be dynamic, i.e., they may appear, disappear, or even move throughout the network. Moreover, sub-networks may operate within a shared frequency spectrum, thereby requiring coordination among them. We demonstrate the concept of Dynamic Spectrum Management (DSM) for future 6G networks that dynamically (re-)allocates spectrum according to active sub-networks in the shared spectrum domain. Resilient control plane connectivity between sub-networks and the DSM is provided by the self-organizing routing protocol KIRA, enabling the aforementioned coordination. This demonstration presents an integrated solution of the DSM concept, providing increased flexibility to support diverse industrial applications and their individual performance requirements simultaneously within the context of a cyber-physical production system (CPPS). For the sub-networks, we use specifically designed hardware for wireless real-time communication and couple them with a network emulation. By switching sub-networks on and off, one can see that the DSM dynamically manages the spectrum allocations for them and that KIRA provides the required connectivity.",
    "entities": {
      "0": {
        "Entity name": "Network-in-Network (NiN)",
        "Type": "6G-related technique",
        "Functions": "introducing sub-networks tailored to specific application requirements",
        "Benefits": "flexibility to support diverse industrial applications",
        "Components and sub-systems": "sub-networks",
        "Control mechanisms": "self-organizing routing protocol KIRA"
},
      "1": {
        "Entity name": "Dynamic Spectrum Management (DSM)",
        "Type": "6G-related technique",
        "Functions": "dynamically (re-)allocates spectrum according to active sub-networks",
        "Benefits": "increased flexibility to support diverse industrial applications",
        "Components and sub-systems": "specifically designed hardware for wireless real-time communication",
        "Control mechanisms": "self-organizing routing protocol KIRA",
        "Associated technologies": "cyber-physical production system (CPPS)"
      }
    }
  },


  "70": {
    "title": "Towards Beyond Communications 6G Networks Status and Challenges",
    "description": "Wireless communication has profoundly transformed the way we experience the world. For instance, at most events, attendees commonly utilize their smartphones to document and share their experiences. This shift in user behavior largely stems from the cellular network s capacity for communication. However, as networks become increasingly sophisticated, new opportunities arise to leverage the network for services beyond mere communication, collectively termed Beyond Communication Services (BCS). These services encompass joint communications and sensing, network as a service, and distributed computing. This paper presents examples of BCS and identifies the enablers necessary to facilitate their realization in sixth generation (6G). These enablers encompass exposing data and network capabilities, optimizing protocols and procedures for BCS, optimizing compute offloading protocols and signalling, and employing application and device-driven optimization strategies.",
    "entities": {
      "0": {
        "entity name": "Beyond Communication Services (BCS)",
        "Type": "6G-related technique",
        "Functions": "leveraging the network for services beyond mere communication",
        "Benefits": "encompassing joint communications and sensing, network as a service, and distributed computing",
        "Application and deployment scenarios": "exposing data and network capabilities, optimizing protocols and procedures for BCS"
      }
    }
  },

  "71": {
    "title": "Learning-based visibility prediction for terahertz communications in 6G networks",
    "description": "Terahertz communications are envisioned as a key enabler for 6G networks. The abundant spectrum available in such ultra high frequencies has the potential to increase network capacity to huge data rates. However, they are extremely affected by blockages, to the point of disrupting ongoing communications. In this paper, we elaborate on the relevance of predicting visibility between users and access points (APs) to improve the performance of THz-based networks by minimizing blockages, that is, maximizing network availability, while at the same time keeping a low reconfiguration overhead. We propose a novel approach to address this problem, by combining a neural network (NN) for predicting future user-AP visibility probability, with a probability threshold for AP reselection to avoid unnecessary reconfigurations. Our experimental results demonstrate that current state-of-the-art handover mechanisms based on received signal strength are not adequate for THz communications, since they are ill-suited to handle hard blockages. Our proposed NN-based solution significantly outperforms them, demonstrating the interest of our strategy as a research line.",
    "entities": {
      "0": {
        "Entity name": "Terahertz communications",
        "Type": "6G-related technique",
        "Functions": "increase network capacity to huge data rates",
        "Benefits": "maximizing network availability",
        "Operating frequency": "THz",
        "Key performance indicators": "network availability, reconfiguration overhead"
      },
      "1": {
        "Entity name": "Neural network (NN) for visibility prediction",
        "Type": "6G-related technique",
        "Functions": "predicting future user-AP visibility probability",
        "Benefits": "minimizing blockages, keeping low reconfiguration overhead",
        "Associated algorithms": "probability threshold for AP reselection"
      }
    }
  },



  "72": {
    "title": "Spectrum Learning-Aided Reconfigurable Intelligent Surfaces for 'Green' 6G Networks",
    "description": "In the sixth-generation (6G) era, emerging large-scale computing based applications (for example processing enormous amounts of images in real-time in autonomous driving) tend to lead to excessive energy consumption for the end users, whose devices are usually energy-constrained. In this context, energy-efficiency becomes a critical challenge to be solved for harnessing these promising applications to realize 'green' 6G networks. As a remedy, reconfigurable intelligent surfaces (RIS) have been proposed for improving the energy efficiency by beneficially reconfiguring the wireless propagation environment. In conventional RIS solutions, however, the received signal-to-interference-plus-noise ratio (SINR) sometimes may even become degraded. This is because the signals impinging upon an RIS are typically contaminated by interfering signals which are usually dynamic and unknown. To address this issue, `learning' the properties of the surrounding spectral environment is a promising solution, motivating the convergence of artificial intelligence and spectrum sensing, termed here as spectrum learning (SL). Inspired by this, we develop an SL-aided RIS framework for intelligently exploiting the inherent characteristics of the radio frequency (RF) spectrum for green 6G networks. Given the proposed framework, the RIS controller becomes capable of intelligently `{think-and-decide}' whether to reflect or not the incident signals. Therefore, the received SINR can be improved by dynamically configuring the binary ON-OFF status of the RIS elements. The energy-efficiency benefits attained are validated with the aid of a specific case study. Finally, we conclude with a list of promising future research directions.",
      "entities": {
      "0": {
        "Entity name": "Reconfigurable intelligent surfaces (RIS)",
        "Type": "6G-related technique",
        "Functions": "reconfiguring the wireless propagation environment",
        "Benefits": "improved energy efficiency, enhanced SINR",
        "Components and sub-systems": "binary ON-OFF status of the RIS elements",
        "Control mechanisms": "dynamic configuration",
        "Associated technologies": "spectrum learning (SL)"
      },
      "1": {
        "Entity name": "Spectrum learning (SL)",
        "Type": "6G-related technique",
        "Functions": "learning the properties of the surrounding spectral environment",
        "Benefits": "intelligent reflection decisions",
        "Associated technologies": "artificial intelligence and spectrum sensing"
      }
    }
  },


  "73": {
    "title": "Maximization of User Association Deploying IRS in 6G Networks",
    "description": "Prospective mobile networks will be heterogeneous multi-tier networks, with different classes of base stations (BS) installed dependent on user demand. Multi-tier networks enable operators to enhance system capacity and coverage through flexible implementations. Intelligent reflecting surfaces (IRS) or reconfigurable intelligent surfaces (RIS) is a novel and disruptive technology that comprises a vast number of cost-efficient passive components, each of which can intelligently reflect the incident wave or signal with a reconfigurable phase shift. The objective of this work is to maximize the probability of user association for millimeter-wave (mmWave) carriers in a two-tier 6G network consisting of micro and macro cell tiers. Therefore, the work analyzed and compared the probability of user association for conventional and IRS-assisted micro base stations. The research derived that, the deployment of IRS in a micro cell significantly enhances or maximizes the probability of user association of the entire coverage region including the cell edge. Moreover, the deployment of IRS reduces the transmit power consumption of the micro base station which assures a notable energy efficiency.",
    "entities": {
      "0": {
        "entity name": "Intelligent reflecting surfaces (IRS) or reconfigurable intelligent surfaces (RIS)",
        "Type": "6G-related technique",
        "Functions": "intelligently reflect the incident wave or signal with a reconfigurable phase shift",
        "Benefits": "enhances or maximizes the probability of user association, reduces transmit power consumption, assures notable energy efficiency",
        "Components and sub-systems": "cost-efficient passive components",
        "Key performance indicators": "probability of user association",
        "Operating frequency": "millimeter-wave (mmWave)",
        "Application and deployment scenarios": "two-tier 6G network consisting of micro and macro cell tiers"
      }
    }
  },

  "74": {
    "title": "Downlink Received Power Performance Analysis of IRS for 6G Networks",
    "description": "The Internet of Things (IoT) is going to be a few of the most influential and critical role spectators in the post-5G and 6G wireless networking paradigm because IoT is being deployed in a variety of applications and services such as smart towns, smart homes, savvy environment monitoring, smart medical care, smart factories, savvy agri-business, and so on, with the goal of enabling intelligent coordination and efficiency improvement. An intelligent reflective surface (IRS) is a notable invention that will be included into 6G wireless systems to optimize the electromagnetic propagation atmosphere in a configurable or adjustable manner in order to increase communication between the transmitting and receiving devices. The study aims to increase IoT service coverage by employing IRS in micro wireless transmission. As a result, in terms of receiving power, the research investigated and compared the effectiveness of traditional small cellular connectivity with IRS-enhanced small cellular transmission in the 6G wireless IoT environment. According to the findings, deploying IRS greatly improves coverage for IoT-related services.",
    "entities": {
      "0": {
        "entity name": "intelligent reflective surface (IRS)",
        "Type": "6G-related technique",
        "Functions": "optimize the electromagnetic propagation atmosphere in a configurable or adjustable manner",
        "Benefits": "greatly improves coverage for IoT-related services",
        "Application and deployment scenarios": "6G wireless IoT environment"
      }
    }
  },


  "75": {
    "title": "Decomposition Based Interference Management Framework for Local 6G Networks",
    "description": "Managing inter-cell interference is among the major challenges in a wireless network, more so when strict quality of service needs to be guaranteed such as in ultra-reliable low latency communications (URLLC) applications. This study introduces a novel intelligent interference management framework for a local 6G network that allocates resources based on interference prediction. The proposed algorithm involves an advanced signal pre-processing technique known as empirical mode decomposition followed by prediction of each decomposed component using the sequence-to-one transformer algorithm. The predicted interference power is then used to estimate future signal-to-interference plus noise ratio, and subsequently allocate resources to guarantee the high reliability required by URLLC applications. Finally, an interference cancellation scheme is explored based on the predicted interference signal with the transformer model. The proposed sequence-to-one transformer model exhibits its robustness for interference prediction. The proposed scheme is numerically evaluated against two baseline algorithms, and is found that the root mean squared error is reduced by up to 55% over a baseline scheme.",
    "entities": {
      "0": {
        "entity name": "intelligent interference management framework",
        "Type": "6G-related technique",
        "Functions": "allocates resources based on interference prediction",
        "Benefits": "guarantees high reliability required by URLLC applications",
        "Components and sub-systems": "empirical mode decomposition, sequence-to-one transformer algorithm",
        "Key performance indicators": "signal-to-interference plus noise ratio, root mean squared error",
        "Control mechanisms": "interference cancellation scheme",
        "Associated algorithms": "sequence-to-one transformer algorithm",
        "Application and deployment scenarios": "local 6G network, URLLC applications"
      }
    }
  },


  "76": {
    "title": "Multi-Functional RIS Integrated Sensing and Communications for 6G Networks",
    "description": "In this paper, we propose a novel multi-functional reconfigurable intelligent surface (MF-RIS) that supports signal reflection, refraction, amplification, and target sensing simultaneously. Our MF-RIS aims to enhance integrated communication and sensing (ISAC) systems, particularly in multi-user and multi-target scenarios. Equipped with reflection and refraction components (i.e., amplifiers and phase shifters), MF-RIS is able to adjust the amplitude and phase shift of both communication and sensing signals on demand. Additionally, with the assistance of sensing elements, MF-RIS is capable of capturing the echo signals from multiple targets, thereby mitigating the signal attenuation typically associated with multi-hop links. We propose a MF-RIS-enabled multi-user and multi-target ISAC system, and formulate an optimization problem to maximize the signal-to-interference-plus-noise ratio (SINR) of sensing targets. This problem involves jointly optimizing the transmit beamforming and MF-RIS configurations, subject to constraints on the communication rate, total power budget, and MF-RIS coefficients. We decompose the formulated non-convex problem into three sub-problems, and then solve them via an efficient iterative algorithm. Simulation results demonstrate that: 1) The performance of MF-RIS varies under different operating protocols, and energy splitting (ES) exhibits the best performance in the considered MF-RIS-enabled multi-user multi-target ISAC system; 2) Under the same total power budget, the proposed MF-RIS with ES protocol attains 52.2%, 73.5% and 60.86% sensing SINR gains over active RIS, passive RIS, and simultaneously transmitting and reflecting RIS (STAR-RIS), respectively; 3) The number of sensing elements will no longer improve sensing performance after exceeding a certain number.",
    "entities": {
      "0": {
        "entity name": "multi-functional reconfigurable intelligent surface (MF-RIS)",
        "Type": "6G-related technique",
        "Functions": "supports signal reflection, refraction, amplification, and target sensing simultaneously",
        "Benefits": "mitigates signal attenuation typically associated with multi-hop links",
        "Components and sub-systems": "reflection and refraction components (i.e., amplifiers and phase shifters), sensing elements",
        "Key performance indicators": "signal-to-interference-plus-noise ratio (SINR)",
        "Control mechanisms": "jointly optimizing the transmit beamforming and MF-RIS configurations",
        "Associated algorithms": "efficient iterative algorithm",
        "Application and deployment scenarios": "multi-user and multi-target ISAC system"
      }
    }
  },

  "77": {
    "title": "An Open Platform for Simulating the Physical Layer of 6G Communication Systems with Multiple Intelligent Surfaces",
    "description": "Reconfigurable Intelligent Surfaces (RIS) constitute a promising technology that could fulfill the extreme performance and capacity needs of the upcoming 6G wireless networks, by offering software-defined control over wireless propagation phenomena. Despite the existence of many theoretical models describing various aspects of RIS from the signal processing perspective (e.g., channel fading models), there is no open platform to simulate and study their actual physical-layer behavior, especially in the multi-RIS case. In this paper, we develop an open simulation platform, aimed at modeling the physical-layer electromagnetic coupling and propagation between RIS pairs. We present the platform by initially designing a basic unit cell, and then proceeding to progressively model and simulate multiple and larger RISs. The platform can be used for producing verifiable stochastic models for wireless communication in multi-RIS deployments, such as vehicle-to-everything (V2X) communications in autonomous vehicles and cybersecurity schemes, while its code is freely available to the public.",
    "entities": {
      "0": {
        "entity name": "Reconfigurable Intelligent Surfaces (RIS)",
        "Type": "6G-related technique",
        "Functions": "offering software-defined control over wireless propagation phenomena",
        "Application and deployment scenarios": "vehicle-to-everything (V2X) communications in autonomous vehicles and cybersecurity schemes"
      }
    }
  },

  "78": {
    "title": "Federated Analytics for 6G Networks: Applications, Challenges, and Opportunities",
    "description": "Extensive research is underway to meet the hyper-connectivity demands of 6G networks, driven by applications like XR/VR and holographic communications, which generate substantial data requiring network-based processing, transmission, and analysis. However, adhering to diverse data privacy and security policies in the anticipated multi-domain, multi-tenancy scenarios of 6G presents a significant challenge. Federated Analytics (FA) emerges as a promising distributed computing paradigm, enabling collaborative data value generation while preserving privacy and reducing communication overhead. FA applies big data principles to manage and secure distributed heterogeneous networks, improving performance, reliability, visibility, and security without compromising data confidentiality. This paper provides a comprehensive overview of potential FA applications, domains, and types in 6G networks, elucidating analysis methods, techniques, and queries. It explores complementary approaches to enhance privacy and security in 6G networks alongside FA and discusses the challenges and prerequisites for successful FA implementation. Additionally, distinctions between FA and Federated Learning are drawn, highlighting their synergistic potential through a network orchestration scenario.",
    "entities": {
      "0": {
        "entity name": "Federated Analytics (FA)",
        "Type": "6G-related technique",
        "Functions": "enabling collaborative data value generation while preserving privacy and reducing communication overhead",
"Control mechanisms": "distributed",
        "Benefits": "improves performance, reliability, visibility, and security without compromising data confidentiality",
        "Application and deployment scenarios": "multi-domain, multi-tenancy scenarios of 6G"
      }
    }
  },

  "79": {
    "title": "Adversarial Attacks and Defenses in 6G Network-Assisted IoT Systems",
    "description": "The Internet of Things (IoT) and massive IoT systems are key to sixth-generation (6G) networks due to dense connectivity, ultra-reliability, low latency, and high throughput. Artificial intelligence, including deep learning and machine learning, offers solutions for optimizing and deploying cutting-edge technologies for future radio communications. However, these techniques are vulnerable to adversarial attacks, leading to degraded performance and erroneous predictions, outcomes unacceptable for ubiquitous networks. This survey extensively addresses adversarial attacks and defense methods in 6G network-assisted IoT systems. The theoretical background and up-to-date research on adversarial attacks and defenses are discussed. Furthermore, we provide Monte Carlo simulations to validate the effectiveness of adversarial attacks compared to jamming attacks. Additionally, we examine the vulnerability of 6G IoT systems by demonstrating attack strategies applicable to key technologies, including reconfigurable intelligent surfaces, massive multiple-input multiple-output (MIMO)/cell-free massive MIMO, satellites, the metaverse, and semantic communications. Finally, we outline the challenges and future developments associated with adversarial attacks and defenses in 6G IoT systems.",
    "entities": {
      "0": {
        "entity name": "adversarial attacks and defense methods",
        "Type": "6G-related technique",
        "Functions": "optimizing and deploying cutting-edge technologies for future radio communications",
        "Benefits": "validates the effectiveness of adversarial attacks compared to jamming attacks",
        "Application and deployment scenarios": "6G network-assisted IoT systems",
"Associated technologies": "reconfigurable intelligent surfaces, massive multiple-input multiple-output (MIMO), cell-free massive MIMO, satellites, metaverse, semantic communications, Monte Carlo simulations"
      }
    }
  },

  "80": {
    "title": "Patient-centric HetNets Powered by Machine Learning and Big Data Analytics for 6G Networks",
    "description": "Having a cognitive and self-optimizing network that proactively adapts not only to channel conditions, but also according to its users needs can be one of the highest forthcoming priorities of future 6G Heterogeneous Networks (HetNets). In this paper, we introduce an interdisciplinary approach linking the concepts of e-healthcare, priority, big data analytics (BDA) and radio resource optimization in a multi-tier 5G network. We employ three machine learning (ML) algorithms, namely, naive Bayesian (NB) classifier, logistic regression (LR), and decision tree (DT), working as an ensemble system to analyze historical medical records of stroke out-patients (OPs) and readings from body-attached internet-of-things (IoT) sensors to predict the likelihood of an imminent stroke. We convert the stroke likelihood into a risk factor functioning as a priority in a mixed integer linear programming (MILP) optimization model. Hence, the task is to optimally allocate physical resource blocks (PRBs) to HetNet users while prioritizing OPs by granting them high gain PRBs according to the severity of their medical state. Thus, empowering the OPs to send their critical data to their healthcare provider with minimized delay. To that end, two optimization approaches are proposed, a weighted sum rate maximization (WSRMax) approach and a proportional fairness (PF) approach. The proposed approaches increased the OPs average signal to interference plus noise (SINR) by 57% and 95%, respectively. The WSRMax approach increased the system total SINR to a level higher than that of the PF approach, nevertheless, the PF approach yielded higher SINRs for the OPs, better fairness and a lower margin of error.",
    "entities": {
      "0": {
        "entity name": "machine learning (ML) algorithms",
        "Type": "6G-related technique",
        "Functions": "analyze historical medical records of stroke out-patients (OPs) and readings from body-attached internet-of-things (IoT) sensors to predict the likelihood of an imminent stroke",
        "Benefits": "increased the OPs average signal to interference plus noise (SINR) by 57% and 95%",
        "Components and sub-systems": "naive Bayesian (NB) classifier, logistic regression (LR), decision tree (DT)",
        "Key performance indicators": "minimized delay, signal to interference plus noise (SINR)",
        "Associated algorithms": "mixed integer linear programming (MILP) optimization model, weighted sum rate maximization (WSRMax) approach, proportional fairness (PF) approach",
        "Application and deployment scenarios": "multi-tier 5G network, e-healthcare"
      }
    }
  },


  "81": {
    "title": "Airborne Urban Microcells with Grasping End Effectors: A Game Changer for 6G Networks?",
    "description": "Airborne (or flying) base stations (ABSs) embedded on drones or unmanned aerial vehicles (UAVs) can be deemed as a central element of envisioned 6G cellular networks where significant cell densification with mmWave/Terahertz communications will be part of the ecosystem. Nonetheless, one of the key challenges facing the deployment of ABSs is the inherent limited available energy of the drone, which limits the hovering time for serving ground users to the orders of minutes. This impediment deteriorate the performance of the UAV-enabled cellular network and hinders wide adoption and use of the technology. In this paper, we propose robotic airborne base stations (RABSs) with grasping capabilities to increase the serving time of ground users by multiple orders of magnitude compared to nominal hovering based operation. More specifically, to perform the grasping task, the RABS is equipped with a versatile, albeit, general purpose gripper manipulator. Depending on the type of the gripper RABS can provide service in the range of hours, compared to minutes of hovering based ABSs. In theory it is possible that grasping can be energy neutral, hence the time of service can be bounded by the communications energy consumption. To illustrate the case, energy consumption comparison between hovering and grasping is performed in order to reveal the significant benefits of the proposed approach. Finally, overarching challenges, design considerations for RABS, and future avenues of research are outlined to realize the full potential of the proposed robotic aerial base stations.",
    "entities": {
      "0": {
        "entity name": "robotic airborne base stations (RABSs)",
        "Type": "6G-related technique",
        "Functions": "increase the serving time of ground users by multiple orders of magnitude compared to nominal hovering based operation",
        "Benefits": "provides service in the range of hours, compared to minutes of hovering based ABSs",
        "Components and sub-systems": " general purpose gripper manipulator",
        "Application and deployment scenarios": "6G cellular networks",
"Key performance indicators": "energy consumption"
      }
    }
},


  "82": {
    "title": "Towards Cooperative Data Rate Prediction for Future Mobile and Vehicular 6G Networks",
    "description": "Machine learning-based data rate prediction is one of the key drivers for anticipatory mobile networking with applications such as dynamic Radio Access Technology (RAT) selection, opportunistic data transfer, and predictive caching. User Equipment (UE)-based prediction approaches that rely on passive measurements of network quality indicators have successfully been applied to forecast the throughput of vehicular data transmissions. However, the achievable prediction accuracy is limited as the UE is unaware of the current network load. To overcome this issue, we propose a cooperative data rate prediction approach which brings together knowledge from the client and network domains. In a real world proof-of-concept evaluation, we utilize the Software Defined Radio (SDR)-based control channel sniffer FALCON in order to mimic the behavior of a possible network-assisted information provisioning within future 6G networks. The results show that the proposed cooperative prediction approach is able to reduce the average prediction error by up to 30%. With respect to the ongoing standardization efforts regarding the implementation of intelligence for network management, we argue that future 6G networks should go beyond network-focused approaches and actively provide load information to the UEs in order to fuel pervasive machine learning and catalyze UE-based network optimization techniques.",
    "entities": {
      "0": {
        "Entity name": "cooperative data rate prediction",
        "Type": "6G-related technique",
        "Functions": "forecast the throughput of vehicular data transmissions, reduce prediction error",
        "Benefits": "reduce the average prediction error by up to 30%",
        "Components and sub-systems": "Software Defined Radio (SDR)-based control channel sniffer FALCON",
        "Key performance indicators": "prediction accuracy, throughput",
        "Control mechanisms": "network-assisted information provisioning",
        "Application and deployment scenarios": "future 6G networks, anticipatory mobile networking"
      }
    }
  },


  "83": {
    "title": "Toward a Smart Resource Allocation Policy via Artificial Intelligence in 6G Networks: Centralized or Decentralized?",
    "description": "In this paper, we design a new smart software-defined radio access network (RAN) architecture with important properties like flexibility and traffic awareness for sixth generation (6G) wireless networks. In particular, we consider a hierarchical resource allocation framework for the proposed smart soft-RAN model, where the software-defined network (SDN) controller is the first and foremost layer of the framework. This unit dynamically monitors the network to select a network operation type on the basis of distributed or centralized resource allocation architectures to perform decision-making intelligently. In this paper, our aim is to make the network more scalable and more flexible in terms of achievable data rate, overhead, and complexity indicators. To this end, we introduce a new metric, throughput overhead complexity (TOC), for the proposed machine learning-based algorithm, which makes a trade-off between these performance indicators. In particular, the decision making based on TOC is solved via deep reinforcement learning (DRL), which determines an appropriate resource allocation policy. Furthermore, for the selected algorithm, we employ the soft actor-critic method, which is more accurate, scalable, and robust than other learning methods. Simulation results demonstrate that the proposed smart network achieves better performance in terms of TOC compared to fixed centralized or distributed resource management schemes that lack dynamism. Moreover, our proposed algorithm outperforms conventional learning methods employed in other state-of-the-art network designs.",
    "entities": {
      "0": {
        "Entity name": "smart soft-RAN model",
        "Type": "6G-related technique",
        "Functions": "dynamic resource allocation, decision-making intelligently",
        "Benefits": "more scalable and more flexible in terms of achievable data rate, overhead, and complexity",
        "Components and sub-systems": "software-defined network (SDN) controller",
        "Key performance indicators": "throughput overhead complexity (TOC)",
        "Control mechanisms": "distributed or centralized resource allocation architectures",
        "Associated algorithms": "deep reinforcement learning (DRL), soft actor-critic method",
        "Application and deployment scenarios": "sixth generation (6G) wireless networks"
      }
    }
  },


  "84": {
    "title": "HAPS for 6G Networks: Potential Use Cases, Open Challenges, and Possible Solutions",
    "description": "High altitude platform station (HAPS), which is deployed in the stratosphere at an altitude of 20-50 kilometres, has attracted much attention in recent years due to their large footprint, line-of-sight links, and fixed position relative to the Earth. Compared with existing network infrastructure, HAPS has a much larger coverage area than terrestrial base stations and is much closer than satellites to the ground users. Besides small-cells and macro-cells, a HAPS can offer one mega-cell, which can complement legacy networks in 6G and beyond wireless systems. This paper explores potential use cases and discusses relevant open challenges of integrating HAPS into legacy networks, while also suggesting some solutions to these challenges. The cumulative density functions of spectral efficiency of the integrated network and cell-edge users are studied and compared with terrestrial network. The results show the capacity gains achieved by the integrated network are beneficial to cell-edge users. Furthermore, the advantages of a HAPS for backhauling aerial base stations are demonstrated by the simulation results.",
    "entities": {
      "0": {
        "Entity name": "High altitude platform station (HAPS)",
        "Type": "6G-related technique",
        "Functions": "large footprint, line-of-sight links, and fixed position relative to the Earth",
        "Benefits": "complement legacy networks in 6G and beyond wireless systems",
        "Components and sub-systems": "mega-cell",
        "Application and deployment scenarios": "stratosphere at an altitude of 20-50 kilometres",
        "Associated technologies": "terrestrial base stations, satellites"
      }
    }
  },

  "85": {
    "title": "Evolution of 3GPP Standards Towards True Extended Reality (XR) Support in 6G Networks",
    "description": "Extended reality (XR) is a key innovation of 5G-advanced and beyond networks. The diverse XR use-cases, including virtual reality, augmented reality, and mixed reality, transform the way humans interact with surrounding environments. Thus, XR technology enables true immersive experiences of novel services spanning, e.g., e-commerce, healthcare, and education, respectively. However, the efficient support of XR services over existing and future cellular systems is highly challenging and requires multiple radio design improvements, due to the unique XR traffic and performance characteristics. Thus, this article surveys the state-of-art 3GPP standardization activities (release-18) for integrating the XR service class into the 5G-advanced specifications, highlighting the major XR performance challenges. Furthermore, the paper introduces valuable insights and research directions for supporting true XR services over the next-generation 6G networks, where multiple novel radio design mindsets and protocol enhancements are proposed and evaluated using extensive system level simulations, including solutions for application-native dynamic performance reporting, traffic-dependent control channel design, collaborative device aggregation for XR capacity boosting and offload, respectively.",
    "entities": {
      "0": {
        "entity name": "Extended reality (XR)",
        "Type": "6G-related technique",
        "Functions": "key innovation of 5G-advanced and beyond networks, transforms the way humans interact with surrounding environments",
        "Benefits": "enables true immersive experiences of novel services",
        "Application and deployment scenarios": "e-commerce, healthcare, and education"
      },
      "1": {
        "entity name": "XR service class",
        "Type": "6G-related technique",
        "Functions": "integrating the XR service class into the 5G-advanced specifications",
        "Associated algorithms": "application-native dynamic performance reporting, traffic-dependent control channel design, collaborative device aggregation for XR capacity boosting and offload"
      }
    }
  },

  "86": {
    "title": "Toward Intelligent and Efficient 6G Networks: JCSC Enabled On-Purpose Machine Communications",
    "description": "Driven by the vision of \"intelligent connection of everything\" toward 6G, the collective intelligence of networked machines can be fully exploited to improve system efficiency by shifting the paradigm of wireless communication design from naive maximalist approaches to intelligent value-based approaches. In this article, we propose an on-purpose machine communication framework enabled by joint communication, sensing, and computation (JCSC) technology, which employs machine semantics as the interactive information flow. Naturally, there are potential technical barriers to be solved before the widespread adoption of on-purpose communications, including the conception of machine purpose, fast and concise networking strategy, and semantics-aware information exchange mechanism during the process of task-oriented cooperation. Hence, we discuss enabling technologies complemented by a range of open challenges. The simulation result shows that the proposed framework can significantly reduce networking overhead and improve communication efficiency.",
    "entities": {
      "0": {
        "Entity name": "on-purpose machine communication framework",
        "Type": "6G-related technique",
        "Functions": "improve system efficiency, reduce networking overhead",
        "Benefits": "improve communication efficiency",
        "Components and sub-systems": "joint communication, sensing, and computation (JCSC) technology",
        "Application and deployment scenarios": "6G networks, task-oriented cooperation",
"Associated technologies": "machine semantics"
      }
    }
  },


  "87": {
    "title": "GainNet: Coordinates the Odd Couple of Generative AI and 6G Networks",
    "description": "The rapid expansion of AI-generated content (AIGC) reflects the iteration from assistive AI towards generative AI (GAI) with creativity. Meanwhile, the 6G networks will also evolve from the Internet-of-everything to the Internet-of-intelligence with hybrid heterogeneous network architectures. In the future, the interplay between GAI and the 6G will lead to new opportunities, where GAI can learn the knowledge of personalized data from the massive connected 6G end devices, while GAI's powerful generation ability can provide advanced network solutions for 6G network and provide 6G end devices with various AIGC services. However, they seem to be an odd couple, due to the contradiction of data and resources. To achieve a better-coordinated interplay between GAI and 6G, the GAI-native networks (GainNet), a GAI-oriented collaborative cloud-edge-end intelligence framework, is proposed in this paper. By deeply integrating GAI with 6G network design, GainNet realizes the positive closed-loop knowledge flow and sustainable-evolution GAI model optimization. On this basis, the GAI-oriented generic resource orchestration mechanism with integrated sensing, communication, and computing (GaiRom-ISCC) is proposed to guarantee the efficient operation of GainNet. Two simple case studies demonstrate the effectiveness and robustness of the proposed schemes. Finally, we envision the key challenges and future directions concerning the interplay between GAI models and 6G networks.",
    "entities": {
      "0": {
        "Entity name": "GAI-native networks (GainNet)",
        "Type": "6G-related technique",
        "Functions": "integrate GAI with 6G network design, provide advanced network solutions",
        "Benefits": "realize positive closed-loop knowledge flow, sustainable-evolution GAI model optimization",
        "Components and sub-systems": "GAI-oriented collaborative cloud-edge-end intelligence framework, GaiRom-ISCC",
        "Application and deployment scenarios": "6G networks, AI-generated content (AIGC) services"
      }
    }
  },


  "88": {
    "title": "Towards Practical Cell-Free 6G Network Deployments: An Open-Source End-to-End Ray Tracing Simulator",
    "description": "The advent of 6G wireless communication marks a transformative era in technological connectivity, bringing forth challenges and opportunities alike. This paper unveils an innovative, open-source simulator, meticulously crafted for cell-free 6G wireless networks. This simulator is not just a tool but a gateway to the future, blending cutting-edge channel models with the simulation of both physical propagation effects and intricate system-level protocols. It stands at the forefront of technological advancement by integrating LIS and MIMO technologies, harnessing the power of the Unity game engine for efficient ray-tracing and GPU-accelerated computations. The unparalleled flexibility in scenario configuration, coupled with its unique ability to dynamically simulate interactions across network layers, establishes this simulator as an indispensable asset in pioneering &G systems' research and development.",
    "entities": {
      "0": {
        "Entity name": "cell-free 6G wireless network simulator",
        "Type": "6G-related technique",
        "Functions": "simulate physical propagation effects, system-level protocols",
        "Benefits": "unparalleled flexibility in scenario configuration, dynamic simulation of interactions across network layers",
        "Components and sub-systems": "LIS and MIMO technologies, Unity game engine, GPU-accelerated computations",
        "Application and deployment scenarios": "6G wireless networks, research and development"
      }
    }
  },

  "89": {
    "title": "BostonTwin: the Boston Digital Twin for Ray-Tracing in 6G Networks",
    "description": "Digital twins are now a staple of wireless networks design and evolution. Creating an accurate digital copy of a real system offers numerous opportunities to study and analyze its performance and issues. It also allows designing and testing new solutions in a risk-free environment, and applying them back to the real system after validation. A candidate technology that will heavily rely on digital twins for design and deployment is 6G, which promises robust and ubiquitous networks for eXtended Reality (XR) and immersive communications solutions. In this paper, we present BostonTwin, a dataset that merges a high-fidelity 3D model of the city of Boston, MA, with the existing geospatial data on cellular base stations deployments, in a ray-tracing-ready format. Thus, BostonTwin enables not only the instantaneous rendering and programmatic access to the building models, but it also allows for an accurate representation of the electromagnetic propagation environment in the real-world city of Boston. The level of detail and accuracy of this characterization is crucial to designing 6G networks that can support the strict requirements of sensitive and high-bandwidth applications, such as XR and immersive communication.",
    "entities": {
      "0": {
        "Entity name": "BostonTwin",
        "Type": "6G-related technique",
        "Functions": "enable accurate representation of electromagnetic propagation, support high-bandwidth applications",
        "Benefits": "design and test solutions in a risk-free environment, support XR and immersive communication",
        "Components and sub-systems": "high-fidelity 3D model, geospatial data on cellular base stations",
        "Application and deployment scenarios": "6G networks, eXtended Reality (XR), immersive communications"
      }
    }
  },



  "90": {
    "title": "RAN Functional Split Options for Integrated Terrestrial and Non-Terrestrial 6G Networks",
    "description": "Leveraging non-terrestrial platforms in 6G networks holds immense significance as it opens up opportunities to expand network coverage, enhance connectivity, and support a wide range of innovative applications, including global-scale Internet of Things and ultra-high-definition content delivery. To accomplish the seamless integration between terrestrial and non-terrestrial networks, substantial changes in radio access network (RAN) architecture are required. These changes involve the development of new RAN solutions that can efficiently manage the diverse characteristics of both terrestrial and non-terrestrial components, ensuring smooth handovers, resource allocation, and quality of service across the integrated network ecosystem. Additionally, the establishment of robust interconnection and communication protocols between terrestrial and non-terrestrial elements will be pivotal to utilize the full potential of 6G technology. Additionally, innovative approaches have been introduced to split the functionalities within the RAN into centralized and distributed domains. These novel paradigms are designed to enhance RAN's flexibility while simultaneously lowering the costs associated with infrastructure deployment, all while ensuring that the quality of service for end-users remains unaffected. In this work, we provide an extensive examination of various Non-Terrestrial Networks (NTN) architectures and the necessary adaptations required on the existing 5G RAN architecture to align with the distinct attributes of NTN. Of particular significance, we emphasize the crucial RAN functional split choices essential for the seamless integration of terrestrial and non-terrestrial components within advanced 6G networks.",
    "entities": {
      "0": {
        "entity name": "RAN functional split",
        "Type": "6G-related technique",
        "Functions": "split the functionalities within the RAN into centralized and distributed domains",
        "Benefits": "enhance RAN's flexibility, lower the costs associated with infrastructure deployment, ensure quality of service for end-users",
        "Control mechanisms": "centralized and distributed domains",
        "Application and deployment scenarios": "integrated terrestrial and non-terrestrial 6G networks"
      },
      "1": {
        "entity name": "Non-Terrestrial Networks (NTN)",
        "Type": "6G-related technique",
        "Functions": "expand network coverage, enhance connectivity, support global-scale Internet of Things and ultra-high-definition content delivery",
        "Benefits": "seamless integration between terrestrial and non-terrestrial networks",
        "Application and deployment scenarios": "integrated terrestrial and non-terrestrial 6G networks"
      }
    }
  },

  "91": {
    "title": "Novel Methods for Load Estimation in Cell Switching in HAPS-Assisted Sustainable 6G Networks",
    "description": "In the evolving landscape of vertical heterogeneous networks, the practice of cell switching particularly for small base stations faces a significant challenge due to the lack of accurate data on the traffic load of sleeping SBSs. This information gap is crucial as it hinders the feasibility and applicability of existing power consumption optimization methods; however, the studies in the literature predominantly assume perfect knowledge about the traffic load of sleeping SBSs. Addressing this critical issue, our study introduces innovative methodologies for estimating the traffic load of sleeping SBSs in a vHetNet including the integration of a high altitude platform as a super macro base station into the terrestrial network. We propose three distinct spatial interpolation-based estimation schemes: clustering-based, distance based, and random neighboring selection. Employing a real data set for empirical validations, we compare the estimation performance of the developed traffic load estimation schemes and assess the impact of estimation errors. Our findings demonstrate that accurate estimation of sleeping SBSs' traffic loads is essential for making network power consumption optimization methods both feasible and applicable in vHetNets.",
    "entities": {
      "0": {
        "entity name": "traffic load estimation",
        "Type": "6G-related technique",
        "Functions": "estimating the traffic load of sleeping SBSs",
        "Benefits": "make network power consumption optimization methods feasible and applicable",
        "Components and sub-systems": "small base stations (SBSs), high altitude platform, super macro base station",
        "Associated algorithms": "clustering-based, distance-based, random neighboring selection",
        "Application and deployment scenarios": "vertical heterogeneous networks (vHetNets)"
      }
    }
  },

  "92": {
    "title": "Uncrewed Vehicles in 6G Networks: A Unifying Treatment of Problems, Formulations, and Tools",
    "description": "Uncrewed Vehicles (UVs) functioning as autonomous agents are anticipated to play a crucial role in the 6th Generation of wireless networks. Their seamless integration, cost-effectiveness, and the additional controllability through motion planning make them an attractive deployment option for a wide range of applications, both as assets in the network (e.g., mobile base stations) and as consumers of network services (e.g., autonomous delivery systems). However, despite their potential, the convergence of UVs and wireless systems brings forth numerous challenges that require attention from both academia and industry. This paper then aims to offer a comprehensive overview encompassing the transformative possibilities as well as the significant challenges associated with UV-assisted next-generation wireless communications. Considering the diverse landscape of possible application scenarios, problem formulations, and mathematical tools related to UV-assisted wireless systems, the underlying core theme of this paper is the unification of the problem space, providing a structured framework to understand the use cases, problem formulations, and necessary mathematical tools. Overall, the paper sets forth a clear understanding of how uncrewed vehicles can be integrated in the 6G ecosystem, paving the way towards harnessing the full potential at this intersection.",
    "entities": {
      "0": {
        "entity name": "Uncrewed Vehicles (UVs)",
        "Type": "6G-related technique",
        "Functions": "functioning as autonomous agents, mobile base stations, consumers of network services",
        "Benefits": "seamless integration, cost-effectiveness, additional controllability through motion planning",
        "Application and deployment scenarios": "6G networks, autonomous delivery systems"
      }
    }
  },

  "93": {
    "title": "Addressing the Load Estimation Problem: Cell Switching in HAPS-Assisted Sustainable 6G Networks",
    "description": "This study aims to introduce and address the problem of traffic load estimation in the cell switching concept within the evolving landscape of vertical heterogeneous networks (vHetNets). The problem is that the practice of cell switching faces a significant challenge due to the lack of accurate data on the traffic load of sleeping small base stations (SBSs). This problem makes the majority of the studies in the literature, particularly those employing load-dependent approaches, impractical due to their basic assumption of perfect knowledge of the traffic loads of sleeping SBSs for the next time slot. Rather than developing another advanced cell switching algorithm, this study investigates the impacts of estimation errors and explores possible solutions through established methodologies in a novel vHetNet environment that includes the integration of a high altitude platform (HAPS) as a super macro base station (SMBS) into the terrestrial network. In other words, this study adopts a more foundational perspective, focusing on eliminating a significant obstacle for the application of advanced cell switching algorithms. To this end, we explore the potential of three distinct spatial interpolation-based estimation schemes: random neighboring selection, distance-based selection, and clustering-based selection. Utilizing a real dataset for empirical validations, we evaluate the efficacy of our proposed traffic load estimation schemes. Our results demonstrate that the multi-level clustering (MLC) algorithm performs exceptionally well, with an insignificant difference (i.e., 0.8%) observed between its estimated and actual network power consumption, highlighting its potential to significantly improve energy efficiency in vHetNets.",
    "entities": {
      "0": {
        "entity name": "traffic load estimation",
        "Type": "6G-related technique",
        "Functions": "estimating the traffic load of sleeping SBSs",
        "Benefits": "improve energy efficiency in vHetNets",
        "Components and sub-systems": "small base stations (SBSs), high altitude platform (HAPS), super macro base station (SMBS)",
        "Associated algorithms": "multi-level clustering (MLC), random neighboring selection, distance-based selection, clustering-based selection",
        "Application and deployment scenarios": "vertical heterogeneous networks (vHetNets)"
      }
    }
  },


  "94": {
    "title": "When Large Language Model Agents Meet 6G Networks: Perception, Grounding, and Alignment",
    "description": "AI agents based on multimodal large language models (LLMs) are expected to revolutionize human-computer interaction and offer more personalized assistant services across various domains like healthcare, education, manufacturing, and entertainment. Deploying LLM agents in 6G networks enables users to access previously expensive AI assistant services via mobile devices democratically, thereby reducing interaction latency and better preserving user privacy. Nevertheless, the limited capacity of mobile devices constrains the effectiveness of deploying and executing local LLMs, which necessitates offloading complex tasks to global LLMs running on edge servers during long-horizon interactions. In this article, we propose a split learning system for LLM agents in 6G networks leveraging the collaboration between mobile devices and edge servers, where multiple LLMs with different roles are distributed across mobile devices and edge servers to perform user-agent interactive tasks collaboratively. In the proposed system, LLM agents are split into perception, grounding, and alignment modules, facilitating inter-module communications to meet extended user requirements on 6G network functions, including integrated sensing and communication, digital twins, and task-oriented communications. Furthermore, we introduce a novel model caching algorithm for LLMs within the proposed system to improve model utilization in context, thus reducing network costs of the collaborative mobile and edge LLM agents.",
    "entities": {
      "0": {
        "entity name": "split learning system for LLM agents",
        "Type": "6G-related technique",
        "Functions": "split into perception, grounding, and alignment modules, facilitate inter-module communications",
        "Benefits": "reduce interaction latency, preserve user privacy, reduce network costs",
        "Components and sub-systems": "mobile devices, edge servers",
        "Associated algorithms": "model caching algorithm",
        "Application and deployment scenarios": "6G networks, healthcare, education, manufacturing, entertainment"
      },
"1": {
        "entity name": "novel model caching algorithm for LLMs",
        "Type": "6G-related technique",
        "Functions": "improve model utilization in context",
        "Benefits": "reducing network costs of the collaborative mobile and edge LLM agents"
      }
    }
  },


  "95": {
    "title": "Near-field orthogonality and cosine beams for near-field space division multiple access in 6G communications and beyond",
    "description": "Spatial division multiple access (SDMA), a powerful method routinely applied in multi-user multiple-input multiple-output (MIMO) communications, relies on the angular orthogonality of beams in the far field, to distinguish multiple users at different angles. Yet, with the gradual shift of wireless connectivity to the near-field of large radiating apertures, the applicability of classical SDMA becomes questionable. Therefore, to enable near-field multiple access, it is necessary to design beams that have the desired orthogonality in the near-field. In this work, we propose the concept of near-field space division multiple access (NF-SDMA), to enable SDMA in the near-field. We demonstrate analytically that the orthogonality of beams is preserved at any location of the receiver, from the near-field to the far-field of the transmitter. By judicious design, we select the family of cosine beams and we prove that they satisfy the orthogonality condition, offering a multitude of communication modes in the near-field. We demonstrate how the correlation of beams generated with uniform linear arrays (ULAs) is extended to uniform planar arrays (UPAs) in a straightforward and insightful manner. To test our analytical findings, we propagate the designed beams numerically, and we measure their orthogonality both at the transmitter and the receiver. We verify that the orthogonality of the proposed beams is successfully retrieved at a receiver that resides in the near-field of the transmitter, and is also robust to displacements of the receiver. Based on our findings, we propose codebook designs for NF-SDMA that are applicable for receivers with many elements and even with single antennas.",
    "entities": {
      "0": {
        "entity name": "near-field space division multiple access (NF-SDMA)",
        "Type": "6G-related technique",
        "Functions": "enable SDMA in the near-field, design beams with desired orthogonality in the near-field",
        "Benefits": "preserve orthogonality of beams at any location of the receiver, robust to displacements of the receiver",
        "Components and sub-systems": "uniform linear arrays (ULAs), uniform planar arrays (UPAs)",
        "Application and deployment scenarios": "6G communications and beyond"
      }
    }
  },

  "96": {
    "title": "AIaaS for ORAN-based 6G Networks: Multi-time Scale Slice Resource Management with DRL",
    "description": "This paper addresses how to handle slice resources for 6G networks at different time scales in an architecture based on an open radio access network (ORAN). The proposed solution includes artificial intelligence (AI) at the edge of the network and applies two control-level loops to obtain optimal performance compared to other techniques. The ORAN facilitates programmable network architectures to support such multi-time scale management using AI approaches. The proposed algorithms analyze the maximum utilization of resources from slice performance to take decisions at the inter-slice level. Inter-slice intelligent agents work at a non-real-time level to reconfigure resources within various slices. Further than meeting the slice requirements, the intra-slice objective must also include the minimization of maximum resource utilization. This enables smart utilization of the resources within each slice without affecting slice performance. Here, each xApp that is an intra-slice agent aims at meeting the optimal quality of service (QoS) of the users, but at the same time, some inter-slice objectives should be included to coordinate intra- and inter-slice agents. This is done without penalizing the main intra-slice objective. All intelligent agents use deep reinforcement learning (DRL) algorithms to meet their objectives. We have presented results for enhanced mobile broadband (eMBB), ultra-reliable low latency (URLLC), and massive machine type communication (mMTC) slice categories.",
    "entities": {
      "0": {
        "entity name": "multi-time scale slice resource management",
        "Type": "6G-related technique",
        "Functions": "handle slice resources for 6G networks at different time scales, reconfigure resources within various slices",
        "Benefits": "smart utilization of resources within each slice without affecting slice performance",
        "Components and sub-systems": "inter-slice intelligent agents, intra-slice agents (xApps)",
        "Associated algorithms": "deep reinforcement learning (DRL)",
        "Application and deployment scenarios": "ORAN-based 6G networks, enhanced mobile broadband (eMBB), ultra-reliable low latency (URLLC), massive machine type communication (mMTC)"
      }
    }
  },

  "97": {
    "title": "Joint Radar Sensing, Location, and Communication Resources Optimization in 6G Network",
    "description": "The possibility of jointly optimizing location sensing and communication resources, facilitated by the existence of communication and sensing spectrum sharing, is what promotes the system performance to a higher level. However, the rapid mobility of user equipment (UE) can result in inaccurate location estimation, which can severely degrade system performance. Therefore, the precise UE location sensing and resource allocation issues are investigated in a spectrum sharing sixth generation network. An approach is proposed for joint subcarrier and power optimization based on UE location sensing, aiming to minimize system energy consumption. The joint allocation process is separated into two key phases of operation. In the radar location sensing phase, the multipath interference and Doppler effects are considered simultaneously, and the issues of UE's location and channel state estimation are transformed into a convex optimization problem, which is then solved through gradient descent. In the communication phase, a subcarrier allocation method based on subcarrier weights is proposed. To further minimize system energy consumption, a joint subcarrier and power allocation method is introduced, resolved via the Lagrange multiplier method for the non-convex resource allocation problem. Simulation analysis results indicate that the location sensing algorithm exhibits a prominent improvement in accuracy compared to benchmark algorithms. Simultaneously, the proposed resource allocation scheme also demonstrates a substantial enhancement in performance relative to baseline schemes.",
    "entities": {
      "0": {
        "entity name": "joint radar sensing, location, and communication resources optimization",
        "Type": "6G-related technique",
        "Functions": "jointly optimize location sensing and communication resources, minimize system energy consumption",
        "Benefits": "improve accuracy of location sensing, enhance performance of resource allocation",
        "Components and sub-systems": "user equipment (UE)",
        "Associated algorithms": "gradient descent, Lagrange multiplier method",
        "Application and deployment scenarios": "spectrum sharing sixth generation network"
      }
    }
  },

  "98": {
    "title": "Explainable and Robust Millimeter Wave Beam Alignment for AI-Native 6G Networks",
    "description": "Integrated artificial intelligence (AI) and communication has been recognized as a key pillar of 6G and beyond networks. In line with AI-native 6G vision, explainability and robustness in AI-driven systems are critical for establishing trust and ensuring reliable performance in diverse and evolving environments. This paper addresses these challenges by developing a robust and explainable deep learning (DL)-based beam alignment engine (BAE) for millimeter-wave (mmWave) multiple-input multiple-output (MIMO) systems. The proposed convolutional neural network (CNN)-based BAE utilizes received signal strength indicator (RSSI) measurements over a set of wide beams to accurately predict the best narrow beam for each UE, significantly reducing the overhead associated with exhaustive codebook-based narrow beam sweeping for initial access (IA) and data transmission. To ensure transparency and resilience, the Deep k-Nearest Neighbors (DkNN) algorithm is employed to assess the internal representations of the network via nearest neighbor approach, providing human-interpretable explanations and confidence metrics for detecting out-of-distribution inputs. Experimental results demonstrate that the proposed DL-based BAE exhibits robustness to measurement noise, reduces beam training overhead by 75% compared to the exhaustive search while maintaining near-optimal performance in terms of spectral efficiency. Moreover, the proposed framework improves outlier detection robustness by up to 5x and offers clearer insights into beam prediction decisions compared to traditional softmax-based classifiers.",
    "entities": {
      "0": {
        "entity name": "deep learning (DL)-based beam alignment engine (BAE)",
        "Type": "6G-related technique",
        "Functions": "predict the best narrow beam for each UE, significantly reducing the overhead associated with exhaustive codebook-based narrow beam sweeping for initial access (IA) and data transmission",
        "Benefits": "robustness to measurement noise, reduces beam training overhead by 75%, improves outlier detection robustness by up to 5x",
        "Components and sub-systems": "convolutional neural network (CNN), Deep k-Nearest Neighbors (DkNN) algorithm",
        "Key performance indicators": "spectral efficiency",
        "Operating frequency": "millimeter-wave (mmWave)",
        "Associated algorithms": "Deep k-Nearest Neighbors (DkNN)",
        "Application and deployment scenarios": "millimeter-wave (mmWave) multiple-input multiple-output (MIMO) systems"
      },
 "1": {
        "entity name": "Deep k-Nearest Neighbors (DkNN) algorithm",
        "Type": "6G-related technique",
        "Functions": "assess the internal representations of the network via nearest neighbor approach",
        "Benefits": "providing human-interpretable explanations and confidence metrics for detecting out-of-distribution inputs"
      }
    }
  },


  "99": {
    "title": "MEET: Mobility-Enhanced Edge inTelligence for Smart and Green 6G Networks",
    "description": "Edge intelligence is an emerging paradigm for real-time training and inference at the wireless edge, thus enabling mission-critical applications. Accordingly, base stations (BSs) and edge servers (ESs) need to be densely deployed, leading to huge deployment and operation costs, in particular the energy costs. In this article, we propose a new framework called Mobility-Enhanced Edge inTelligence (MEET), which exploits the sensing, communication, computing, and self-powering capabilities of intelligent connected vehicles for the smart and green 6G networks. Specifically, the operators can incorporate infrastructural vehicles as movable BSs or ESs, and schedule them in a more flexible way to align with the communication and computation traffic fluctuations. Meanwhile, the remaining compute resources of opportunistic vehicles are exploited for edge training and inference, where mobility can further enhance edge intelligence by bringing more compute resources, communication opportunities, and diverse data. In this way, the deployment and operation costs are spread over the vastly available vehicles, so that the edge intelligence is realized cost-effectively and sustainably. Furthermore, these vehicles can be either powered by renewable energy to reduce carbon emissions, or charged more flexibly during off-peak hours to cut electricity bills.",
    "entities": {
      "0": {
        "entity name": "Mobility-Enhanced Edge inTelligence (MEET)",
        "Type": "6G-related technique",
        "Functions": "exploits the sensing, communication, computing, and self-powering capabilities of intelligent connected vehicles",
        "Benefits": "realizes edge intelligence cost-effectively and sustainably, reduces carbon emissions, cuts electricity bills",
        "Components and sub-systems": "base stations (BSs), edge servers (ESs), intelligent connected vehicles",
        "Application and deployment scenarios": "smart and green 6G networks"
      }
    }
  },

  "100": {
    "title": "Improving Physical Layer Security for Reconfigurable Intelligent Surface aided NOMA 6G Networks",
    "description": "The intrinsic integration of the nonorthogonal multiple access (NOMA) and reconfigurable intelligent surface (RIS) techniques is envisioned to be a promising approach to significantly improve both the spectrum efficiency and energy efficiency for future wireless communication networks. In this paper, the physical layer security (PLS) for a RIS-aided NOMA 6G networks is investigated, in which a RIS is deployed to assist the two \"dead zone\" NOMA users and both internal and external eavesdropping are considered. For the scenario with only internal eavesdropping, we consider the worst case that the near-end user is untrusted and may try to intercept the information of far-end user. A joint beamforming and power allocation sub-optimal scheme is proposed to improve the system PLS. Then we extend our work to a scenario with both internal and external eavesdropping. Two sub-scenarios are considered in this scenario: one is the sub-scenario without channel state information (CSI) of eavesdroppers, and another is the sub-scenario where the eavesdroppers' CSI are available. For the both sub-scenarios, a noise beamforming scheme is introduced to be against the external eavesdroppers. An optimal power allocation scheme is proposed to further improve the system physical security for the second sub-scenario. Simulation results show the superior performance of the proposed schemes. Moreover, it has also been shown that increasing the number of reflecting elements can bring more gain in secrecy performance than that of the transmit antennas.",
    "entities": {
      "0": {
        "entity name": "reconfigurable intelligent surface (RIS)",
        "Type": "6G-related technique",
        "Functions": "assist the two \"dead zone\" NOMA users, improve physical layer security (PLS)",
        "Benefits": "improves spectrum efficiency and energy efficiency, enhances secrecy performance",
        "Components and sub-systems": "reflecting elements",
        "Key performance indicators": "secrecy performance",
        "Control mechanisms": "joint beamforming and power allocation",
        "Application and deployment scenarios": "RIS-aided NOMA 6G networks"
      },
      "1": {
        "entity name": "nonorthogonal multiple access (NOMA)",
        "Type": "6G-related technique",
        "Functions": "improve spectrum efficiency and energy efficiency",
        "Benefits": "enhances physical layer security (PLS)",
        "Application and deployment scenarios": "RIS-aided NOMA 6G networks"
      }
    }
  },

  "101": {
    "title": "Edge Semantic Cognitive Intelligence for 6G Networks: Novel Theoretical Models, Enabling Framework, and Typical Applications",
    "description": "Edge intelligence is anticipated to underlay the pathway to connected intelligence for 6G networks, but the organic confluence of edge computing and artificial intelligence still needs to be carefully treated. To this end, this article discusses the concepts of edge intelligence from the semantic cognitive perspective. Two instructive theoretical models for edge semantic cognitive intelligence (ESCI) are first established. Afterwards, the ESCI framework orchestrating deep learning with semantic communication is discussed. Two representative applications are present to shed light on the prospect of ESCI in 6G networks. Some open problems are finally listed to elicit the future research directions of ESCI.",
    "entities": {
      "0": {
        "entity name": "edge semantic cognitive intelligence (ESCI)",
        "Type": "6G-related technique",
        "Functions": "orchestrates deep learning with semantic communication",
        "Benefits": "underlays the pathway to connected intelligence for 6G networks",
        "Application and deployment scenarios": "6G networks",
"Associated technologies": "semantic communication, deep learning"
      }
    }
  },

  "102": {
    "title": "Cooperative Backscatter NOMA with Imperfect SIC: Towards Energy Efficient Sum Rate Maximization in Sustainable 6G Networks",
    "description": "The combination of backscatter communication with non-orthogonal multiple access (NOMA) has the potential to support low-powered massive connections in upcoming sixth-generation (6G) wireless networks. More specifically, backscatter communication can harvest and use the existing RF signals in the atmosphere for communication, while NOMA provides communication to multiple wireless devices over the same frequency and time resources. This paper has proposed a new resource management framework for backscatter-aided cooperative NOMA communication in upcoming 6G networks. In particular, the proposed work has simultaneously optimized the base station's transmit power, relaying node, the reflection coefficient of the backscatter tag, and time allocation under imperfect successive interference cancellation to maximize the sum rate of the system. To obtain an efficient solution for the resource management framework, we have proposed a combination of the bisection method and dual theory, where the sub-gradient method is adopted to optimize the Lagrangian multipliers. Numerical results have shown that the proposed solution provides excellent performance. When the performance of the proposed technique is compared to a brute-forcing search technique that guarantees optimal solution however, is very time-consuming, it was seen that the gap in performance is actually 0\\%. Hence, the proposed framework has provided performance equal to a cumbersome brute-force search technique while offering much less complexity. The works in the literature on cooperative NOMA considered equal time distribution for cooperation and direct communication. Our results showed that optimizing the time-division can increase the performance by more than 110\\% for high transmission powers.",
    "entities": {
      "0": {
        "entity name": "backscatter communication",
        "Type": "6G-related technique",
        "Functions": "harvest and use the existing RF signals in the atmosphere for communication",
        "Benefits": "supports low-powered massive connections, maximizes sum rate of the system",
        "Application and deployment scenarios": "backscatter-aided cooperative NOMA communication in upcoming 6G networks"
      },
      "1": {
        "entity name": "non-orthogonal multiple access (NOMA)",
        "Type": "6G-related technique",
        "Functions": "provides communication to multiple wireless devices over the same frequency and time resources",
        "Benefits": "maximizes sum rate of the system",
        "Application and deployment scenarios": "backscatter-aided cooperative NOMA communication in upcoming 6G networks"
      }
    }
  },

  "103": {
    "title": "Dual Gradient Descent EMF-Aware MU-MIMO Beamforming in RIS-Aided 6G Networks",
    "description": "Reconfigurable Intelligent Surface (RIS) is one of the key technologies for the upcoming 6th Generation (6G) communications, which can improve the signal strength at the receivers by adding artificial propagation paths. In the context of Downlink (DL) Multi-User Multiple-Input Multiple-Output (MU-MIMO) communications, designing an appropriate Beamforming (BF) scheme to take full advantage of this reconfigured propagation environment and improve the network capacity is a major challenge. Due to the spatial dimension provided by MIMO systems, independent data streams can be transmitted to multiple users simultaneously on the same radio resources. It is important to note that serving the same subset of users over a period of time may lead to undesired areas where the average Electromagnetic Field Exposure (EMFE) exceeds regulatory limits. To address this challenge, in this paper, we propose a Dual Gradient Descent (Dual-GD)-based Electromagnetic Field (EMF)-aware MU-MIMO BF scheme that aims to optimize the overall capacity under EMFE constraints in RIS-aided 6G cellular networks.",
    "entities": {
      "0": {
        "entity name": "Reconfigurable Intelligent Surface (RIS)",
        "Type": "6G-related technique",
        "Functions": "improve the signal strength at the receivers by adding artificial propagation paths",
        "Benefits": "optimizes overall capacity under EMFE constraints",
        "Application and deployment scenarios": "RIS-aided 6G cellular networks"
      },
      "1": {
        "entity name": "Dual Gradient Descent (Dual-GD)-based Electromagnetic Field (EMF)-aware MU-MIMO Beamforming",
        "Type": "6G-related technique",
        "Functions": "optimize the overall capacity under EMFE constraints",
        "Benefits": "improves network capacity",
        "Application and deployment scenarios": "RIS-aided 6G cellular networks"
      }
    }
  },

  "104": {
    "title": "Understand-Before-Talk (UBT): A Semantic Communication Approach to 6G Networks",
    "description": "In Shannon theory, semantic aspects of communication were identified but considered irrelevant to the technical communication problems. Semantic communication (SC) techniques have recently attracted renewed research interests in (6G) wireless because they have the capability to support an efficient interpretation of the significance and meaning intended by a sender (or accomplishment of the goal) when dealing with multi-modal data such as videos, images, audio, text messages, and so on, which would be the case for various applications such as intelligent transportation systems where each autonomous vehicle needs to deal with real-time videos and data from a number of sensors including radars. A notable difficulty of existing SC frameworks lies in handling the discrete constraints imposed on the pursued semantic coding and its interaction with the independent knowledge base, which makes reliable semantic extraction extremely challenging. Therefore, we develop a new lightweight hashing-based semantic extraction approach to the SC framework, where our learning objective is to generate one-time signatures (hash codes) using supervised learning for low latency, secure and efficient management of the SC dynamics. We first evaluate the proposed semantic extraction framework over large image data sets, extend it with domain adaptive hashing and then demonstrate the effectiveness of \"semantics signature\" in bulk transmission and multi-modal data.",
    "entities": {
      "0": {
        "Entity name": "lightweight hashing-based semantic extraction",
        "Type": "6G-related technique",
        "Functions": "generate one-time signatures (hash codes) for low-latency secure SC management",
        "Benefits": "enable efficient interpretation of multi-modal data",
        "Components and sub-systems": "semantic coding, knowledge base",
        "Associated algorithms": "domain adaptive hashing",
        "Application and deployment scenarios": "intelligent transportation systems"
      }
    }
  },


  "105": {
    "title": "Concurrent Downlink and Uplink Joint Communication and Sensing for 6G Networks",
    "description": "Joint communication and sensing (JCAS) is a promising technology for 6th Generation (6G) mobile networks, such as intelligent vehicular networks, intelligent manufacturing, and so on. Equipped with two spatially separated antenna arrays, the base station (BS) can perform downlink active JCAS in a mono-static setup. This paper proposes a Concurrent Downlink and Uplink (CDU) JCAS system where the BS can use the echo of transmitted dedicated signals for sensing in the uplink timeslot, while performing reliable uplink communication. A novel successive interference cancellation-based CDU JCAS processing method is proposed to enable the estimation of uplink communication symbols and downlink sensing parameters. Extensive simulation results verify the feasibility of the CDU JCAS system, showing a performance improvement of more than 10 dB compared to traditional JCAS methods while maintaining reliable uplink communication.",
    "entities": {
      "0": {
        "entity name": "Concurrent Downlink and Uplink (CDU) JCAS",
        "Type": "6G-related technique",
        "Functions": "use the echo of transmitted dedicated signals for sensing in the uplink timeslot, while performing reliable uplink communication",
        "Benefits": "performance improvement of more than 10 dB compared to traditional JCAS methods",
        "Components and sub-systems": "successive interference cancellation-based CDU JCAS processing method",
        "Application and deployment scenarios": "intelligent vehicular networks, intelligent manufacturing"
      }
    }
  },



  "106": {
    "title": "Single-Photon Counting Receivers for Optical Wireless Communications in Future 6G Networks",
    "description": "Optical wireless communication (OWC) offers several complementary advantages to radio-frequency wireless networks such as its massive available spectrum; hence, it is widely anticipated that OWC will assume a pivotal role in the forthcoming sixth generation wireless communication networks. Although significant progress has been achieved in OWC over the past decades, the outage induced by occasionally low received optical power continues to pose a key limiting factor for its deployment. In this work, we discuss the potential role of single-photon counting (SPC) receivers as a promising solution to overcome this limitation. We present an overview of the applications of SPC-based OWC systems in 6G networks, introduce their major performance-limiting factors, propose a performance enhancement framework to tackle these issues, and identify critical areas of open problems for future research.",
    "entities": {
      "0": {
        "entity name": "single-photon counting (SPC) receivers",
        "Type": "6G-related technique",
        "Functions": "overcome the limitation of outage induced by occasionally low received optical power",
        "Benefits": "enhancing the performance of optical wireless communication (OWC) systems",
        "Application and deployment scenarios": "Optical wireless communication (OWC)"
      }
    }
  },


  "107": {
    "title": "Towards Distributed and Intelligent Integrated Sensing and Communications for 6G Networks",
    "description": "This paper introduces the distributed and intelligent integrated sensing and communications (DISAC) concept, a transformative approach for 6G wireless networks that extends the emerging concept of integrated sensing and communications (ISAC). DISAC addresses the limitations of the existing ISAC models and, to overcome them, it introduces two novel foundational functionalities for both sensing and communications: a distributed architecture (enabling large-scale and energy-efficient tracking of connected users and objects, leveraging the fusion of heterogeneous sensors) and a semantic and goal-oriented framework (enabling the transition from classical data fusion to the composition of semantically selected information).",
    "entities": {
      "0": {
        "entity name": "distributed and intelligent integrated sensing and communications (DISAC)",
        "Type": "6G-related technique",
        "Functions": "enabling large-scale and energy-efficient tracking of connected users and objects, leveraging the fusion of heterogeneous sensors; enabling the transition from classical data fusion to the composition of semantically selected information",
        "Benefits": "addresses the limitations of the existing ISAC models",
        "Components and sub-systems": "distributed architecture, semantic and goal-oriented framework",
        "Application and deployment scenarios": "6G wireless networks"
      }
    }
  },



  "108": {
    "title": "3TO: THz-Enabled Throughput and Trajectory Optimization of UAVs in 6G Networks by Proximal Policy Optimization Deep Reinforcement Learning",
    "description": "Next-generation networks need to meet ubiquitous and high data-rate demand. Therefore, this paper considers the throughput and trajectory optimization of terahertz (THz)-enabled unmanned aerial vehicles (UAVs) in the sixth-generation (6G) communication networks. In the considered scenario, multiple UAVs must provide on-demand terabits per second (TB/s) services to an urban area along with existing terrestrial networks. However, THz-empowered UAVs pose some new constraints, e.g., dynamic THz-channel conditions for ground users (GUs) association and UAV trajectory optimization to fulfill GU's throughput demands. Thus, a framework is proposed to address these challenges, where a joint UAVs-GUs association, transmit power, and the trajectory optimization problem is studied. The formulated problem is mixed-integer non-linear programming (MINLP), which is NP-hard to solve. Consequently, an iterative algorithm is proposed to solve three sub-problems iteratively, i.e., UAVs-GUs association, transmit power, and trajectory optimization. Simulation results demonstrate that the proposed algorithm increased the throughput by up to 10%, 68.9%, and 69.1% respectively compared to baseline algorithms.",
    "entities": {
      "0": {
        "entity name": "terahertz (THz)-enabled unmanned aerial vehicles (UAVs)",
        "Type": "6G-related technique",
        "Functions": "provide on-demand terabits per second (TB/s) services to an urban area",
        "Benefits": "increased the throughput by up to 10%, 68.9%, and 69.1% respectively compared to baseline algorithms",
        "Key performance indicators": "throughput",
        "Operating frequency": "terahertz (THz)",
        "Associated algorithms": "Proximal Policy Optimization Deep Reinforcement Learning; iterative algorithm",
        "Application and deployment scenarios": "6G communication networks"
      }
    }
  },


"109": {
    "title": "Wireless Federated Learning (WFL) for 6G Networks -- Part II: The Compute-then-Transmit NOMA Paradigm",
    "description": "As it has been discussed in the first part of this work, the utilization of advanced multiple access protocols and the joint optimization of the communication and computing resources can facilitate the reduction of delay for wireless federated learning (WFL), which is of paramount importance for the efficient integration of WFL in the sixth generation of wireless networks (6G). To this end, in this second part we introduce and optimize a novel communication protocol for WFL networks, that is based on non-orthogonal multiple access (NOMA). More specifically, the Compute-then-Transmit NOMA (CT-NOMA) protocol is introduced, where users terminate concurrently the local model training and then simultaneously transmit the trained parameters to the central server. Moreover, two different detection schemes for the mitigation of inter-user interference in NOMA are considered and evaluated, which correspond to fixed and variable decoding order during the successive interference cancellation process. Furthermore, the computation and communication resources are jointly optimized for both considered schemes, with the aim to minimize the total delay during a WFL communication round. Finally, the simulation results verify the effectiveness of CT-NOMA in terms of delay reduction, compared to the considered benchmark that is based on time-division multiple access.",
    "entities": {
      "0": {
        "entity name": "Compute-then-Transmit NOMA (CT-NOMA)",
        "Type": "6G-related technique",
        "Functions": "joint optimization of communication and computing resources, reduction of delay",
        "Benefits": "minimizes total delay during a WFL communication round",
        "Components and sub-systems": "local model training, central server",
        "Key performance indicators": "delay",
        "Control mechanisms": "fixed and variable decoding order during successive interference cancellation",
        "Application and deployment scenarios": "wireless federated learning (WFL) networks"
      }
    }
  },


  "110": {
    "title": "Client-Based Intelligence for Resource Efficient Vehicular Big Data Transfer in Future 6G Network",
    "description": "Vehicular big data is anticipated to become the \"new oil\" of the automotive industry which fuels the development of novel crowdsensing-enabled services. However, the tremendous amount of transmitted vehicular sensor data represents a massive challenge for the cellular network. A promising method for achieving relief which allows to utilize the existing network resources in a more efficient way is the utilization of intelligence on the end-edge-cloud devices. Through machine learning-based identification and exploitation of highly resource efficient data transmission opportunities, the client devices are able to participate in overall network resource optimization process. In this work, we present a novel client-based opportunistic data transmission method for delay-tolerant applications which is based on a hybrid machine learning approach: Supervised learning is applied to forecast the currently achievable data rate which serves as the metric for the reinforcement learning-based data transfer scheduling process. In addition, unsupervised learning is applied to uncover geospatially-dependent uncertainties within the prediction model. In a comprehensive real world evaluation in the public cellular networks of three German Mobile Network Operators (MNOs), we show that the average data rate can be improved by up to 223 % while simultaneously reducing the amount of occupied network resources by up to 89 %. As a side-effect of preferring more robust network conditions for the data transfer, the transmission-related power consumption is reduced by up to 73 %. The price to pay is an increased Age of Information (AoI) of the sensor data.",
    "entities": {
      "0": {
        "entity name": "novel client-based opportunistic data transmission method for delay-tolerant applications",
        "Type": "6G-related technique",
        "Functions": "Supervised learning is applied to forecast the currently achievable data rate which serves as the metric for the reinforcement learning-based data transfer scheduling process; unsupervised learning is applied to uncover geospatially-dependent uncertainties within the prediction model",
        "Benefits": "the average data rate can be improved by up to 223 % while simultaneously reducing the amount of occupied network resources by up to 89 %; the transmission-related power consumption is reduced by up to 73 %; increased Age of Information (AoI) of the sensor data",
        "Components and sub-systems": "hybrid machine learning approach",
        "Application and deployment scenarios": "delay-tolerant applications"
      }
    }
  },



  "111": {
    "title": "Toward Experience-Driven Traffic Management and Orchestration in Digital-Twin-Enabled 6G Networks",
    "description": "The envisioned 6G networks are expected to support extremely high data rates, low-latency, and radically new applications empowered by machine learning. The futuristic 6G networks require a novel framework that can be used to operate, manage, and optimize its underlying services such as ultra-reliable and low-latency communication, and Internet of everything. In recent years, artificial intelligence (AI) has demonstrated significant success in optimizing and designing networks. The AI-enabled traffic orchestration can dynamically organize different network architectures and slices to provide quality of experience considering the dynamic nature of the wireless communication network. In this paper, we propose a digital twin enabled network framework, empowered by AI to cater the variability and complexity of envisioned 6G networks, to provide smart resource management and intelligent service provisioning. Digital twin paves a way for achieving optimizing 6G services by creating a virtual representation of the 6G network along with its associated communication technologies (e.g., intelligent reflecting surfaces, terahertz and millimeter communication), computing systems (e.g., cloud computing and fog computing) with its associated algorithms (e.g., optimization and machine learning). We then discuss and review the existing AI-enabled traffic management and orchestration techniques and highlight future research directions and potential solutions in 6G networks.",
    "entities": {
      "0": {
        "entity name": "digital twin enabled network framework",
        "Type": "6G-related technique",
        "Functions": "smart resource management, intelligent service provisioning",
        "Benefits": "optimizes 6G services, caters to variability and complexity of 6G networks",
        "Components and sub-systems": "intelligent reflecting surfaces, terahertz and millimeter communication, cloud computing, fog computing",
        "Associated algorithms": "optimization, machine learning",
        "Application and deployment scenarios": "AI-enabled traffic management and orchestration in 6G networks"
      }
    }
  },


  "112": {
    "title": "A Collaborative Statistical Actor-Critic Learning Approach for 6G Network Slicing Control",
    "description": "Artificial intelligence (AI)-driven zero-touch massive network slicing is envisioned to be a disruptive technology in beyond 5G (B5G)/6G, where tenancy would be extended to the final consumer in the form of advanced digital use-cases. In this paper, we propose a novel model-free deep reinforcement learning (DRL) framework, called collaborative statistical Actor-Critic (CS-AC) that enables a scalable and farsighted slice performance management in a 6G-like RAN scenario that is built upon mobile edge computing (MEC) and massive multiple-input multiple-output (mMIMO). In this intent, the proposed CS-AC targets the optimization of the latency cost under a long-term statistical service-level agreement (SLA). In particular, we consider the Q-th delay percentile SLA metric and enforce some slice-specific preset constraints on it. Moreover, to implement distributed learners, we propose a developed variant of soft Actor-Critic (SAC) with less hyperparameter sensitivity. Finally, we present numerical results to showcase the gain of the adopted approach on our built OpenAI-based network slicing environment and verify the performance in terms of latency, SLA Q-th percentile, and time efficiency. To the best of our knowledge, this is the first work that studies the feasibility of an AI-driven approach for massive network slicing under statistical SLA.",
    "entities": {
      "0": {
        "entity name": "collaborative statistical Actor-Critic (CS-AC)",
        "Type": "6G-related technique",
        "Functions": "scalable and farsighted slice performance management, optimization of latency cost",
        "Benefits": "optimizes latency cost under long-term statistical SLA",
        "Key performance indicators": "latency, SLA Q-th percentile",
        "Associated algorithms": "soft Actor-Critic (SAC)",
        "Application and deployment scenarios": "6G-like RAN scenario with mobile edge computing (MEC) and massive multiple-input multiple-output (mMIMO)"
      }
    }
  },


  "113": {
    "title": "Towards Organic 6G Networks: Virtualization and Live Migration of Core Network Functions",
    "description": "In the context of Industry 4.0, more and more mobile use cases are appearing on industrial factory floors. These use cases place high demands on various quantitative requirements, such as latency, availability, and more. In addition, qualitative requirements such as flexibility are arising. Since virtualization technology is a key enabler for the flexibility that is required by novel use cases and on the way to organic networking as it is addressed by 6G, we investigate container virtualization technology in this paper. We focus on container technology since OS-level virtualization has multiple benefits compared to hardware virtualization, such as VMs. Thus, we discuss several aspects of container based virtualization, e.g. selection of suitable network drivers and orchestration tools, with respect to most important 5GC functions. In addition, the functions have different quantitative or qualitative requirements depending on whether they are stateless or stateful, and whether the specific function is located at either the control or user plane. Therefore, we also analyze the aforementioned live migration concepts for the 5GC functions and evaluate them based on well-defined metrics, such as migration time and process downtime.",
    "entities": {
      "0": {
        "entity name": "container virtualization technology",
        "Type": "6G-related technique",
        "Functions": "enables flexibility for novel use cases, live migration of core network functions",
        "Benefits": "provides flexibility, reduces migration time and process downtime",
        "Components and sub-systems": "network drivers, orchestration tools",
        "Key performance indicators": "migration time, process downtime",
        "Application and deployment scenarios": "industrial factory floors, 5GC functions"
      }
    }
  },






  "114": {
    "title": "An information security monitoring and management system for 5G and 6G Networks based on SDN/NFV",
    "description": "An approach to using the concept of Software-Defined Networking and Network Functions Virtualization (SDN/NFV) for the implementation of an information security monitoring and management system in 5G and 6G networks is proposed. SDN switches based on the OpenFlow protocol are offered as network sensors. In order to reduce the time for finding a subset of the right rules in the vast array of all rules on traffic filtering systems that are logically located on sensors, a method of processing and filtering traffic in 5G and 6G transport networks is proposed. This method is based on DPDK with the LPM algorithm and is capable of processing up to 8 megapackets per second on 1 CPU core; the packet processing takes O(1), which is significantly lower than with similar algorithms. The managing subsystem consists of regional monitoring centres and a main one. The main Monitoring Centre includes a main cluster of SDN controllers along with Active/Active redundancy scheme. The regional centres represent SDN software controllers that manage locally subordinate sensors. All the managing centres are interconnected via the Transport subsystem and form a network. An algorithm for network sensor load balancing between SDN controllers has been developed in order to provide fault tolerance, load balancing and network connectivity. The algorithm results in a set of optimal sensor groups with total load not exceeding the maximum capacity of the SDN controllers.",
    "entities": {
      "0": {
        "entity name": "information security monitoring and management system",
        "Type": "6G-related technique",
        "Functions": "processes and filters traffic, provides fault tolerance and load balancing",
        "Benefits": "reduces time for finding traffic filtering rules, ensures network connectivity",
        "Components and sub-systems": "SDN switches, OpenFlow protocol, DPDK with LPM algorithm",
        "Associated algorithms": "LPM algorithm, network sensor load balancing algorithm",
        "Application and deployment scenarios": "5G and 6G transport networks"
      }
    }
  },


  "115": {
    "title": "Safehaul: Risk-Averse Learning for Reliable mmWave Self-Backhauling in 6G Networks",
    "description": "Wireless backhauling at millimeter-wave frequencies (mmWave) in static scenarios is a well-established practice in cellular networks. However, highly directional and adaptive beamforming in today's mmWave systems have opened new possibilities for self-backhauling. Tapping into this potential, 3GPP has standardized Integrated Access and Backhaul (IAB) allowing the same base station serve both access and backhaul traffic. Although much more cost-effective and flexible, resource allocation and path selection in IAB mmWave networks is a formidable task. To date, prior works have addressed this challenge through a plethora of classic optimization and learning methods, generally optimizing a Key Performance Indicator (KPI) such as throughput, latency, and fairness, and little attention has been paid to the reliability of the KPI. We propose Safehaul, a risk-averse learning-based solution for IAB mmWave networks. In addition to optimizing average performance, Safehaul ensures reliability by minimizing the losses in the tail of the performance distribution. We develop a novel simulator and show via extensive simulations that Safehaul not only reduces the latency by up to 43.2% compared to the benchmarks but also exhibits significantly more reliable performance (e.g., 71.4% less variance in achieved latency).",
    "entities": {
      "0": {
        "entity name": "Integrated Access and Backhaul (IAB)",
        "Type": "6G-related technique",
        "Functions": "serve both access and backhaul traffic",
        "Benefits": "cost-effective and flexible",
        "Key performance indicators": "throughput, latency, and fairness",
        "Operating frequency": "millimeter-wave frequencies (mmWave)"
      },
      "1": {
        "entity name": "Safehaul",
        "Type": "6G-related technique",
        "Functions": "risk-averse learning-based solution for IAB mmWave networks",
        "Benefits": "reduces latency by up to 43.2%, 71.4% less variance in achieved latency",
        "Key performance indicators": "latency"
      }
    }
  },


  "116": {
    "title": "Obstacle-Aware Positioning of a Mobile Robotic Platform for 6G Networks",
    "description": "The 6G paradigm and the massive usage of interconnected wireless devices introduced the need for flexible wireless networks. A promising approach lies in employing Mobile Robotic Platforms (MRPs) to create communications cells on-demand. The challenge consists in positioning the MRPs to improve the wireless connectivity offered. This is exacerbated in millimeter wave (mmWave), Terahertz (THz), and visible light-based networks, which imply the establishment of short-range, Line of Sight (LoS) wireless links to take advantage of the ultra-high bandwidth channels available. This paper proposes a solution to enable the obstacle-aware, autonomous positioning of MRPs and provide LoS wireless connectivity to communications devices. It consists of 1) a Vision Module that uses video data gathered by the MRP to determine the location of obstacles, wireless devices and users, and 2) a Control Module, which autonomously positions the MRP based on the information provided by the Vision Module. The proposed solution was validated in simulation and through experimental testing, showing that it is able to position an MRP while ensuring LoS wireless links between a mobile communications cell and wireless devices or users.",
    "entities": {
      "0": {
        "entity name": "Mobile Robotic Platforms (MRPs)",
        "Type": "6G-related technique",
        "Functions": "create communications cells on-demand, provide LoS wireless connectivity",
        "Benefits": "improve wireless connectivity",
        "Components and sub-systems": "Vision Module, Control Module",
        "Operating frequency": "millimeter wave (mmWave), Terahertz (THz), visible light"
      }
    }
  },

  "117": {
    "title": "Hierarchical Digital Twin for Efficient 6G Network Orchestration via Adaptive Attribute Selection and Scalable Network Modeling",
    "description": "Achieving a holistic and long-term understanding through accurate network modeling is essential for orchestrating future networks with increasing service diversity and infrastructure complexities. However, due to unselective data collection and uniform processing, traditional modeling approaches undermine the efficacy and timeliness of network orchestration. Additionally, temporal disparities arising from various modeling delays further impair the centralized decision-making with distributed models. In this paper, we propose a new hierarchical digital twin paradigm adapting to real-time network situations for problem-centered model construction. Specifically, we introduce an adaptive attribute selection mechanism that evaluates the distinct modeling values of diverse network attributes, considering their relevance to current network scenarios and inherent modeling complexity. By prioritizing critical attributes at higher layers, an efficient evaluation of network situations is achieved to identify target areas. Subsequently, scalable network modeling facilitates the inclusion of all identified elements at the lower layers, where more fine-grained digital twins are developed to generate targeted solutions for user association and power allocation. Furthermore, virtual-physical domain synchronization is implemented to maintain accurate temporal alignment between the digital twins and their physical counterparts, spanning from the construction to the utilization of the proposed paradigm. Extensive simulations validate the proposed approach, demonstrating its effectiveness in efficiently identifying pressing issues and delivering network orchestration solutions in complex 6G HetNets.",
    "entities": {
      "0": {
        "entity name": "hierarchical digital twin paradigm",
        "Type": "6G-related technique",
        "Functions": "adapting to real-time network situations for problem-centered model construction",
        "Application and deployment scenarios": "delivering network orchestration solutions in complex 6G HetNets"
      },
      "1": {
        "entity name": "adaptive attribute selection mechanism",
        "Type": "6G-related technique",
        "Functions": "evaluates the distinct modeling values of diverse network attributes, considering their relevance to current network scenarios and inherent modeling complexity",
        "Benefits": "prioritizing critical attributes at higher layers"
      },
      "2": {
        "entity name": "scalable network modeling",
        "Type": "6G-related technique",
        "Functions": "facilitates the inclusion of all identified elements at the lower layers, where more fine-grained digital twins are developed to generate targeted solutions for user association and power allocation",
        "Benefits": "targeted solutions for user association and power allocation"
      },
      "3": {
        "entity name": "virtual-physical domain synchronization",
        "Type": "6G-related technique",
        "Functions": "maintain accurate temporal alignment between the digital twins and their physical counterparts",
        "Components and sub-systems": "digital twins and their physical counterparts"
      }
    }
  },



  "118": {
    "title": "Automatic Retrieval-augmented Generation of 6G Network Specifications for Use Cases",
    "description": "6G Open Radio Access Networks (O-RAN) promises to open data interfaces to enable plug-and-play service Apps, many of which are consumer and business-facing. Opening up 6G access lowers the barrier to innovation but raises the challenge that the required communication specifications are not fully known to all service designers. As such, business innovators must either be familiar with 6G standards or consult with experts. Enabling consistent, unbiased, rapid, and low-cost requirement assessment and specification generation is crucial to the O-RAN innovation ecosystem. Here, we discuss our initiative to bridge service specification gaps between network service providers and business innovators leveraging Large Language Models (LLMs). We first review the state-of-the-art and motivation in 6G plug-and-play services, capabilities, potential use cases and LLMs. We identify an ample innovation space for hybrid use cases that may require diverse and variational wireless functionalities across its operating time. We show that the network specification can be automated and present the first automatic retrieval-augmented network service specification framework for 6G use cases. To enable public acceptance and feedback, a website interface is published for the research and industrial community to experiment with the framework. We hope this review highlights the need for emerging foundation models for this area and motivates researcher engagement and contribution to the community through our framework.",
    "entities": {
      "0": {
        "entity name": "6G Open Radio Access Networks (O-RAN)",
        "Type": "6G-related technique",
        "Functions": "open data interfaces to enable plug-and-play service Apps",
        "Benefits": "lowers the barrier to innovation"
      },
      "1": {
        "entity name": "automatic retrieval-augmented network service specification framework",
        "Type": "6G-related technique",
        "Functions": "present the first automatic retrieval-augmented network service specification framework for 6G use cases",
        "Benefits": "consistent, unbiased, rapid, and low-cost requirement assessment and specification generation",
        "Associated technologies": "Large Language Models (LLMs)"
      }
    }
  },


  "119": {
    "title": "IREE Oriented Green 6G Networks: A Radial Basis Function Based Approach",
    "description": "In order to provide design guidelines for energy efficient 6G networks, we propose a novel radial basis function (RBF) based optimization framework to maximize the integrated relative energy efficiency (IREE) metric. Different from the conventional energy efficient optimization schemes, we maximize the transformed utility for any given IREE using spectrum efficiency oriented RBF network and gradually update the IREE metric using proposed Dinkelbach's algorithm. The existence and uniqueness properties of RBF networks are provided, and the convergence conditions of the entire framework are discussed as well. Through some numerical experiments, we show that the proposed IREE outperforms many existing SE or EE oriented designs and find a new Jensen-Shannon (JS) divergence constrained region, which behaves differently from the conventional EE-SE region. Meanwhile, by studying IREE-SE trade-offs under different traffic requirements, we suggest that network operators shall spend more efforts to balance the distributions of traffic demands and network capacities in order to improve the IREE performance, especially when the spatial variations of the traffic distribution are significant.",
    "entities": {
      "0": {
        "Entity name": "radial basis function (RBF) based optimization framework",
        "Type": "6G-related technique",
        "Functions": "maximizing integrated relative energy efficiency (IREE)",
        "Benefits": "improved energy efficiency performance",
        "Associated algorithms": "Dinkelbach's algorithm",
        "Key performance indicators": "IREE, spectrum efficiency",
        "Associated technologies": "Jensen-Shannon (JS) divergence"
      },
      "1": {
        "entity name": "spectrum efficiency oriented RBF network",
        "Type": "6G-related technique",
        "Functions": "maximize the transformed utility for any given IREE"
      }
    }
  },


  "120": {
    "title": "COLoRIS: Localization-agnostic Smart Surfaces Enabling Opportunistic ISAC in 6G Networks",
    "description": "The integration of Smart Surfaces in 6G communication networks, also dubbed as Reconfigurable Intelligent Surfaces (RISs), is a promising paradigm change gaining significant attention given its disruptive features. RISs are a key enabler in the realm of 6G Integrated Sensing and Communication (ISAC) systems where novel services can be offered together with the future mobile networks communication capabilities. This paper addresses the critical challenge of precisely localizing users within a communication network by leveraging the controlled-reflective properties of RIS elements without relying on more power-hungry traditional methods, e.g., GPS, adverting the need of deploying additional infrastructure and even avoiding interfering with communication efforts. Moreover, we go one step beyond: we build COLoRIS, an Opportunistic ISAC approach that leverages localization agnostic RIS configurations to accurately position mobile users via trained learning models. Extensive experimental validation and simulations in large-scale synthetic scenarios show 5% positioning errors (with respect to field size) under different conditions. Further, we show that a low-complexity version running in a limited off-the-shelf (embedded, low-power) system achieves positioning errors in the 11% range at a negligible +2% energy expense with respect to the classical RIS.",
    "entities": {
      "0": {
        "entity name": "Reconfigurable Intelligent Surfaces (RISs)",
        "Type": "6G-related technique",
        "Functions": "precisely localizing users within a communication network",
        "Benefits": "avoid deploying additional infrastructure, reduce energy expense",
        "Application and deployment scenarios": "6G Integrated Sensing and Communication (ISAC) systems"
      },
      "1": {
        "entity name": "COLoRIS",
        "Type": "6G-related technique",
        "Functions": "leveraging localization agnostic RIS configurations to accurately position mobile users",
        "Benefits": "achieve 5% positioning errors, reduce energy expense",
        "Associated algorithms": "trained learning models"
      }
    }
  },


  "121": {
    "title": "Next-Generation 6G Networks: Deploying Cybertwin Technology for Enhanced Healthcare Solutions",
    "description": "This paper explores the integration of Cybertwin technology within 6G networks to revolutionize healthcare delivery. It aims to enhance real-time monitoring, decision-making, and resource management through the Service-based Hierarchical Framework for Cybertwins in sixth-generation networks. The paper addresses the deployment challenges and proposes system theory as a comprehensive framework for designing complex interactions among healthcare-assigned Cybertwins. The article highlights the role of Cybertwin technology in advancing healthcare solutions, promising improved patient care and operational efficiency. It examines the current network setups and the potential of 6G infrastructure, discussing network topology optimization, theoretical modelling, and future directions. The paper underlines the transformative impact of combining 6G and Cybertwin technologies on healthcare, from high-definition telemedicine to large-scale patient monitoring. The paper further acknowledges the implementation challenges, such as technical complexity, security, and interoperability.",
"entities": {
      "0": {
        "entity name": "Cybertwin technology",
        "Type": "6G-related technique",
        "Functions": "integration within 6G networks to revolutionize healthcare delivery",
        "Benefits": "enhanced real-time monitoring, decision-making, and resource management; improved patient care and operational efficiency",
        "Application and deployment scenarios": "healthcare delivery, high-definition telemedicine, and large-scale patient monitoring"
      },
      "1": {
        "entity name": "Service-based Hierarchical Framework for Cybertwins",
        "Type": "6G-related technique",
        "Functions": "enhance real-time monitoring, decision-making, and resource management",
        "Benefits": "improve patient care and operational efficiency",
        "Components and sub-systems": "healthcare-assigned Cybertwins"
      }
}
},

  "122": {
    "title": "Reasoning AI Performance Degradation in 6G Networks with Large Language Models",
    "description": "The integration of Artificial Intelligence (AI) within 6G networks is poised to revolutionize connectivity, reliability, and intelligent decision-making. However, the performance of AI models in these networks is crucial, as any decline can significantly impact network efficiency and the services it supports. Understanding the root causes of performance degradation is essential for maintaining optimal network functionality. In this paper, we propose a novel approach to reason about AI model performance degradation in 6G networks using the Large Language Models (LLMs) empowered Chain-of-Thought (CoT) method. Our approach employs an LLM as a ''teacher'' model through zero-shot prompting to generate teaching CoT rationales, followed by a CoT ''student'' model that is fine-tuned by the generated teaching data for learning to reason about performance declines. The efficacy of this model is evaluated in a real-world scenario involving a real-time 3D rendering task with multi-Access Technologies (mATs) including WiFi, 5G, and LiFi for data transmission. Experimental results show that our approach achieves over 97% reasoning accuracy on the built test questions, confirming the validity of our collected dataset and the effectiveness of the LLM-CoT method. Our findings highlight the potential of LLMs in enhancing the reliability and efficiency of 6G networks, representing a significant advancement in the evolution of AI-native network infrastructures.",
    "entities": {
      "0": {
        "entity name": "LLMs empowered Chain-of-Thought (CoT) method",
        "Type": "6G-related technique",
        "Functions": "reason about AI model performance degradation in 6G networks",
        "Benefits": "enhancing the reliability and efficiency of 6G networks",
        "Components and sub-systems": "LLM as a 'teacher' model and a CoT 'student' model",
        "Application and deployment scenarios": "real-time 3D rendering task with multi-Access Technologies (mATs) including WiFi, 5G, and LiFi"
      }
    }
  },


  "123": {
    "title": "A Prospective Look: Key Enabling Technologies, Applications and Open Research Topics in 6G Networks",
    "description": "The fifth generation (5G) mobile networks are envisaged to enable a plethora of breakthrough advancements in wireless technologies, providing support of a diverse set of services over a single platform. While the deployment of 5G systems is scaling up globally, it is time to look ahead for beyond 5G systems. This is driven by the emerging societal trends, calling for fully automated systems and intelligent services supported by extended reality and haptics communications. To accommodate the stringent requirements of their prospective applications, which are data-driven and defined by extremely low-latency, ultra-reliable, fast and seamless wireless connectivity, research initiatives are currently focusing on a progressive roadmap towards the sixth generation (6G) networks. In this article, we shed light on some of the major enabling technologies for 6G, which are expected to revolutionize the fundamental architectures of cellular networks and provide multiple homogeneous artificial intelligence-empowered services, including distributed communications, control, computing, sensing, and energy, from its core to its end nodes. Particularly, this paper aims to answer several 6G framework related questions: What are the driving forces for the development of 6G? How will the enabling technologies of 6G differ from those in 5G? What kind of applications and interactions will they support which would not be supported by 5G? We address these questions by presenting a profound study of the 6G vision and outlining five of its disruptive technologies, i.e., terahertz communications, programmable metasurfaces, drone-based communications, backscatter communications and tactile internet, as well as their potential applications. Then, by leveraging the state-of-the-art literature surveyed for each technology, we discuss their requirements, key challenges, and open research problems.",
    "entities": {
      "0": {
        "entity name": "terahertz communications",
        "Type": "6G-related technique",
        "Functions": "provide extremely low-latency, ultra-reliable, fast and seamless wireless connectivity",
        "Application and deployment scenarios": "distributed communications, control, computing, sensing, and energy"
      },
      "1": {
        "entity name": "programmable metasurfaces",
        "Type": "6G-related technique",
        "Functions": "revolutionize the fundamental architectures of cellular networks",
        "Application and deployment scenarios": "distributed communications, control, computing, sensing, and energy"
      },
      "2": {
        "entity name": "drone-based communications",
        "Type": "6G-related technique",
        "Functions": "provide extremely low-latency, ultra-reliable, fast and seamless wireless connectivity",
        "Application and deployment scenarios": "distributed communications, control, computing, sensing, and energy"
      },
      "3": {
        "entity name": "backscatter communications",
        "Type": "6G-related technique",
        "Functions": "provide extremely low-latency, ultra-reliable, fast and seamless wireless connectivity",
        "Application and deployment scenarios": "distributed communications, control, computing, sensing, and energy"
      },
      "4": {
        "entity name": "tactile internet",
        "Type": "6G-related technique",
        "Functions": "provide extremely low-latency, ultra-reliable, fast and seamless wireless connectivity",
        "Application and deployment scenarios": "distributed communications, control, computing, sensing, and energy"
      }
    }
  },

  "124": {
    "title": "Climate Change Sensing through Terahertz Communications: A Disruptive Application of 6G Networks",
    "description": "Climate change resulting from the misuse and over-exploitation of natural resources has affected and continues to impact the planet's ecosystem. This pressing issue is leading to the development of novel technologies to sense and measure damaging gas emissions. In parallel, the accelerating evolution of wireless communication networks is resulting in wider deployment of mobile telecommunication infrastructure. With 5G technologies already being commercially deployed, the research community is starting research into new technologies for 6G. One of the visions for 6G is the use of the terahertz (THz) spectrum. In this paper, we propose and explore the use of THz spectrum simultaneously for ultrabroadband communication and atmospheric sensing by leveraging the absorption of THz signals. Through the use of machine learning, we present preliminary results on how we can analyze signal path loss and power spectral density to infer the concentration of different climate-impacting gases. Our vision is to demonstrate how 6G infrastructure can provide sensor data for climate change sensing, in addition to its primary purpose of wireless communication.",
    "entities": {
      "0": {
        "entity name": "terahertz (THz) spectrum",
        "Type": "6G-related technique",
        "Functions": "ultrabroadband communication and atmospheric sensing",
        "Benefits": "provides sensor data for climate change sensing",
        "Associated algorithms": "machine learning for analyzing signal path loss and power spectral density",
        "Application and deployment scenarios": "climate change sensing and wireless communication"
      }
    }
  },


  "125": {
    "title": "Smart Resource Allocation Model via Artificial Intelligence in Software Defined 6G Networks",
    "description": "In this paper, we design a new flexible smart software-defined radio access network (Soft-RAN) architecture with traffic awareness for sixth generation (6G) wireless networks. In particular, we consider a hierarchical resource allocation model for the proposed smart soft-RAN model where the software-defined network (SDN) controller is the first and foremost layer of the framework. This unit dynamically monitors the network to select a network operation type on the basis of distributed or centralized resource allocation procedures to intelligently perform decision-making. In this paper, our aim is to make the network more scalable and more flexible in terms of conflicting performance indicators such as achievable data rate, overhead, and complexity indicators. To this end, we introduce a new metric, i.e., throughput-overhead-complexity (TOC), for the proposed machine learning-based algorithm, which supports a trade-off between these performance indicators. In particular, the decision making based on TOC is solved via deep reinforcement learning (DRL) which determines an appropriate resource allocation policy. Furthermore, for the selected algorithm, we employ the soft actor-critic (SAC) method which is more accurate, scalable, and robust than other learning methods. Simulation results demonstrate that the proposed smart network achieves better performance in terms of TOC compared to fixed centralized or distributed resource management schemes that lack dynamism. Moreover, our proposed algorithm outperforms conventional learning methods employed in recent state-of-the-art network designs.",
    "entities": {
      "0": {
        "entity name": "smart soft-RAN model",
        "Type": "6G-related technique",
        "Functions": "dynamically monitors the network to select a network operation type on the basis of distributed or centralized resource allocation procedures",
        "Benefits": "more scalable and more flexible",
        "Components and sub-systems": "software-defined network (SDN) controller",
        "Key performance indicators": "throughput-overhead-complexity (TOC)",
        "Associated algorithms": "deep reinforcement learning (DRL) and soft actor-critic (SAC) method",
        "Application and deployment scenarios": "6G wireless networks"
      }
}
},


  "126": {
    "title": "Optimal Weight Scheme for Fusion-Assisted Cooperative Multi-Monostatic Object Localization in 6G Networks",
    "description": "Cooperative multi-monostatic sensing enables accurate positioning of passive targets by combining the sensed environment of multiple base stations (BS). In this work, we propose a novel fusion algorithm that optimally finds the weight to combine the time-of-arrival (ToA) and angle-of-arrival (AoA) likelihood probability density function (PDF) of multiple BSs. In particular, we employ a log-linear pooling function that fuses all BSs' PDFs using a weighted geometric average. We formulated an optimization problem that minimizes the Reverse Kullback Leibler Divergence (RKLD) and proposed an iterative algorithm based on the Monte Carlo importance sampling (MCIS) approach to obtain the optimal fusion weights. Numerical results verify that our proposed fusion scheme with optimal weights outperforms the existing benchmark in terms of positioning accuracy in both unbiased (line-of-sight only) and biased (multipath-rich environment) scenarios.",
    "entities": {
      "0": {
        "entity name": "fusion algorithm for cooperative multi-monostatic sensing",
        "Type": "6G-related technique",
        "Functions": "combines time-of-arrival (ToA) and angle-of-arrival (AoA) likelihood PDFs",
        "Benefits": "improves positioning accuracy in multipath-rich environments",
        "Associated algorithms": "Monte Carlo importance sampling (MCIS) for optimal fusion weights",
"Key performance indicators": "positioning accuracy"
      }
    }
  },


  "127": {
    "title": "Proactive and AoI-aware Failure Recovery for Stateful NFV-enabled Zero-Touch 6G Networks: Model-Free DRL Approach",
    "description": "In this paper, we propose a Zero-Touch, deep reinforcement learning (DRL)-based Proactive Failure Recovery framework called ZT-PFR for stateful network function virtualization (NFV)-enabled networks. To this end, we formulate a resource-efficient optimization problem minimizing the network cost function including resource cost and wrong decision penalty. As a solution, we propose state-of-the-art DRL-based methods such as soft-actor-critic (SAC) and proximal-policy-optimization (PPO). In addition, to train and test our DRL agents, we propose a novel impending-failure model. Moreover, to keep network status information at an acceptable freshness level for appropriate decision-making, we apply the concept of age of information to strike a balance between the event and scheduling based monitoring. Several key systems and DRL algorithm design insights for ZT-PFR are drawn from our analysis and simulation results. For example, we use a hybrid neural network, consisting long short-term memory layers in the DRL agents structure, to capture impending-failures time dependency.",
    "entities": {
      "0": {
        "entity name": "Zero-Touch, deep reinforcement learning (DRL)-based Proactive Failure Recovery framework",
        "Type": "6G-related technique",
        "Functions": "proactive failure recovery and resource-efficient optimization",
        "Benefits": "minimizes network cost and maintains network status freshness",
        "Associated algorithms": "soft-actor-critic (SAC) and proximal-policy-optimization (PPO)"
      }
    }
  },



  "128": {
    "title": "AoI Minimization in Energy Harvesting and Spectrum Sharing Enabled 6G Networks",
    "description": "Spectrum sharing is a method to solve the problem of frequency spectrum deficiency. This paper studies a novel AI based spectrum sharing and energy harvesting system in which the freshness of information (AoI) is guaranteed. The system includes a primary user with access rights to the spectrum and a secondary user. The secondary user is an energy harvesting sensor that intends to use the primary user spectrum opportunistically. The problem is formulated as partially observable Markov decision processes (POMDPs) and solved using two methods: a deep Q-network (DQN) and dueling double deep Q-Network (D3QN) to achieve the optimal policy. The purpose is to choose the best action adaptively in every time slot based on its situation in both overlay and underlay modes to minimize the average AoI of the secondary user. Finally, simulation experiments are performed to evaluate the effectiveness of the proposed scheme compared to the overlay mode. According to the results, the average AoI in the proposed system is less than that of the existing models, including only overlay mode. The average user access improved from 30% in the overlay mode to 45% in the DQN and 48% in the D3QN.",
     "entities": {
      "0": {
        "Entity name": "AI based spectrum sharing and energy harvesting system",
        "Type": "6G-related technique",
        "Functions": "solve frequency spectrum deficiency, guarantee freshness of information (AoI)",
        "Benefits": "minimize average AoI, improve user access from 30% to 48%",
        "Components and sub-systems": "primary user, secondary user (energy harvesting sensor)",
        "Key performance indicators": "AoI",
        "Associated algorithms": "deep Q-network (DQN), dueling double deep Q-Network (D3QN)",
        "Application and deployment scenarios": "overlay and underlay modes",
        "Associated technologies": "energy harvesting"
      }
    }
  },

  "129": {
    "title": "Near-field 6G Networks: Why Mobile Terahertz Communications MUST Operate in the Near Field",
    "description": "Near-field mobile terahertz (THz) communications is one of the candidate enablers for high-rate wireless data exchange in sixth-generation (6G) networks. However, operating in the THz near field brings both attractive opportunities and severe challenges. Hence, it becomes of interest to explore if it is possible to design a realistic mobile THz communication system without working in the THz near field. To answer this question, a mathematical framework is presented modeling a mobile THz link that works exclusively in the far field. The study leads to an interesting theoretical conclusion: while the actual frequency is of (almost) no interest, such a system must operate over a limited bandwidth not exceeding a certain threshold. It is then numerically shown that operating only in the far field imposes stringent limitations on mobile THz communications, thus making them less attractive to prospective high-rate services. In contrast, it is shown that a stationary THz link can still be broadband even when staying exclusively in the THz far field. Hence, broadband mobile THz communications MUST be near-field, while broadband stationary THz links do not have to.",
    "entities": {
      "0": {
        "Entity name": "Near-field mobile terahertz communications",
        "Type": "6G-related technique",
        "Functions": "high-rate wireless data exchange",
        "Benefits": "enable broadband mobile communications",
        "Key performance indicators": "bandwidth",
        "Operating frequency": "THz",
        "Associated technologies": "far-field THz communications"
      }
    }
  },

  "130": {
    "title": "SIX-Trust for 6G: Towards a Secure and Trustworthy 6G Network",
    "description": "Recent years have witnessed a digital explosion with the deployment of 5G and proliferation of 5G-enabled innovations. Compared with 5G, 6G is envisioned to achieve much higher performance in terms of latency, data rate, connectivity, energy efficiency, coverage and mobility. To fulfil these expectations, 6G will experience a number of paradigm shifts, such as exploiting new spectrum, applying ubiquitous ML/AI technologies and building a space-air-ground-sea integrated network. However, these paradigm shifts may lead to numerous new security and privacy issues, which traditional security measures may not be able to deal with. To tackle these issues and build a trustworthy 6G network, we introduce a novel trust framework named as SIX-Trust, which composes of 3 layers: sustainable trust (S-Trust), infrastructure trust (I-Trust) and xenogenesis trust (X-Trust). Each layer plays a different role, and the importance of each layer varies for different application scenarios of 6G. For each layer, we briefly introduce its related enabling technologies, and demonstrate how these technologies can be applied to enhance trust and security of the 6G network. In general, SIX-Trust provides a holistic framework for defining and modeling trust of 6G, which can facilitate establishing a trustworthy 6G network.",
    "entities": {
      "0": {
        "Entity name": "SIX-Trust framework",
        "Type": "6G-related technique",
        "Functions": "enhance trust and security",
        "Benefits": "holistic framework for trustworthy 6G network",
        "Components and sub-systems": "sustainable trust (S-Trust), infrastructure trust (I-Trust), xenogenesis trust (X-Trust)",
        "Associated technologies": "ML/AI, space-air-ground-sea integrated network"
      }
    }
  },


  "131": {
    "title": "Dynamic Fairness-Aware Spectrum Auction for Enhanced Licensed Shared Access in 6G Networks",
    "description": "This article introduces a new approach to address the spectrum scarcity challenge in 6G networks by implementing the enhanced licensed shared access (ELSA) framework. Our proposed auction mechanism aims to ensure fairness in spectrum allocation to mobile network operators (MNOs) through a novel weighted auction called the fair Vickery-Clarke-Groves (FVCG) mechanism. Through comparison with traditional methods, the study demonstrates that the proposed auction method improves fairness significantly. We suggest using spectrum sensing and integrating UAV-based networks to enhance efficiency of the LSA system. This research employs two methods to solve the problem. We first propose a novel greedy algorithm, named market share based weighted greedy algorithm (MSWGA) to achieve better fairness compared to the traditional auction methods and as the second approach, we exploit deep reinforcement learning (DRL) algorithms, to optimize the auction policy and demonstrate its superiority over other methods. Simulation results show that the deep deterministic policy gradient (DDPG) method performs superior to soft actor critic (SAC), MSWGA, and greedy methods. Moreover, a significant improvement is observed in fairness index compared to the traditional greedy auction methods. This improvement is as high as about 27% and 35% when deploying the MSWGA and DDPG methods, respectively.",
    "entities": {
      "0": {
        "Entity name": "Enhanced licensed shared access (ELSA) framework",
        "Type": "6G-related technique",
        "Functions": "address spectrum scarcity challenge",
        "Benefits": "improve fairness in spectrum allocation",
        "Components and sub-systems": "spectrum sensing, UAV-based networks",
        "Associated algorithms": "fair Vickery-Clarke-Groves (FVCG), market share based weighted greedy algorithm (MSWGA), deep reinforcement learning (DRL)",
        "Associated technologies": "UAV-based networks"
      }
    }
  },


  "132": {
    "title": "Low-latency Federated Learning and Blockchain for Edge Association in Digital Twin empowered 6G Networks",
    "description": "Emerging technologies such as digital twins and 6th Generation mobile networks (6G) have accelerated the realization of edge intelligence in Industrial Internet of Things (IIoT). The integration of digital twin and 6G bridges the physical system with digital space and enables robust instant wireless connectivity. With increasing concerns on data privacy, federated learning has been regarded as a promising solution for deploying distributed data processing and learning in wireless networks. However, unreliable communication channels, limited resources, and lack of trust among users, hinder the effective application of federated learning in IIoT. In this paper, we introduce the Digital Twin Wireless Networks (DTWN) by incorporating digital twins into wireless networks, to migrate real-time data processing and computation to the edge plane. Then, we propose a blockchain empowered federated learning framework running in the DTWN for collaborative computing, which improves the reliability and security of the system, and enhances data privacy. Moreover, to balance the learning accuracy and time cost of the proposed scheme, we formulate an optimization problem for edge association by jointly considering digital twin association, training data batch size, and bandwidth allocation. We exploit multi-agent reinforcement learning to find an optimal solution to the problem. Numerical results on real-world dataset show that the proposed scheme yields improved efficiency and reduced cost compared to benchmark learning method.",
    "entities": {
       "0": {
        "entity name": "Digital Twin Wireless Networks (DTWN)",
        "Type": "6G-related technique",
        "Functions": "incorporating digital twins into wireless networks, to migrate real-time data processing and computation to the edge plane"
      },
      "1": {
        "entity name": "blockchain empowered federated learning framework",
        "Type": "6G-related technique",
        "Functions": "running in the DTWN for collaborative computing",
        "Benefits": "improves the reliability and security of the system, and enhances data privacy"
      }
    }
  },

  "133": {
    "title": "Satellite-based ITS Data Offloading & Computation in 6G Networks: A Cooperative Multi-Agent Proximal Policy Optimization DRL with Attention Approach",
    "description": "The proliferation of intelligent transportation systems (ITS) has led to increasing demand for diverse network applications. However, conventional terrestrial access networks (TANs) are inadequate in accommodating various applications for remote ITS nodes, i.e., airplanes and ships. In contrast, satellite access networks (SANs) offer supplementary support for TANs, in terms of coverage flexibility and availability. In this study, we propose a novel approach to ITS data offloading and computation services based on SANs. We use low-Earth orbit (LEO) and cube satellites (CubeSats) as independent mobile edge computing (MEC) servers that schedule the processing of data generated by ITS nodes. To optimize offloading task selection, computing, and bandwidth resource allocation for different satellite servers, we formulate a joint delay and rental price minimization problem that is mixed-integer non-linear programming (MINLP) and NP-hard. We propose a cooperative multi-agent proximal policy optimization (Co-MAPPO) deep reinforcement learning (DRL) approach with an attention mechanism to deal with intelligent offloading decisions. We also decompose the remaining subproblem into three independent subproblems for resource allocation and use convex optimization techniques to obtain their optimal closed-form analytical solutions. We conduct extensive simulations and compare our proposed approach to baselines, resulting in performance improvements of 9.9%, 5.2%, and 4.2%, respectively.",
    "entities": {
      "0": {
        "Entity name": "Satellite-based ITS data offloading",
        "Type": "6G-related technique",
        "Functions": "data offloading and computation services",
        "Benefits": "minimize delay and rental price",
        "Components and sub-systems": "LEO satellites, CubeSats (MEC servers)",
        "Associated algorithms": "Cooperative multi-agent proximal policy optimization (Co-MAPPO) DRL",
        "Associated technologies": "mobile edge computing (MEC)"
      }
    }
  }
}
